{
	"title":"Bible Bowl - Esther",
	"type":"BIBLE_BOWL",
	"description":"
#Bible Bowl Rules

Players compete over their knowledge of a particular section of Scripture in a competitive game. Two prizes will be awarded: 1) first award will be for the most verses quoted from memory and 2) second for the most points at the end of the quiz.\n

## Order\n

This Bible Bowl is divided into 5 parts:\n

### 1. Scripture Memory\n

Starting oldest to youngest, each player will be given time free of any aid or prompts to quote as many verses from memory from the Bible Bowl section of Scripture.  Prize #1 will be awarded to the player who quoted the most verses successfully.\n

### 2. Monologues\n

Each player will be given opportunity to share a monologue highlighting a person or persons in the Bible Bowl passage of Scripture. Scoring in this round is based on participation. If a player participates, points will be awarded.

1.  Esther == Elyanna
2.  Mordecai == Jeremiah
3.  (Zeresh Talking about) Haman == Rosemary
4.  King === Benjamin
5.  Vashti == Elizabeth
6.  Bigthan = Stephen

#### 1. Vashti

I’m so mad at the king! OH… HI there, I’m sorry my name is Vashti and I WAS THE QUEEN. The 127 provinces of the great empire are only gonna hear the king’s side of the story, but let me tell you mine.  
I was summoned by the king for him to show me off like some trinket to his drunken friends. I did what any self respecting woman would do, I refused to go. THAT WAS MY CRIME. I’m not a bad person. But because the men feared an empire wide revolt among wives would happen if I wasn’t dealt with. So, I’m now apartment shopping.

#### 2. Esther

Shalom, I am Hadassah known by Esther to Gentiles. Orphaned after my parents died, I was raised by Mordecai. A lot of people argue if he’s my uncle or my cousin, but to me he’s the man who raised me. After the king had banished the queen Vashti, I was brought with many other young women to Shushan the Palace. Mordecai and I Agreed I should keep the fact I was a Jew a secret. This ended up being a really important decision in the days to come. My very life and the lives of all my people would be threatened and God would save us by His providence.

#### 3. Mordecai

Shabbat Shalom. My name is Mordecai. I raised my first cousin, Esther since she was a wee little girl. The older she got the harder it was to keep her safe. 1 day the king's very soldiers came to my front door demanding the precious child. I released Esther but instructed her to keep her heritage a secret. God be praised!! Though she was taken from me I had a job in the palace that allowed me to keep an eye on her. One day, I even overheard a plot to kill the king and Esther was in a perfect place for me to get the news safely to the king. Haman, the king’s second, hated my guts! At first I had nothing personal against him, but was just obeying the law of my God and not bowing down to any man. But eventually this nuisance turned himself into an enemy threatening my entire race.

#### 4. Zeresh (Haman)

Hi. I’m newly widowed Zeresh. I wish my husband had been a smarter man and he’d still be alive today, that is to say, if he had just listened to me.

-   It was MY idea to tell the king how valuable my husband was to him.
-   It was MY idea to put that Jew Mordecai in his place.
-   It was MY idea to build a beautiful and HUUGE gallows to hang on.  
    It’s not my fault things turned out the way they did, my ideas are GREAT! Now, excuse me while I go mourn my 10 tens and disappointment of a husband.

#### 5. Conspirator (Bigthan)

The king is weak and has no backbone! Hi i’m Bigthan and my buddy in chains in the corner of there is Teresh. We are patriots of the Persian empire that is being overrun by filthy Jews. Somebody needed to do something about this takeover by an inferior race. Jews are working in the palace like that old Mordecai. The king himself marries that Jewess Esther, but that golden crown doesn’t make her a queen in my book. We were this close to getting rid of that spineless king, but that MORDECAI! Now, we are done for!

#### 6. King

Hi, I’m king Ahaseurus. People think being king is easy and you get to do whatever you want, but it seems I spend more time doing what others want. The one time I thought I acted independently, I selected the radiant Esther as my Queen, But in hindsight even that decision wasn’t just my own. The providence of God was working a plan to save his people, the Jews. I was manipulated by Haman in giving him the seal to destroy the Jews and soon learned to regret it. I even regret to this day, banishing Queen Vashti. At the time I felt cornered by my counselors. Not to my face of course, cause I’m the king, but some might say I’m easily influenced and a bit of a pushover, but God was able in his infinite wisdom to redeem my regretful and often nearsighted choices.\n

### 4. "Teams"\n
Players will be divided into 2 teams at the discretion of the quizmaster. A question will be "tossed up" for either team to answer. The first team to respond with raised hand may given first attempt. If successfully answered, that team will be given a follow-up question for an opportunity to score. At the end of the round, each teams points will be divided evenly among its players. \n

### 5.  "Turn By Turn"\n
turn by turn with opportunity to receive a hint with less points awarded and also to pass. Will choose a "category". 

### 6. "All Answer"\n

The quizmaster reads questions (referred to as “toss-ups”) to the players. The first player to buzz in and answer correctly gets a series of “bonus” questions for that player’s team to answer together. This pattern of toss-up followed by bonus is repeated throughout the game.

A toss-up is comprised of a lead-in sentence to help the players anticipate the Bible verse from which the question will come, followed by the question itself. This format of lead-in followed by question allows students to be challenged in a fun and unique way to recall the verses they have learned.

## Preview\n

There will be a variety to kinds of questions to expect: number answers, color answers, scripture references, lists, charades, toss-up questions leading to an opportunity to score, sword drill, etc. Some questions may require "educated guesses". \n

Each player will need a bible, paper, and pen. No electronic aids will be used, but players will be free to use any or all the approved tools at any time.
",
	"questions":[]
}

