{"pathToFile":"../book-of-romans/03_1601_chapter-16.md","fileName":"03_1601_chapter-16.md","type":".md","link":"https://githubusercontent.com/raw/book-of-romans/03_1601_chapter-16.md","id":100,"content":"# Conclusion to the Book of Romans (Chapter 16)\r\n\r\n## Introduction\r\n\r\n### The Controversy of this Passage\r\n\r\nIt is interesting to note that there is somewhat a controversy over Romans 15:14&mdash;16:27. The question is as follows:\r\n\r\n> Where did Romans originally end? Was 15:13 originally the last verse of Romans?\r\n\r\n> Romans 15:13&mdash; Now the God of hope fill you with all joy and peace in believing, that ye may abound in hope, through the power of the Holy Ghost.\r\n\r\nMany old manuscripts do not contain this passage (15:14-16:27), and at the same time most do in one way or another. Some have it placed at the end of chapter fourteen and others both at the end of chapter fourteen and at the end of the book. This bears no influence of compromising the texts integrity, but can be logically explained. Someone copying the letter and desiring to disperse it among many different churches could have left off the parts personal to the church at Rome.\r\n\r\n### The Personality of This Passage: Personal\r\n\r\nRomans chapter sixteen shows us the personal side of Paul as he sends greetings to Believers who live in Rome. He speaks as one does to friends and not only as a leader or pastor. This sixteenth chapter is often neglected by many. It is by far the most extensive, intimate, and particular of all the words of greeting in Paul's letters (Second to it is Colossians 4). No one can afford to miss this wonderful outpouring of the heart of our Apostle toward the Saints whom he so loved - which means all the Church of God.\r\n\r\nThe spirit of this chapter is exceptional particularly when you consider that Paul did not found the church at Rome and had not even visited it yet (Similar to his letter to Colossae)! Despite that, Paul mentions by name 26 people in that church. \r\n\r\nEach name listed in Paul's closing remarks undoubtedly has a story of courage, love and devotion to the Lord Jesus Christ. Other Than by their names, Paul identifies these people as:\r\n\r\n- kinsmen, sisters, brethren, mother\r\n- servants of the church\r\n- labourers, helpers in Christ\r\n- fellow prisoners\r\n- saints, churches of Christ\r\n- wellbeloved, beloved in the Lord\r\n- firstfruits unto Christ\r\n- in Christ, in the Lord\r\n- approved in Christ\r\n- chosen in the Lord\r\n\r\nThe older men and woman are to leave an example for the younger men and woman.\r\n\r\n## Phebe's Commendation, vs. 1,2\r\n\r\n[NOTE: Several of the quotes in the section are taken from \"Alexander MacLaren's Expositions of Holy Scripture\". Alexandar MacClaren (February 11, 1826 - May 5, 1910) was a  Scotsman and minister of the Gospel for almost 65 years who labored tirelessly in preaching and writing concerning the Scripture. MacClaren's Expositions of Holy Scripture is a collection of over 1,500 expository sermons.]\r\n\r\n> Romans 16:1,2&mdash; I commend unto you Phebe our sister, which is a servant of the church which is at Cenchrea: 2 That ye receive her in the Lord, as becometh saints, and that ye assist her in whatsoever business she hath need of you: for she hath been a succourer of many, and of myself also.\r\n\r\n- 1. Paul recommends a sister (a sister not in the flesh but in the Lord):\r\n\r\n> Closing parenthesis to book: <<Written to the Romans from Corinthus, [and sent by Phebe servant of the church at Cenchrea.]>>\r\n\r\n<!-- -->\r\n\r\n- 2. Cenchrea was a small harbor/port in Corinth\r\n\r\n> \"But if we take into account the hideous immoralities of Corinth, we shall deem it probable that the port, with its shifting maritime population, was, like most seaports, a soil in which goodness was hard put to it to grow, and a church had much against which to struggle. To be a Christian at Cenchrea can have been no light task.\" -- MacClaren\r\n\r\n- 3. Phebe was one of the many good women who helped Paul in the work of the Gospel.\r\n\r\n> \"Her name is a purely idolatrous one, and stamps her as a Greek, and by birth probably a worshipper of Apollo.\" -- MacClaren\r\n\r\n- 4. To Phebe is intrusted this letter who would personally deliver it to the church at Rome.\r\n\r\n> \"Here are Paul the Jew, Phoebe the Greek, and the Roman readers of the epistle, all fused together by the power of the divine love that melted their hearts, and the common faith that unified their lives. The list of names in this chapter, comprising as it does men and women of many nationalities, and some slaves as well as freemen\" -- MacClaren\r\n<!-- -->\r\n> Galatians 3:28 &mdash;There is neither Jew nor Greek, there is neither bond nor free, there is neither male nor female: for ye are all one in Christ Jesus.\r\n<!-- -->\r\n\r\n> \"To the world in which Paul lived it was a strange, new thought that women could share with man in his loftiest emotions. Historically the emancipation of one half of the human race is the direct result of the Christian principle that all are one in Christ Jesus.\" -- MacClaren\r\n\r\n## Greetings and Salutations, vs. 3-15\r\n\r\n> Romans 16:3-16&mdash;3 Greet Priscilla and Aquila my helpers in Christ Jesus: 4 Who have for my life laid down their own necks: unto whom not only I give thanks, but also all the churches of the Gentiles. 5 Likewise greet the church that is in their house. Salute my well-beloved Epaenetus, who is the firstfruits of Achaia unto Christ.\r\n6 Greet Mary, who bestowed much labour on us. 7 Salute Andronicus and Junia, my kinsmen, and my fellow-prisoners, who are of note among the apostles, who also were in Christ before me. 8 Greet Amplias my beloved in the Lord. 9 Salute Urbane, our helper in Christ, and Stachys my beloved. 10 Salute Apelles approved in Christ. Salute them which are of Aristobulus' household. 11 Salute Herodion my kinsman. Greet them that be of the household of Narcissus, which are in the Lord. 12 Salute Tryphena and Tryphosa, who labour in the Lord. Salute the beloved Persis, which laboured much in the Lord. 13 Salute Rufus chosen in the Lord, and his mother and mine. 14 Salute Asyncritus, Phlegon, Hermas, Patrobas, Hermes, and the brethren which are with them. 15 Salute Philologus, and Julia, Nereus, and his sister, and Olympas, and all the saints which are with them.\r\n16 Salute one another with an holy kiss. The churches of Christ salute you.\r\n\r\nPaul Salutes 16 groups of people at Rome:\r\n\r\n1. **Priscilla and Aquila, my helpers in Christ (and the House Church of Priscilla and Aquila)**\r\n\r\n- Priscilla and Aquila were tentmakers as was Paul.\r\n- Traditionally this missionary couple is included in the list of 70 disciples appointed by Jesus in Luke 10. \r\n- They are mentioned six times in four different books of the New Testament. They are always named as a couple and never individually. \r\n- Of those six references, Aquila's name is mentioned first three times and Priscilla's name is mentioned first on three occasions. ( Priscilla is not Aquilla's property but rather his partner both in ministry and marriage.)\r\n- Priscilla and Aquila were last mentioned in Scripture as being in Ephesus ( Acts 18:18-19 ).\r\n\r\n> Acts 18:18 &mdash;And Paul after this tarried there yet a good while, and then took his leave of the brethren, and sailed thence into Syria, and with him Priscilla and Aquila; having shorn his head in Cenchrea: for he had a vow. 19 And he came to Ephesus, and left them there: but he himself entered into the synagogue, and reasoned with the Jews.\r\n\r\nPriscilla and Aquila had been among the Jews expelled from Rome by the Roman Emperor Claudius in the year 49. They ended up in Corinth. Paul lived with Priscilla and Aquila for approximately 18 months. Then the couple started out to accompany Paul when he proceeded to Syria, but stopped at Ephesus. As they are mentioned in Romans 16, Sometime before 56 or 57, they had returned to Rome.\r\n\r\n- The gentile church felt thankful for Priscilla and Aquila because they risked their own necks for them (\"laid down their own necks\").\r\n\r\n2. **Epaenetus, my well-beloved, the first fruits unto Christ of Achaia**\r\n\r\n3. **Mary, who bestowed much labor on us**\r\n\r\n4. **Adronicus and Junia my kinsmen, and my fellow prisoners, of the apostles, were in Christ before Paul**\r\n\r\nOf the twenty-six to whom Paul sends special greetings, at least six are women, indicating the position and importance of women among the Christian group at Rome. The controversy over this short verse:\r\n\r\n\t- Is the person named Junia (feminine name) or Junias (masculine name)?\r\n\t- Is the phrase following the names best translated “outstanding among the apostles” or “well-known to the apostles”?\r\n\r\n5. **Amplias, my beloved in the Lord**\r\n\r\n6. **Urbane, our helper in Christ**\r\n\r\n7. **Stachys, my beloved**\r\n\r\n8. **Apelles approved in Christ**\r\n\r\n9. **Those in Aristobulus&apos;s household**\r\n\r\n10. **Herodian, my kinsman**\r\n\r\n11. **Those of the household of Narcissus, which are in the Lord**\r\n\r\n12. **Tryphena and Tryphosa, labor in the Lord**\r\n\r\n13. **Persis, beloved, which laboured much in the Lord.**\r\n\r\n14. **Rufus chosen in the Lord, and his mother and mine.**\r\n\r\n15. **Asyncritus, Phlegon, Hermas, Patrobas, Hermes, and the brethren which are with them.**\r\n\r\n16. **Philologus, and Julia, Nereus, and his sister, and Olympas, and all the saints which are with them.**\r\n\r\n## A Holy Kiss, vs. 16\r\n\r\n> Romans 16:16&mdash;Salute one another with an holy kiss. The churches of Christ salute you.\r\n\r\n- The 'Holy Kiss\" is an ancient traditional Jewish and Christian greeting. Also called \"kiss of peace\", \"Brother kiss\" among men, or \"Sister kiss\" among women. \r\n- Mentioned 5 times in the New Testament: Romans 16:16; 1 Corinthians 16:20 ; 2 Corinthians 13:12 ; I Thessalonians 5:26 ; 1 Peter 5:14. (\"peace be with you\", \"Shalom\")\r\n- For the first several centuries at least, this kiss was not mouth to cheek, but mouth to mouth. From an early date, to guard against any abuse of this form of salutation, women and men were required to sit separately, and the kiss of peace was given only by women to women and by men to men.\r\n- Most Protestant churches have readopted the holy kiss metaphorically (in that members extend a pure, warm welcome that is referred to as a holy kiss.\r\n\r\n## One Final Warning, vs. 17-20\r\n\r\n> Romans 16:17-20&mdash; Now I beseech you, brethren, mark them which cause divisions and offences contrary to the doctrine which ye have learned; and avoid them. 18 For they that are such serve not our Lord Jesus Christ, but their own belly; and by good words and fair speeches deceive the hearts of the simple. 19 For your obedience is come abroad unto all men. I am glad therefore on your behalf: but yet I would have you wise unto that which is good, and simple concerning evil. 20 And the God of peace shall bruise Satan under your feet shortly. The grace of our Lord Jesus Christ be with you. Amen.\r\n\r\nPaul follows with some pastoral guidance and instruction.\r\n\r\n- \"mark\" them: take aim, take heed; Same word is used in Philippians 3:17\r\n\r\n> Philippians 3:17 &mdash; Brethren, be followers together of me, and mark them which walk so as ye have us for an ensample. \r\n\r\n## Closing, vs. 21-27\r\n\r\n> Romans 16:21-27&mdash;21 Timotheus my workfellow, and Lucius, and Jason, and Sosipater, my kinsmen, salute you. 22 I Tertius, who wrote this epistle, salute you in the Lord. 23 Gaius mine host, and of the whole church, saluteth you. Erastus the chamberlain of the city saluteth you, and Quartus a brother. 24 The grace of our Lord Jesus Christ be with you all. Amen. 25 Now to him that is of power to stablish you according to my gospel, and the preaching of Jesus Christ, according to the revelation of the mystery, which was kept secret since the world began, 26 But now is made manifest, and by the scriptures of the prophets, according to the commandment of the everlasting God, made known to all nations for the obedience of faith: 27 To God only wise, be glory through Jesus Christ for ever. Amen.\r\n\r\nPaul ends with a HALLELUJAH!\r\n\r\n> To God only wise, be glory through Jesus Christ for ever. Amen.","title":"03_1601_chapter-16.md","course_id":"book-of-romans"}