{"pathToFile":"../book-of-romans/04_HANDOUT_001_chapter-4-handout-origin-of-jews.md","fileName":"04_HANDOUT_001_chapter-4-handout-origin-of-jews.md","type":".md","link":"https://githubusercontent.com/raw/book-of-romans/04_HANDOUT_001_chapter-4-handout-origin-of-jews.md","id":102,"content":"<!-- http://www.biblebelievers.org.au/jew.htm -->\r\n\r\nHistory of God's Holy Bible and the so-called Jews\r\n\r\n\r\nThe Etymology of the Word \"Jew\"\r\n\r\nIn his classic Facts are Facts, Jewish historian, researcher and scholar Benjamin Freedman writes: \r\n\r\nJesus is referred as a so-called \"Jew\" for the first time in the New Testament in the 18th century. Jesus is first referred to as a so-called \"Jew\" in the revised 18th century editions in the English language of the 14th century first translations of the New Testament into English. The history of the origin of the word \"Jew\" in the English language leaves no doubt that the 18th century \"Jew\" is the 18th century contracted and corrupted English word for the 4th century Latin \"Iudaeus\" found in St. Jerome's Vulgate Edition. Of that there is no longer doubt.\r\n\r\nThe available original manuscripts from the 4th century to the 18th century accurately trace the origin and give the complete history of the word \"Jew\" in the English language. In these manuscripts are to be found all the many earlier English equivalents extending through the 14 centuries from the 4th to the 18th century. From the Latin \"Iudaeus\" to the English \"Jew\" these English forms included successively: \"Gyu,\" \"Giu,\" \"Iu,\" \"Iuu,\" \"Iuw,\" \"Ieuu,\" \"Ieuy,\" \"Iwe,\" \"Iow,\" \"Iewe,\" \"Ieue,\" \"Iue,\" \"Ive,\" \"Iew,\" and then finally the 18th century, \"Jew.\" The many earlier English equivalents for \"Jews\" through the 14 centuries are \"Giwis,\" \"Giws,\" \"Gyues,\" \"Gywes,\" \"Giwes,\" \"Geus,\" \"Iuys,\" \"Iows,\" \"Iouis,\" \"Iews,\" and then also finally in the 18th century, \"Jews.\"\r\n\r\nWith the rapidly expanding use in England in the 18th century for the first time in history of the greatly improved printing presses, unlimited quantities of the New Testament were printed. These revised 18th century editions of the earlier 14th century first translations into the English language were then widely distributed throughout England and the English speaking world among families who had never possessed a copy of the New Testament in any language. In these 18th century editions with revisions the word \"Jew\" appeared for the first time in any English translations. The word \"Jew\" as it was used in the 18th century editions has since continued in use in all the editions of the New Testament in the English language. The use of the word \"Jew\" was thus stabilized. . .\r\n\r\nThe best known 18th century editions of the New Testament in English are the Rheims (Douai) Edition and the King James Authorized Edition. The Rheims (Douai) translation of the New Testament into English was first printed in 1582 but the word \"Jew\" did not appear in it.\r\n\r\nThe King James Authorized translation of the New Testament into English was begun in 1604 and first published in 1611. The word \"Jew\" did not appear in it either. The word \"Jew\" appeared in both these well known editions in their 18th century revised versions for the first times.\r\n\r\nCountless copies of the revised 18th century editions of the Rheims (Douai) and the King James translations of the New Testament into English were distributed to the clergy and the laity throughout the English speaking world. They did not know the history of the origin of the English word \"Jew\" nor did they care. They accepted the English word \"Jew\" as the only and as the accepted form of the Latin \"Iudaeus\" and the Greek \"Ioudaios.\" How could they be expected to have known otherwise? The answer is they could not and they did not. It was a new English word to them.\r\n\r\nWhen one studies Latin he is taught that the letter \"I\" in Latin when used as the first letter in a word is pronounced like the letter \"Y\" in English when it is the first letter in the words like \"yes,\" \"youth\" and \"yacht.\" The \"I\" in \"Iudaeus\" is pronounced like the \"Y\" in \"yes,\" \"youth,\" and \"yacht\" in English. In all the 4th century to 18th century forms for the 18th century \"Jew\" the letter \"I\" was pronounced like the English \"Y\" in \"yes,\" \"youth,\" and \"yacht.\" The same is true of the \"Gi\" or the \"Gy\" where it was used in the place of the letter \"I.\"\r\n\r\nThe present pronunciation of the word \"Jew\" in modern English is a development of recent times. In the English language today the \"J\" in Jew\" is pronounced like the \"J\" in the English \"justice,\" \"jolly,\" and \"jump.\" This is the case only since the 18th century. Prior to the 18th century the \"J\" in \"Jew\" was pronounced exactly like the \"Y\" in the English \"yes,\" \"youth,\" and \"yacht.\" Until the 18th century and perhaps even later than the 18th century the word \"Jew\" in English was pronounced like the English \"you\" or \"hew,\" and the word \"Jews\" like \"youse\" or \"hews.\" The present pronunciation of \"Jew\" in English is a new pronunciation acquired after the 18th century.\r\n\r\nThe German language still retains the Latin original pronunciation. The German \"Jude\" is the German equivalent of the English \"Jew.\" The \"J\" in the German \"Jude\" is pronounced exactly like the English \"Y\" in \"yes,\" \"youth,\" and \"yacht.\" The German \"J\" is the equivalent of the Latin \"I\" and both are pronounced exactly like the English \"Y\" in \"yes,\" \"youth,\" and \"yacht.\" The German \"Jude\" is virtually the first syllable of the Latin \"Iudaeus\" and is pronounced exactly like it. The German \"Jude\" is the German contraction and corruption of the Latin \"Iudaeus\" just as the English \"Jew\" is the contraction and corruption of the Latin \"Iudaeus.\" The German \"J\" is always pronounced like the English \"Y\" in \"yes,\" \"youth,\" and \"yacht\" when it is the first letter of a word. The pronunciation of the \"J\" in German \"Jude\" is not an exception to the pronunciation of the \"J\" in German. . .\r\n\r\nThe translation into English of the Gospel by John, XIX.19, from the Greek in which it was originally written reads \"Do not inscribe 'the monarch of the Judeans' but that He Himself said 'I am monarch.'\" In the original Greek manuscript the Greek \"basileus\" appears for \"monarch\" in the English and the Greek \"Ioudaios\" appears for \"Judeans\" in the English. \"Ioudaia\" in Greek is \"Judea\" in English. \"Ioudaios\" in Greek is \"Judeans\" in English. There is no reason for any confusion. \r\n\r\nIf the generally accepted understanding today of the English \"Jew\" and \"Judean\" conveyed the identical implications, inferences and innuendoes as both rightly should, it would make no difference which of these two words was used when referring to Jesus in the New Testament or elsewhere. But the implications, inferences, and innuendoes today conveyed by these two words are as different as black is from white. The word \"Jew\" today is never regarded as a synonym for \"Judean\" nor is \"Judean\" regarded as a synonym for \"Jew.\" \r\n\r\nWhen the word \"Jew\" was first introduced into the English language in the 18th century its one and only implication, inference and innuendo was \"Judean.\" However during the 18th, 19th and 20th centuries a well-organized and well-financed international \"pressure group\" created a so-called \"secondary meaning\" for the word \"Jew\" among the English speaking peoples of the world. This so-called \"secondary meaning\" for the word \"Jew\" bears no relation whatsoever to the 18th century original connotation of the word \"Jew.\" It is a misrepresentation. . .\r\n\r\nThere is not a person in the whole English-speaking world today who regards a \"Jew\" as a \"Judean\" in the literal sense of the Word. That was the correct and only meaning of the word in the 18th century . . . (Facts Are Facts, by Benjamin H. Freedman, p. 15-21).\r\n\r\nThe meaning of the word \"Jew\" in our Bible is not the same as the colloquial idiom.\r\n\r\nIn the Bible the word \"Jew\" means a resident of the land of Judaea regardless of their tribe, race or religion just as an Australian or Englishman may in fact be a Chinese, Negro or an Eskimo, or perhaps a member of the tribe of Judah (Judahite). According to the Greek Lexicon in Strong's Exhaustive Concordance:\r\n\r\nJew: Greek word #2453 Ioudaios (ee-oo-dah'-yos); from #2448 (in the sense of #2455 as a country); Judaean, i.e. belonging to Jehudah [\"Judah\" in Hebrew language of Old Testament]: KJV Jew (-ess), of Judaea.\r\n\r\nGreek word #2448 Iouda (ee-oo-dah'); of Hebrew origin [Hebrew word #3063 or perhaps #3194]; Judah (i.e. Jehudah or Juttah), a part of (or place in) Palestine: KJV Judah.\r\n\r\nGreek word #2455 Ioudas (ee-oo-das'); of Hebrew origin [Hebrew #3063]; Judas (i.e. Jehudah), the name of ten Israelites; also of the posterity of one of them and its region: KJV Juda (-h, -s); Jude.\r\n\r\nGenesis 49:10 prophesied, \"The sceptre shall not depart from Judah, nor a lawgiver from between his feet, until Shiloh come; and unto Him shall the gathering of the people be.\"\r\n\r\nJudah was the largest and the most influential of the twelve tribes with the governing right. Jacob prophesied it would maintain its pre-eminence until Shiloh, or Messiah, came. He would then take headship and receive the allegiance of true spiritual Israel as Isaiah 9:6-7 foretold. Matthew 1 and Luke 3 trace Jesus' human lineage to David, Judah, Jacob and Abraham. Jesus took the sceptre from Judah and we who receive Him as Messiah give Him our allegiance. \r\n\r\nIn the days of His flesh few of the citizens of Judea were Judahites. Some belonged to one of the other tribes of Israel, and many were descendants of Esau (Edomites) who had assimilated and become co-religionists with the Judahites and remnants of the other tribes in the hybrid religion of Pharisaism developed during the captivity in Babylon. This is the religion of the Talmud is called Judaism today; it was condemned by Jesus since it is the antithesis of the Mosaic Law and the prophets and makes the Word of God of no effect (Matthew 15:1-9). \r\n\r\nJohn 7:1, \"After these things Jesus walked in Galilee: for He would not walk in Jewry, because the Jews sought to kill Him.\" \r\n\r\nAccording to Strong's Greek Lexicon, the English word \"Jewry\" in this verse was translated from the Greek word #2449 Ioudaia {ee-oo-dah'-yah} feminine for the land of Judea. Modern translations no longer use the word \"Jewry\" but the correct translation, \"Judea,\" as in the New American Standard Bible: \"And after these things Jesus was walking in Galilee; for He was unwilling to walk in Judea, because the Jews were seeking to kill Him.\" The New International Version uses the same word. However, these translations continue to improperly use the word \"Jews\" in the same verse. A consistent translation would read: \". . . He was unwilling to walk in Judea, because the Judeans were seeking to kill Him.\" \r\n\r\nToday most people think of Jews as the people of Israel, but that is not correct. An Israelite was one who had descended from Jacob. In Jesus' time individual Jews may or may not have descended from Jacob, but they all recognized Pharisaism and not the Law of Moses. A Jew is properly a Judean.\r\n\r\nThe point is that one who is called a \"Jew\" in the Bible is not necessarily a chosen man of God, a follower of Moses and the prophets, a member of the tribe of Judah, an Israelite, or even a Semite, but one who is a resident of Judea. A Judean. But a well-organized and well-financed international \"pressure group\" created a so-called \"secondary meaning\" for the new word \"Jew\" which is not the understanding intended by the Scripture of truth. Those who call themselves Jews today falsely imply they are somehow descendants of the tribes of Israel and chosen of God. Yet few of them are Jews as they are not \"Judeans,\" or residents of Judea. \r\n\r\nSo if modern day so-called Jews are not the Jews of the Bible, who are they? When asked, \"Who is Israel? - Who is a Jew?\" the Israeli Government's Ministry of Foreign Affairs (MFA) unhesitatingly answered: \r\n\r\n\"The term Israelite is purely Biblical. An Israeli is a citizen of Israel, regardless of religion. A Jew is a person anywhere in the world born to a Jewish mother, or converted to Judaism, who is thus identified as a member of the Jewish people and religion\" (Information Division, Ministry of Foreign Affairs, Jerusalem; February, 1998).\r\n\r\nThe Jewish Almanac concurs: \"Strictly speaking, it is incorrect to call an ancient Israelite a \"Jew.\" Or to call a contemporary Jew [an] \"Israelite,\" or a \"Hebrew.\" The first Hebrews were not have been Jews at all, and contemporary Palestinians, by their own definition of the term \"Palestinian,\" have to include Jews among their own people\" (The Jewish Almanac, October, 1980, page 3, Bantam Books, Inc).\r\n\r\nThe Online Etymology Dictionary describes the etymology of the word 'jew,' but perhaps because its editor is not a Bible student it exhibits an ignorance of the meaning of the original Greek word Ioudaios derived from the Aramaic jehudhai which did not refer to members of the tribe of Judah but to Judeans, the residents of the Babylonian province of Judea. The spelling of our present-day English word Jew is a transliteration of an abbreviation or slang word coined by their Babylonian conquerors for Judeans without reference to the race or religion of the captives. The editor has inadvertently discriminated the Semitic tribesmen of the sons of Israel from the diverse mass of races and religions then resident in Judea by applying the incorrect colloquial idiom, not having recognized the true and Biblical meaning of the original words.\r\n\r\n\r\nThe Introduction of the Word \"Jew\" into God's Holy Bible \r\n\r\nIn 1604, James VI, King of Scotland from his youth, became King James I of England, the first ruler of Britain and Ireland. Because of the growing animosity of James toward the Puritans, a leading Puritan spokesman, Dr. John Reynolds, proposed that a new English Bible be issued in honour of the new King. King James saw an opportunity to bring about a unity with the church service in Presbyterian Scotland and Episcopal England. Completed and published in 1611, the new Bible became known as the \"Authorized Version\" because its making was authorized by King James. It became the \"Official Bible of England\" and the only Bible of the English church. There have been many revisions of the King James Bible, 1615, 1629, 1638, 1762 and 1769. \r\n\r\nThe most important changes occurred in the eighteenth century. In 1762 Dr. Thomas Paris published an extensive revision at Cambridge. In 1769 Dr. Benjamin Blayney, after about four years of work, brought out another at Oxford. The latter work included much modernization of spelling, punctuation, and expression. These changes were due to printing errors and spelling changes in many words. This update represents the exact words in the 1611 Bible first edition, only the spelling is changed. This 1769 update is the basis of the King James Bible of our time and use; the Apocrypha was officially removed in 1885.\r\n\r\nAny so-called \"1611\" King James Version you buy today at the local Christian Bookstore is absolutely NOT the 1611. . . it is the 1769 revision, even though it admits that nowhere, and may even deceivingly say \"1611\" in the frontpiece to promote sales . . . it is just not true. The spellings have been revised and some words changed in almost every printing done since 1769, and fourteen entire books plus extra prefatory features have been removed from almost every printing done since 1885! \r\n\r\nIf you really love the King James Version the way to own a true, unaltered, unedited, unabridged, original 1611 version as authorized by King James, is to spend US$125,000 to US$400,000 and purchase a genuine original, US$250 for an exact photographic facsimile edition, or US$1,995 for The Deluxe Full-Size Limited Edition 1611 King James Bible Facsimile. \r\n\r\nThe early editions of the Authorized Version contained the Apocrypha, not because the translators believed - they listed seven reasons why the apocryphal books were to be categorically rejected as part of the Inspired canon - but because the king asked that it be included. So, instead of scattering the Apocryphal books all through the Old Testament as in the Rheims-Douai and other Roman Catholic Bibles, they placed all of the Apocryphal books by themselves between the Testaments.\r\n\r\nThere is not now nor was there ever an equivalent letter \"j\" in the 22 letters of the Hebrew alphabet. Nor is there any Hebrew letter that carries even an approximate sound of the consonant letter \"j.\" Neither is there a letter 'j' in the Greek alphabet. As regards proof of the letter 'J' not being in Aramaic, Hebrew, and Greek alphabets, James Strong's Exhaustive Concordance has the Hebrew and Greek alphabet preceding each respective dictionary therein. Also, there are various grammars, etc., which show the alphabet of these languages, and there is no letter equivalent to \"J\" in either Hebrew or Greek even today. \"J,\" the tenth letter and seventh consonant in the English alphabet, is the latest addition to English script and has been inserted in the alphabet after \"I,\" from which it was developed. Petrus Ramus (1515-1572) is credited as the first to distinguish I and J as representing separate sounds. Not until the middle of the 17th century did the use of \"j\" as an initial become universal in English books.\r\n\r\nJerome translated the Bible into Latin in the fourth century. John 19:19 refers to the inscription Pilate posted over Jesus' cross. In our modern English Bibles we read, \"Jesus of Nazareth, the King of the Jews,\" translated from the Greek \"Ieous Nazoraios Basilius Ioudaios\" but the Latin Vulgate reads, \"Iesus Nazerenus Rex Iudaeorum.\" This is usually abbreviated INRI as on all statues and imagery because there was no J. \r\n\r\nContrary to what most people believe Shakespeare never saw the word \"Jew\" nor did he ever use the word \"Jew\" in any of his works, the common general belief to the contrary notwithstanding. In his \"Merchant of Venice,\" V, III, I, 61, first published in about 1600, Shakespeare wrote as follows \"what is the reason? I am a Iewe; hath not a Iewe eyes?\" \r\n\r\nIn Samuel Johnson's English Dictionary of 1755 and 1756 words beginning with \"I\" and the new letter \"J\" are interspersed. There is no listing for the word \"Jew\" in either his 1755 or 1756 editions although \"To Judaize\" is defined as \"To conform to the manner of the Jews\" in both. \r\n\r\nThe corrected re-issue of the 1933 edition of The Oxford English Dictionary lists the first published usage of the word \"Jew\" in:\r\n\r\nSheridan's 1775 play, \"The Rivals,\" Act II, Scene I, \"She shall have a skin like a mummy, and the beard of a Jew.\" \r\n\r\n1653 Greaves' \"Seraglio,\" 150. \"In the King's Seraglio, the sultanas are permitted to employ divers Jewes-women about their ordinary occasions\". And,\r\n\r\n1700 Bishop Patrick's Commentary on Deuteronomy 28:37, \"Better we cannot express the most cut-throat dealing, than thus, you use me like a Jew\".\r\n\r\nThe earliest version of the New Testament in English from the Latin Vulgate Edition is the Wiclif, or Wickliff Edition published in 1380. In the Wiclif Edition Jesus is there mentioned as One of the \"iewes.\" That was the 14th century English version of the Latin \"Iudaeus\" and was pronounced \"hew-weeze,\" in the plural, and \"iewe\" pronounced \"hew-wee\" in the singular. \r\n\r\nThe 1841 English Hexapla contains six English translations of the New Testament arranged side by side for easy comparison and reference. The six English translations are: The Wycliffe version of 1380 (the first English Scripture, hand-copied prior to Gutenberg's invention of the printing press in 1455), The Tyndale version of 1534-1536 (the first English printed Scripture), and Cranmer's Great Bible of 1539 (the first Authorized English Bible). Continuing across each right-hand page is: The Geneva \"1557\" translation actually completed in 1560, (the English Bible of the Protestant Reformation), The Rheims 1582 (the first Roman Catholic English version), and the 1611 King James First Edition. \r\n\r\nIn the 1380 Wiclif Edition in English the Gospel by John XIX.19, reads \"ihesus of Nazareth kyng of the iewes.\" Prior to the 14th century the English language adopted the Anglo-Saxon \"kyng\" together with many other Anglo-Saxon words in place of the Latin \"rex\" and the Greek \"basileus.\" The Anglo-Saxon also meant \"tribal leader.\" \r\n\r\nIn the Tyndale Edition of the New Testament in English published in 1525 Jesus was likewise described as One of the \"Iewes.\"\r\n\r\nIn the Coverdale Edition published in 1535 Jesus was also described as One of the \"Iewes.\" Also in the Coverdale Edition the Gospel by John, XIX.19, reads \"Iesus of Nazareth, kynge of the Iewes.\"\r\n\r\nIn the Cranmer Edition published in 1539 Jesus was again described as One of the \"Iewes.\" \r\n\r\nIn the Geneva Edition published in 1540-1557 Jesus was also described as One of the \"Iewes.\"\r\n\r\nIn the Rheims Edition published in 1582 Jesus was described as One of the \"Ievves.\" \r\n\r\nIn the King James Edition published in 1611, also known as the Authorized Version, Jesus was described again as one of the \"Iewes.\" The forms of the Latin \"Iudaeus\" were used which were current at the time these translations were made.\r\n\r\nThe word \"Jew\" does not appear in any of these Bibles. Jesus is referred to as a so-called \"Jew\" (which He was not) for the first time in the New Testament in the 18th century editions in the English language of the 14th century first translations of the New Testament into English. The first Bibles in which the word \"Jew\" first appears are:\r\n\r\n1729 Daniel Mace New Testament is the first Scripture to contain the word \"Jew\", here in Romans 2:13 - 3:21.\r\n\r\n1750 Douai newly revised and corrected by Richard Challoner according to the Clementin edition of the Scriptures, The Holy Bible translated from the Latin Vulgate, first published by the English College at Doway, Anno 1609.\r\n\r\n1752 Douai newly revised and corrected by Richard Challoner according to the Clementin edition of The New Testament of our Lord and Saviour Jesus Christ. Translated out of the Latin Vulgate, first published by the English College of Rhemes, Anno 1582\r\n\r\n1755 Wesley, New Testament with Explanatory Notes by John Wesley \r\n\r\n1769 Benjamin Blayney modernised the spelling, punctuation, and expression of the 1611 edition of the Authorised or King James Bible. \r\n\r\n1770 Worsley New Testament or New Covenant of Our Lord and Saviour Jesus Christ translated from the Greek with notes by John Worsley. \r\n\r\nThe fascinating story of how we got the Bible in its present form actually starts thousands of years ago, as briefly outlined in this Timeline of Bible Translation History. As a background study, we recommend that you first review the discussion of the Pre-Reformation History of the Bible from 1400BC to AD1400, which covers the transmission of the Scripture through the original languages of Hebrew and Greek, and the 1,000 years of the Dark & Middle Ages when the Word was imprisoned in Latin. The starting point in this discussion of Bible history, however, is the advent of the Scripture in the English language with the \"Morning Star of the Reformation,\" John Wycliffe.\r\n\r\n\r\nWhat is a Jew?\r\n\r\nSpeaking to His elect Church Jesus said, \"I know your affliction and your poverty, but you have heavenly riches, and I know the blasphemy of them who say they are Jews, and are not, but are the synagogue of Satan . . . Take note, I will make them of the synagogue of Satan, who say they are Jews, but are impostors who lie, to come and worship before your feet, and to know that I have loved you\" (Revelation 2:9; 3:9).\r\n\r\nSpeaking to the so-called Jews who were of the sect of the Pharisees (or Judaism) Jesus said, \"You serpents, offspring of vipers, how can you escape being sentenced to hell fire? Therefore take notice, I will send you prophets, and wise men, and scribes, some of whom you will kill and crucify; and some of whom you will flog in your synagogues, and persecute from town to town, that upon you may come all the righteous blood that has been shed on the earth, from the blood of righteous Abel to the blood of Zachariah the son of Barachiah, whom you murdered between the temple and the altar. I assure you, all these things shall come upon this race\" (Matthew 23:33-36). \r\n\r\nJesus identified these so-called Jews as the descendants of Cain.\r\n\r\nSpeaking to Cain God said, \"What have you done? the voice of your brother's blood cries to Me from the ground. And now you are cursed from the earth, which has opened her mouth to receive your brother's blood from your hand\" (Genesis 4:10-11).\r\n\r\nSpeaking to Christ's end-time Bride regarding the Words of Jesus, the prophet William Branham said, \"Here is a verse that will bear considerable thought, not only because it is most peculiar in its contents, but also it is virtually repeated in an age that is over a thousand years later. . . To begin with, the word, Jews, does not describe the religion of the Jewish people. It refers only to the people of Judah and has the same precise meaning if I were to say I am Irish born. These people were saying that they were actually Jews, real Jews by birth. They were liars. They were not Jews by birth and they weren't Jews by religion.\"\r\n\r\n(The word Jew was coined by Nebuchadnezzar's troops as an abbreviation of the word \"Judean.\" A Jew or Judean is one who is a resident of Judea regardless of his religion, race, or nationality. Every resident of Palestine is a \"Jew\" whereas the so-called Jews living abroad are not Jews at all, neither by residence, nor by birth, nor by religion. This is confirmed by the Bible in the Old and New Testaments, Jewish historians such as Josephus, Professor of Medieval Jewish History at Tel Aviv University, A. N. Poliak in his book Khazaria (1944, 1951); American historian Professor Dunlop of Columbia University in his article on the Khazars in the Encyclopaedia Judaica (1971); Noam Chomsky in his book, Fateful Triangle, Arthur Koestler in his masterpiece, The Thirteenth Tribe ; Professor Heinrich H. Graetz in his History of the Jews, p. 141 (1891-98); Soviet archaeologist M. I. Artamonov in Istoria Khazar, Benjamin Freedman in Facts are Facts, Chief Rabbi of the United States, the late Steven S. Wise, the Message of William Branham the Prophet of Malachi 4:5-6 and Revelation 10:7, every Jewish and all Gentile encyclopaedias affirm that barely any so-called Jew is an Israelite let alone Semitic. Note also that Judaism is Pharisaism based on the Talmud, which is the antithesis of pre-exilic Yahweh Torah or Yahwism, the Law and the Prophets, and accursed of God in Matthew 15:1-9, and Moses in Deuteronomy 5:22; 12:32). \r\n\r\n\"If all this is true, what were they? They were a deceived people who were already part of the church. They belonged to the false vine.\"\r\n\r\n(Brother Branham is explaining how the Roman Catholic church, which organized at the Hegelian dialectic of the First Nicea Council in AD325, had its beginnings as the First Church of Rome founded in AD36 by the apostles Junias and Andronicus (Romans 16:7). This church apostatised when the elders, who had emigrated from Judea to escape the persecution of the Jews (Acts 8:1), were subsequently expelled from Rome by Emperor Claudius along with all Judeans (Acts 18:2). It was thirteen years before the Judeans could return, and when the Christian elders returned they found the First Church of Rome would not repent). \r\n\r\n\"They were not of the true church, but of the false church because God said \"they were the synagogue of Satan.\" Now the word for synagogue is not the same word we use for church. In the Bible, church means, \"the called out ones,\" or the \"summoned ones.\" The Psalmist said of these elect people, \"Blessed is the man whom THOU CHOOSEST, and CAUSEST to approach unto Thee, that he may dwell in Thy courts\" (Psalms 65:4). But the meaning of synagogue is \"assembly or gathering.\" This can be good or bad, but in this case it is bad, for these are they whose assembling is not of God but of their own selves. Isaiah said of them, \"Behold, they shall surely gather together, but NOT BY ME: whosoever shall gather together against Thee shall fall for Thy sake\" (Isaiah 54:15). And since these were surely against the true vine, God will one day deal with them in destruction.\"\r\n\r\n\"Now why do we have a people mixed in the framework of the church and calling themselves Jews? The reason is this: Since they were liars they could make any claim they wished. They could say what they wanted as though it were a fact and then stick to it. And in this case they could be lying with a very powerful thought in mind. Was it not so that the early church was almost if not entirely composed of Jews, making them the original members of His body? The twelve apostles were Jews, and the later apostles were either Jews or proselytes. Thus for men to swear they were Jews would give them a pre-eminence and a claim to originality. Tell a lie. Stick to it. Never mind fact or history. Just say it and keep saying it to the people, and soon the people will receive it.\"\r\n\r\n\"Now did you catch something there? Isn't that the same spirit right in the church today? Isn't there a group that claims that they are the original and true church and that salvation is found only in her? Don't they claim that they have the keys of the kingdom which they received from Peter? Don't they claim that Peter was their first pope, and that he resided in Rome when there is ABSOLUTELY NO HISTORICAL FACT FOR IT? And even her most educated and knowing adherents believe her lies. Satan's synagogue! And if Satan be her father, and he the father of lies, then it is not strange that those in his synagogue are liars also.\"\r\n\r\n\"Consider the thought of blasphemy. These of Satan's synagogue were not blaspheming God in this instance (though that goes without saying) but they were blaspheming the true Church. Certainly. As Cain persecuted and killed Abel because he (Cain) was of that wicked one, and as the dead formal Judaic followers (Jesus said they were of their father, the devil) tried to destroy the Christians in the first few years of the first age, now this same group (the false vine) is even more strongly attempting to destroy the true believer in the second age. That antichrist spirit is growing.\"\r\n\r\n\"The group that inched its way ever so slowly into the church by its DEEDS (Nicolaitanism) no longer fears exposure but is openly organized in a group of its own assembling and is coming against the true Church in undisguised hostility.\"\r\n\r\n\"Now when I say this was an organized antichrist church I am giving you the truth from authenticated history. The first church founded in Rome (we will trace its history in the Pergamean Age) had already turned the truth of God into a lie by introducing a pagan religion with Christian names and meaning. By the second age it was so pagan (though claiming to be the true church) that Polycarp came about 1,500 miles at a very old age to plead with them to turn back. They would not do it. They had a solid hierarchy and a solid organization, and a complete departure from the Word. This then, is Satan's synagogue, full of blasphemy, in which were already the seeds of the doctrine of Nicolaitanism, and which would shortly be the actual seat or power of Satanic religion. And this is exactly right for Revelation 2:9b does NOT say these people are OF Satan's synagogue but it says they ARE SATAN'S SYNAGOGUE\" (An Exposition of the Seven Church Ages, p. 119:4 - 121:3).\r\n\r\nRevelation 3:9, \"Behold, I will make them of the synagogue of Satan, who say they are Jews, and are not, but do lie; behold, I will make them to come and worship before your feet, and to know that I have loved you.\"\r\n\r\nBrother Branham continues: \"The natural types the Spiritual. This verse deals with the Jews who have always called themselves the children of God to the exclusion of everyone else. They sought their righteousness after the Law and failed miserably, for by the Law can no flesh be justified. By the Law can no man be made holy. Holiness is of the Lord. I Corinthians 1:30, \"But of HIM are you in Christ Jesus, Who of God is made unto us wisdom, and righteousness, and sanctification, and redemption.\" II Corinthians 5:21b, \"That we might be made the righteousness of God in Him.\" It was Christ or perish, and they perished for they refused Him.\"\r\n\r\n\"In the Sardis Church Age Martin Luther restored the revelation that justification is by faith and not works, but the Lutherans organized and joined with the state and again we see the synagogue of Satan manifested in denominationalism. As the Jews took refuge in the synagogue form of worship, so in the Philadelphian Age men were taking refuge in the church. It is not joining a church that counts. The life is not in the church. The life is in Christ. \"This is the record that God has given us eternal Life and this Life is in His Son. He that has the Son has Life, and he who has not the Son has not Life.\" Man is made holy by the Spirit. It is the Spirit of Holiness that raised Jesus from the dead that in-dwells us and makes us holy with His holiness.\"\r\n\r\nBrother Branham went on to explain, \"This problem of the false Jew or false believers was already in existence in the second age. These who falsely called themselves Jews appeared right after the first outpouring of the first age, and now they appear again in the second age after the reformation. This is hardly an accident. Indeed, it is not an accident. It is a principle of Satan. That principle is to organize and claim originality and therefore be entitled to special rights and privileges. Let me show you. Back there in the Smyrnaean Age these people lied and said they were actually Jews (or believers) when they definitely were not. They were of the synagogue of Satan. They were Satan's organized crowd, for it was in that age we saw the start of men in the ministry taking an unwarranted leadership over their ministering brethren. (Bishops set up in districts, over elders). The next thing we saw was that in the third age there was definitely a place called \"Satan's seat.\" That age gave us church and state marriage. With the power of the state behind her the church was literally physically invincible.\"\r\n\r\n\"But God broke that hold in spite of the power of the state and the reformation brought great light. But what happened? The Lutherans organized and joined with the state and again we see the synagogue of Satan manifested in this sixth age. Now of course this synagogue group wouldn't say they are of Satan. No sir. They say they are of God. But they lie. For he that is a true Jew (that is what they claimed to be) is one who is a Jew inwardly - in the Spirit. (He who is born of the Spirit that was in Jesus Christ, the King of Judah, is a Judahite - not a Jew or Judean, for the Life is in the blood and we are the blood of Christ by the baptism with the Holy Spirit - Ed). So then if they are false Jews it means that they are as Jude 19 says, \"having NOT the Spirit.\" Children of God are born of the Spirit. These have not the Spirit and therefore they are NOT children of God no matter how fervently they protest and to what lengths they go to try to prove that they are. They are DEAD. They are children of organization, and the true fruits are missing. They are built upon their own creeds, dogmas and doctrines and the truth is not in them for they have taken their own counsels above the Word of God.\"\r\n\r\n\"Let me show you what I have been trying to teach all along about the two vines which come from two different spirits. Take the example of Jesus and Judas this time. Jesus was the Son of God. Judas was the son of perdition. God entered into Jesus. Satan entered into Judas. Jesus had a full Holy Ghost ministry for \"How God anointed Jesus of Nazareth with the Holy Ghost and with power: Who went about doing good, and healing all that were oppressed of the devil; for God was with Him\" (Acts 10:38). It says \"For he (Judas) was numbered with us, and had obtained PART of this ministry\" (Acts 1:17). Matthew 10:1, \"And when He had called unto Him His twelve disciples, He gave them power against unclean spirits, to cast them out, and to heal all manner of sickness and all manner of disease.\"\r\n\r\n\"That spirit that was in Judas went right along through the ministry of Jesus. Then they both came to the cross. Jesus was hanged upon the cross, gladly giving His Life for sinners and commended His Spirit to God. His Spirit went to God and then was poured out into the church at Pentecost. Judas hanged himself and his spirit went back to Satan, but after Pentecost that same spirit that was in Judas came back to the false vine that grows right along with the true vine. But notice, Judas' spirit never got to Pentecost. It never went up to receive the Holy Spirit. It could not. But what did that Judas spirit go for? It went for the bag of gold. How it loved money. It still loves money. If it goes about in the Name of Jesus doing mighty things and holding great meetings, it still makes more of money and buildings, and education and everything with a material concept. Just watch that spirit that is upon them and don't be fooled. Judas went about as one of the twelve and he did miracles, too. But he did NOT have the Spirit of God as his own. He did have a ministry. He never got to Pentecost as he was not true seed. He was not a true child of God. No sir. And it is that way right now in the synagogue of Satan. Don't be fooled. You won't be fooled if you are of the very elect. Jesus said you wouldn't be fooled.\"\r\n\r\n\"Yes, these folks say they are Christians but they aren't.\"\r\n\r\n\"I will make them come and worship before thy feet, and to know that I have loved thee.\" I Corinthians 6:2, \"Do ye not know that the saints shall judge the world?\" Not only will there be twelve apostles on twelve thrones judging the twelve tribes of Israel but the saints, also, will judge the world. That is when these who claim to belong to God and claim that God loves them will find out exactly who is the child of God and who is loved of the Son. Yes, that day is coming when it will be made manifest. These who are now ruling the world in a measure, and who during the last age will build an image to the beast whereby they will actually rule the world, will one day be humbled when Jesus comes with His saints to judge the world in righteousness. That is exactly what we saw in Matthew 25 when \"All\" the ones who missed the first resurrection will stand before the Judge and His Bride\" (ibid 310:2 - 313:2).\r\n\r\n\r\nSo-called Jews\r\n\r\nGenesis 27:39-41, \"Isaac, Esau's father said to him, Your dwelling shall be the fatness of the earth, and of the dew of heaven from above; you will sustain yourself by your sword, and you shall serve your brother; but you will finally take the dominion and break his yoke from your neck. And Esau hated Jacob because of the blessing which his father bestowed on him: and Esau said to himself, The days of mourning for my father are at hand; then will I slay my brother Jacob.\" \r\n\r\nEsau/Edom, the so-called Jew, has been killing Jacob/Israel from that day to this. His had took dominion over the Israelites after John Hyrcanus defeated and forcibly assimilated Edom into the kingdom of Judah 100 years before the birth of Christ. Hence Jesus would not live in Judea \"for fear of the [Edomite] Jews\" who will rule Israel unto the consummation of life on earth (Daniel 9:27; Luke 21:24; Revelation 11:1-2, 8).\r\n\r\nThe Bible is not a Jewish Book. Let us consider the claim that our Christian Bible and our religion came from the Jews, meaning Jews by religion. It is certain the New Testament did not from them, for the Jewish religion is condemned throughout the New Testament. But did we get the Old Testament from them? No! In the first place, no Jew by religion existed before the return from the Babylonian captivity, shortly after 536BC. Their great historian Josephus writes, \"So the Jews prepared the work. Jew is the name they are called by from the day that they came up from Babylon.\" The only books of the Old Testament that were written after the return from Babylon are Kings, Chronicles, Ezra and Nehemiah (all of them historical, rather than doctrinal), Haggai, Zechariah and Malachi. In none of these do the Jews receive anything but rebuke for their wickedness, and their apostasy from the religion of the Old Testament. Rabbi Stephen F. Wise, Chief Rabbi of the United States said, \"The return from Babylon and the introduction of the Babylonian Talmud mark the end of Hebrewism and the beginning of Judaism.\"\r\n\r\nThe Old Testament text in our Bibles appears not merely to have been corrupted, but to have been purposely corrupted, as an attack upon the Christian Faith! Perhaps one of the most significant problems with the KJV lies in the manuscripts from which it was translated. The Old Testament (mentioned here for the sake of completeness) was translated from the Masoretic Text, a thoroughly corrupted and Talmudic Jewish- produced and inspired text of the Hebrew Testament. The fact that the Masoretic Text was used for the Old Testament of the KJV also has a clear impact upon the New Testament, for the translators of both Testaments had direct and indirect contact with leading Hebraists of the day for purposes of textual and etymological consultation, and it must be understood that all of these leading Hebraists were Talmudic Jews. The counterfeit Masoretic text was created between AD500 and AD1030 and first published in 1427.\r\n\r\nJesus Christ was not a Jew. Had Jesus been a Judean it is very likely He would have been an Edomite, not a kinsman to Adam, and thereby disqualified from being the Holy One of Israel, the last Adam, who was born to redeem the first (Leviticus 25; Ruth). Were Jesus a so-called Jew He would not have been Messiah whom the Lord prophesied would dwell in Galilee of the Gentiles (Isaiah 9:1-7). Jesus did not live in Judea and dared not walk in Jewry (i.e. Judea), \"for fear of the Jews\" who sought to kill Him. \r\n\r\n\"Five things did Canaan charge his sons: love one another, love robbery, love lewdness, hate your masters, and do not speak the truth\" (Talmud, Peshachim 113b). As we read in Genesis, the Jews have sworn to slay the Israelites, and are \"the people against whom God has indignation forever\" (Genesis 9:25; 27:39-41; Isaiah 34:1-9; Malachi 1:1-4). \r\n\r\nThe prophet Paul knew exactly who he was, and that the word \"Jew\" indicated his place of residence, and not that he was of Judah or any of the other Tribes of Israel. Acts 22:3, \"I am verily a man who is a Jew, born in Tarsus, a city in Cilicia, yet brought up in Jerusalem at the feet of Gamaliel, and taught according to the perfect manner of the Law of the fathers, and was zealous toward God, as you all are this day.\" Philippians 3:4-5, \"If any other man thinks that he has whereof he might trust in the flesh, I more: circumcised the eighth day, of the stock of Israel, of the tribe of Benjamin, an Hebrew of the Hebrews; as touching the law, a Pharisee\".\r\n\r\nAlmost no Jew is a Hebrew and Israelite by descent, or even a Semite. According to the Bible from Genesis to Revelation, Jewish rabbis and historians, every Jewish and all Gentile encyclopaedias, the mass of so-called or self-styled Jews may be traced to their vicarious father, Lucifer, through the original sin in the garden of Eden, which was adultery between Eve and the Devil-incarnate Serpent, a handsome upright man-like beast before God changed every bone in his body and placed him on his belly (Genesis 3; Matthew 23:33-36; John 8:23-47). \r\n\r\nThe so-called Jews also teach this doctrine of the original sin, found in the Bible from Genesis to Revelation, but they teach we Goyim or non-Jews are \"human cattle,\" animals God created in human form in order to serve the Jews, but this is contrary to God's unchanging Word (Midrasch Talpioth; Yebamoth 98a; Schene Luchoth Haberith, p. 250b). The original sin and the fall of man is explained in the following teachings:\r\n\r\nThe Original Sin 1/3; The Original Sin 2/3; The Original Sin 3/3, and But the Woman being deceived, was in the Transgression.\r\n\r\nThis explains why Jesus agreed with the Pharisees that they were Abraham's seed, but qualified his statement: \"You are of your father the Devil, and the lusts of your father you will do. He was a murderer from the beginning, and abode not in the truth, because there is no truth in him. When he speaks a lie, he speaks of his natural proclivity: for he is a liar, and the father of it.\" These Edomite Jews were descendants of Abraham and Isaac through Esau but they were not the descendants Jacob and therefore not in the covenants God made with Abraham and with Moses. Esau married three wives. His Hittite and Canaanite wives being Serpent seed and not in Adam's race, their offspring likewise are not in the Book of Life and accursed of God (Genesis 26:34-35). The have no kinsman Redeemer for Jesus Messiah is the last Adam, He was not the last Cain. And although Esau's children by his Ishmaelite wife are in Adam's race, they are not in the covenants God made with Israel. \r\n\r\nEsau is Edom that is assimilated with Jewry. The Bible, all Jewish encyclopaedias and historic records state \"Edom is in modern Jewry\" (Jewish Encyclopedia, 1925 edition, Vol. 5, p. 41). \"Some anthropologists are inclined to associate the racial origins of the Jews, not with the Semites, whose language they adopted, but with the Armenians and Hittites of Mesopotamia, whose broad skulls and curved noses they appear to have inherited\" (The Jewish Encyclopedia, (1905), Vol. X, p 284). \r\n\r\nAt no time was there ever a Jew nation, nor was there ever a \"Jew\" race. Not a single Jew stood before Mount Sinai when God delivered the Law to Israel, and God never made any covenant with the Jews. Jesus agreed with the carnal minded Pharisees that they were Abraham's descendants but when they declared they had never been captives of Egypt, Babylon or Israel's Canaanite neighbours, they betrayed themselves as Edomite Jews captive of sin, and not Israelites (John 8:33-34). It is therefore correct to identify Jews, by and large, as an \"ethnic\" (i.e. heathen non-Israelite, non-Christian) people, as the self-styled peak representative body of Australian Jewry have had written into law, and to trace their origin to the original sin in the garden of Eden, which spawned Cain, whose lineage continues on this side of the Flood in the descendants of Canaan.\r\n\r\nGod commissioned Moses to deliver the people of Israel to the Promised Land saying, \"When the Lord God brings you into the land whither you go to possess, and has cast out the Hittites, Girgashites, Amorites, Canaanites, Perizzites, Hivites, and Jebusites, seven nations greater and mightier than you; you shall smite and utterly destroy them; you shall make no covenant with them, nor show mercy to them\" (Deuteronomy 7:1-3; 12:2; 20:16-17). \r\n\r\nThe Hebrew word translated \"utterly destroy\" is 'cherem.' Both the people and the land of Canaan were 'cherem,' meaning FORCIBLY dedicated to God as withdrawn from His service and worship wherein He was not glorified, and by the hands of another, devoted to Him for destruction whereby He will be glorified. The equivalent Greek word is \"anathema.\" In the case of the Canaanites who were natural Serpent's seed, cherem is the consecration to God of His enemies (Hebrew \"hated ones\" - Isaiah 34:1-8; Malachi 1:2-3; Romans 9:13), and their belongings by means of fire and sword. \r\n\r\nGod commissioned Joshua, \"Be strong and very courageous, that you may observe to do according to all the Law, which Moses My servant commanded you: turn not from it to the right hand or to the left, that you may prosper wheresoever you go. This Book of the Law shall not depart out of your mouth; but you shall meditate therein day and night, that you may observe to do according to all that is written therein: for then you shall make your way prosperous, and have good success\" (Joshua 1:7-8).\r\n\r\nThis man of God was deceived by these accursed people when he made a covenant with them without first consulting the Lord (Joshua 9). Ezra, Nehemiah, Obadiah, Malachi and the other prophets describe how the descendants of Abraham, Isaac and Jacob intermarried through \"multiculturalism.\" Later, in AD740, the nation of Khazaria was converted overnight and inducted into Jewry by Talmudic Jews from Babylon. \r\n\r\nEvery Jewish historian of note, and all encyclopaedias, Jewish and otherwise, agree that only a tiny remnant of so-called Jews is Semitic. None of these possess the faith of Abraham and few worship according to Yahweh Torah instituted by Moses. The few who are not atheistic or agnostic mostly follow Talmudic Judaism which is Pharisaism and anathema to Moses and the prophets.\r\n\r\nAccording to Jewish historian Josephus, the Israelitish high priest John Hyrcanus \"subdued all the Idumeans; and permitted them to stay in that country, if they would circumcise their genitals, and make use of the laws of the Jews; and they were so desirous of living in the country of their forefathers, that they submitted to the use of circumcision, and of the rest of the Jewish ways of living; at which time therefore this befell them, that they were hereafter no other than Jews\". \r\n\r\nThis account of the Idumeans admitting circumcision, and the entire Jewish law, from this time, or from the days of Hyrcanus, is confirmed by their entire history afterward. See Antiq. B. XIV. ch. 8. sect. 1; B. XV. ch. 7. sect. 9. Of the War, B. II. ch. 3. sect. 1; B. IV. ch. 4. sect. 5. This, in the opinion of Josephus, made them proselytes of justice, or entire Jews, as here and elsewhere, Antiq. B. XIV. ch. 8. sect. 1. However, Antigonus, the enemy of Herod, though Herod were derived from such a proselyte of justice for several generations, will allow him to be no more than a half Jew, B. XV. ch. 15. sect. 2. But still, take out of Dean Prideaux, at the year AD129, the words of Ammouius, a grammarian, which fully confirm this account of the Idumeans in Josephus: \"The Jews,\" says he, \"are such by nature, and from the beginning, whilst the Idumeans were not Jews from the beginning, but Phoenicians and Syrians; but being afterward subdued by the Jews, and compelled to be circumcised, and to unite into one nation, and be subject to the same laws, they were called Jews.\" Dio also says, as the Dean there quotes him, from Book XXXVI. p. 37, \"That country is called Judea, and the people Jews; and this name is given also to as many others as embrace their religion, though of other nations.\" But then upon what foundation so good a governor as Hyrcanus took upon him to compel those Idumeans either to become Jews, or to leave the country, deserves great consideration. I suppose it was because they had long ago been driven out of the land of Edom, and had seized on and possessed the tribe of Simeon, and all the southern parts of the tribe of Judah, which was the peculiar inheritance of the worshippers of the true God without idolatry, as the reader may learn from Reland, Palestine, Part I. p. 154, 305; and from Prideaux, at the years 140 and 165\" (Flavius Josephus, Antiquities of the Jews, XIII, 9:1). \r\n\r\nIn AD64 Rome's Jewish emperor Nero wantonly and mercilessly persecuted the Christians, and condemned Paul to a martyr's death. In AD135 Bar Cochba led a revolt against Rome in which about a million non-Jews were sadistically slaughtered (Gibbon, Decline and Fall of the Roman Empire; Westcott, Introduction to Study of the Gospels, p. 132, ed. Boston, 1862). Six thousand years of history is replete with wars, famines, massacres and economic conspiracies engineered by a \"hidden hand\" always working under a different name and in another occupation so that he does not appear as a protagonist although by intrigue and finances he steers both sides of the conflict to achieve a pre-planned outcome of his own design (Genesis 4:14), for God has placed \"enmity\" between the Seed of the Serpent and the seed of the first and last Adam. The enmity is extant and his slaughter of Adam's race, particularly professing Christians and Hebrews who are Israelites, will continue unto the consummation of all life on earth (Genesis 3:15; 27:39-41; Matthew 23:32-36; Revelation 18:24).\r\n\r\nThe wily Khazar, king Bulan, whose kingdom was sandwiched between the Muslim Caliphate and Byzantine Rome, emulated the Gibeonite strategy for political advantage when his Asian court became Talmudic Jews overnight in complete ignorance of the tenets of that religion, followed by his non-Semitic hordes of Mongolian descent. One of many who have traced the history of this \"Kingdom of the Jews,\" was Jewish historian Arthur Koestler in his classic, The Thirteenth Tribe . In his \"History of Jews in the United States,\" Rabbi Levinger admits 82% of American Jews are of Asiatic descent: non-Semitic, anti-Semitic (Genesis 27:41) self-styled or so-called Jews.\r\n\r\nAt the peak of their power the Khazars controlled or exacted tribute from some thirty different nations and tribes inhabiting the vast territories between the Caucasus, the Aral Sea, the Ural Mountains, the town of Kiev and the Ukrainian steppes. The people under Khazar suzerainty included the Bulgars, Burtas, Ghuzz, Magyars (Hungarians), the Gothic and Greek colonies of the Crimea, Slavonic tribes in the north-western woodlands. Beyond these extended dominions, Khazar armies also raided Georgia and Armenia and penetrated into the Arab Caliphate as far as Mosul in Iraq. The Russians defeated Khazaria between the 10th and 11th centuries and inherited most of their lands. The Khazars continued their warfare against Russia for the ensuing thousand years until their invasion from the East side of New York brought them victory in 1917. Financed by their tribesmen in Britain and the United States, they enslaved, raped and pillaged the Russian nation as earlier they mercilessly extorted tribute from countries neighbouring Khazaria. The assassination of Stalin brought about the demise of their power over Russia.\r\n\r\nToday the Khazars control the United States of America and extract tribute as they did from their neighbours in the first Millennium AD. Munya Mardoch, Director of the Israeli Institute for the Development of Weaponry, said in 1994, \"The moral and political meaning of nuclear weapons is that states which renounce their use are acquiescing to the status of Vassal states. All those states which feel satisfied with possessing conventional weapons alone are fated to become vassal states.\" Thus Israel is able to hold the threat of using her nuclear arms against her neighbours to extract non-repayable loans and grants from the United States. \r\n\r\nAfter the extinction of their kingdom, the Khazars dispersed. They established themselves in Venice and Genoa and from the Venetian and Genoese oligarchies they began marrying into the Royal houses of Europe. Khazar and Sephardim Jews (who were often Canaanites) dispersed throughout Europe and continued their predatory pursuits as infamous usurers and tax-gatherers until after long sufferance by their host nations they were expelled to wander to some other place. \r\n\r\nWilliam the Conqueror was financed by Jews expelled from Spain, and having secured the benevolent neutrality of the Holy Roman emperor Henry IV and with solemn approval by Pope Alexander II, he invaded England in 1066 (Encyclopedia Britannica, Vol # 23, p. 609). There is no evidence of Jews residing in England before the Norman Conquest. William the Conqueror brought the Jews into England with him from Rouen, Normandy, 2,600 of them followed after his invasion. At first treated with special favor and allowed to amass considerable wealth, they collected books and built themselves palatial residences; two or three of them are mentioned as physicians, and several monks are said to have been converted to Judaism. \"They brought to England their own form of commerce and a system of rules to facilitate and govern it . . .\" (Foootnote 11: H.C. Richardson, The English Jewry Under Angevin Kings (1960) p. 94). They established the Exchequer and subsequently converted into a class of \"royal usurers\" so abhorrent to the English that in 1290 Edward I expelled them all, over 16,000 Jews, principally owing to the problem of usury. (See the trilogy of historian Sir Arthur Bryant, and JCR-UK - Jewish Communities of the U.K.).\r\n\r\nIn 1647 the English traitor Oliver Cromwell, whose revolution was financed by Manasseh Ben Israel and Moses Carvajal of Amsterdam, allowed Jews to return to England, though the order of banishment was not rescinded by Parliament. History proves that the objective of the International Jewish money lenders was to obtain control of England's economy and government. \r\n\r\nIt was to Antonio Fernandez Carvajal, a Portuguese Marrano (secret Jew) who outwardly passed as a Spanish Catholic merchant, that Cromwell gave the assurance of the right of Jews to remain in England. Under the date February 4, 1657, Burton, in his diary, states: \"The Jews, those able and general intelligencers whose intercourse with the Continent Cromwell had before turned to profitable account, he now conciliated by a seasonable benefaction to their principal agent [Carvajal] resident in England.\" His trading connections enabled him to give Cromwell and his secretary, Thurloe, important information as to the plans both of Charles Stuart in Holland and of the Spaniards in the New World (see L. Wolf, \"Cromwell's Secret Intelligencers\"). Spying activity is continued today by millions of sayanim, the Anti-Defamation League, Jewish Defense League, etc. According to the archives of the Board of Deputies of British Jews established in 1760, the earliest minutes were written in Portuguese reflecting the influence of the Portuguese Jews on Trade. \r\n\r\nFollowing the British Israel hoax devised by the Cabbalist Astronomer to Queen Elizabeth I, John Dee (1527 - 1608), and trading on the Messianic illusions of the Puritans, in 1650 Rabbi Manasseh ben Israel of Amsterdam published Hope of Israel, in which he advocated the return of Jews to England as a preliminary to the appearance of the Messiah. The Messiah could not appear till Jews existed in all the lands of the earth. According to Antonio de Montesinos, the Ten Tribes had been discovered in the North-American Indians, and England was the only country from which Jews were excluded. If England admitted them, the Messianic age might be expected.The next invasion financed by Amsterdam Jews, headed by Solomon Medina, placed William of Orange on the throne of England in 1689 and made it possible for the conspirators to set up the Bank of England, and institute the National Debt, securing for the usurers a first charge on the taxes of England for interest on their loans, and the right to print money was transferred from the Crown to this private \"Bank of England.\" The same pattern was followed in the establishment of the Jew's Federal Reserve non-bank in the United States and other central banks tied in with the City of London's Bank of International Settlements.\r\n\r\nUnder another name and in a different occupation the International Jews have controlled Britain from that day to this (Genesis 4:14). The so-called British Empire was in reality ever the Empire of the City of London. Australia, the United States and other former colonies remain subservient to the City, spilling the blood of their citizens and borrowing at usury to finance Judaeo-Communist takeovers and fight the City's wars of conquest in pursuit of world hegemony. Jewish author Cecil Roth's House of Nasi compares the underground funnelings of Jewry after their expulsion from Spain and Portugal, with the network set up under Hitler a little later. jew.htm\r\nChanging LINKS\r\n\r\ne-mail: ags@biblebelievers.org.au","title":"04_HANDOUT_001_chapter-4-handout-origin-of-jews.md","course_id":"book-of-romans"}