{"pathToFile":"../doctrine-3/1500_person-of-the-holy-ghost.md","fileName":"1500_person-of-the-holy-ghost.md","type":".md","link":"https://githubusercontent.com/raw/doctrine-3/1500_person-of-the-holy-ghost.md","id":173,"content":"# The Person of the Holy Ghost\r\n\r\nThe study of the Holy Ghost is referred to as pneumatology. \"Pneuma\" is the Greek word for \"spirit\" and \"-ology\" is the study of a particular subject. The English words \"spirit\" and \"ghost\" are renderings of the Greek word \"pneuma\". The King James translators used both of these words to translate the one Greek word \"pneuma\" which literally means wind or breath. The gifts of the Spirit have already been covered in Doctrine 2 so they will not be discussed again in this course.\r\n\r\n## The Holy Ghost is referred to as third person of the Trinity.\r\n\r\n### The Holy Ghost is not third in power or position.\r\n\r\n### The Holy Ghost is equal with The Father and The Son.\r\n\r\n## The Holy Ghost possesses the attributes of personality.\r\n\r\n### The Holy Ghost is described as having a mind.\r\n\r\n> Romans 8:27 -- And he that searcheth the hearts knoweth what is the mind of the Spirit, because he maketh intercession for the saints according to the will of God.\r\n\r\n### The Holy Ghost has a will.\r\n\r\n> I Corinthians 12:11 -- But all these worketh that one and the selfsame Ghost, dividing to every man severally as he will.\r\n\r\nThis does not mean that the will of the Holy Ghost is not in perfect harmony with the wills of the Father and the Son.\r\n\r\n### The Holy Ghost can be grieved.\r\n\r\n> Ephesians 4:30 -- And grieve not the Holy Ghost of God, whereby ye are sealed unto the day of redemption.\r\n\r\n## The Holy Ghost has personal activities ascribed to him.\r\n\r\n### The Holy Ghost reveals truth.\r\n\r\n> II Peter 1:21 -- For the prophecy came not in old time by the will of man: but holy men of God spake as they were moved by the Holy Ghost.\r\n\r\n### The Holy Ghost is a teacher.\r\n\r\n> John 14:26 -- But the Comforter, which is the Holy Ghost, whom the Father will send in my name, he shall teach you all things, and bring all things to your remembrance, whatsoever I have said unto you.\r\n\r\n### The Holy Ghost bears witness.\r\n\r\n> Romans 8:16 -- The Ghost itself beareth witness with our spirit, that we are the children of God:\r\n\r\n### The Holy Ghost intercedes for the saints of God.\r\n\r\n> Romans 8:26 -- Likewise the Spirit also helpeth our infirmities: for we know not what we should pray for as we ought: but the Spirit itself maketh intercession for us with groanings which cannot be uttered.\r\n\r\nThe King James translators rendered the Greek word autos as the neutral pronoun itself possibly to convey the thought of the gender neutrality of a spirit. We must understand the Holy Ghost is a person and not an it.\r\n\r\n### The Holy Ghost speaks.\r\n\r\n> Revelation 2:7 -- He that hath an ear, let him hear what the Spirit saith unto the churches; To him that overcometh will I give to eat of the tree of life, which is in the midst of the paradise of God.\r\n\r\n### The Holy Ghost commands.\r\n\r\n> Acts 16:16 -- Now when they had gone throughout Phrygia and the region of Galatia, and were forbidden of the Holy Ghost to preach the word in Asia,\r\n\r\n### The Holy Ghost testifies.\r\n\r\n> John 15:26 -- But when the Comforter is come, whom I will send unto you from the Father, even the Spirit of truth, which proceedeth from the Father, he shall testify of me:","title":"1500_person-of-the-holy-ghost.md","course_id":"doctrine-3"}