{"pathToFile":"../doctrine-3/1600_ministry-of-the-holy-ghost.md","fileName":"1600_ministry-of-the-holy-ghost.md","type":".md","link":"https://githubusercontent.com/raw/doctrine-3/1600_ministry-of-the-holy-ghost.md","id":174,"content":"# The Ministry and Work of the Holy Ghost\r\n\r\n## The Holy Ghost will always exalt Jesus\r\n\r\n> Howbeit when he, the Spirit of truth, is come, he will guide you into all truth: for he shall not speak of himself; but whatsoever he shall hear, that shall he speak: and he will shew you things to come. He shall glorify me: for he shall receive of mine, and shall shew it unto you.&mdash;John 16:13-14\r\n\r\n### He shall not speak of Himself\r\n\r\nThe Holy Ghost does not exalt Himself. He will always exalt Jesus. The error of the false charismatic churches is their exaltation of the Spirit. The spirit that they operate in is not the true Holy Ghost.\r\n\r\n> But when the Comforter is come, whom I will send unto you from the Father, even the Spirit of truth, which proceedeth from the Father, he shall testify of me:&mdash;John 15:26\r\n\r\n### He will not glorify man\r\n\r\nThe Holy Ghost does not exalt man. The Holy Ghost will use a man to glorify Jesus.\r\n\r\n## The Holy Ghost will show you things to come\r\n\r\n> Howbeit when he, the Spirit of truth, is come, he will guide you into all truth: for he shall not speak of himself; but whatsoever he shall hear, that shall he speak: and he will shew you things to come.&mdash;John 16:13\r\n\r\n### The Holy Ghost speaks through prophecy\r\n\r\n### The Holy Ghost will reveal future events\r\n\r\n### The Holy Ghost will show what is to come through an understanding of the Word\r\n\r\n## The Holy Ghost will give power to minister\r\n\r\n> But ye shall receive power, after that the Holy Ghost is come upon you: and ye shall be witnesses unto me both in Jerusalem, and in all Judaea, and in Samaria, and unto the uttermost part of the earth.&mdash;Acts 1:8\r\n\r\n### He will anoint a man to preach the Gospel\r\n\r\n> For our gospel came not unto you in word only, but also in power, and in the Holy Ghost, and in much assurance; as ye know what manner of men we were among you for your sake.&mdash;I Thessalonians 1:5\r\n\r\n> And my speech and my preaching was not with enticing words of man's wisdom, but in demonstration of the Spirit and of power:&mdash;I Corinthians 2:4\r\n\r\n### He will minister to the congregation during the preaching\r\n\r\n## The Holy Ghost will lead men to the truth\r\n\r\n### He will help you to understand the Word\r\n\r\n### He will draw men to the truth\r\n\r\n## The Holy Ghost is the comforter\r\n\r\n> But the Comforter, which is the Holy Ghost, whom the Father will send in my name, he shall teach you all things, and bring all things to your remembrance, whatsoever I have said unto you.&mdash;John 14:26\r\n\r\n## The Holy Ghost will help you to pray\r\n\r\n### The Holy Ghost will empower and help you to pray. \r\n\r\nThere is praying in tongues in the Holy Ghost, but there is also praying in one's own language in the power of the Holy Ghost.\r\n\r\n> But ye, beloved, building up yourselves on your most holy faith, praying in the Holy Ghost&mdash;Jude 20\r\n\r\n### Praying through the saints\r\n\r\n> Likewise the Spirit also helpeth our infirmities: for we know not what we should pray for as we ought: but the Spirit itself maketh intercession for us with groanings which cannot be uttered. And he that searcheth the hearts knoweth what is the mind of the Spirit, because he maketh intercession for the saints according to the will of God.&mdash;Romans 8:26-27\r\n\r\n## The Holy Ghost will lead you into the will of God\r\n\r\n> For as many as are led by the Spirit of God, they are the sons of God.&mdash;Rom. 8:14\r\n\r\n> Then was Jesus led up of the Spirit into the wilderness to be tempted of the devil.&mdash;Matthew 4:1\r\n\r\n### He will give you direction for ministry (Acts 8:29, Acts 10:19-20)\r\n\r\n### He will keep you from doing your own will (Acts 16:6-7)\r\n\r\n## The conviction of the Holy Ghost\r\n\r\n### The Holy Ghost will convict men of their sin\r\n\r\n> Nevertheless I tell you the truth; It is expedient for you that I go away: for if I go not away, the Comforter will not come unto you; but if I depart, I will send him unto you. And when he is come, he will reprove the world of sin, and of righteousness, and of judgment:&mdash;John 16:7-8\r\n\r\n#### The word for reprove here has the meaning of convincing and convicting\r\n\r\n#### The Word alone without the power of the Holy Ghost will not produce conviction of sin\r\n\r\n### Man cannot produce conviction of sin\r\n\r\n## The Holy Ghost is Active in Salvation\r\n\r\n### Born of the Spirit.\r\n\r\n> Jesus answered, Verily, verily, I say unto thee, Except a man be born of water and of the Spirit, he cannot enter into the kingdom of God. That which is born of the flesh is flesh; and that which is born of the Spirit is spirit.&mdash;John 3:5-7\r\n\r\n#### Salvation is a work of the Spirit of God\r\n\r\n#### There is a difference between being born of the Spirit and being filled with the Spirit\r\n\r\n### The Holy Ghost is at work in Sanctification\r\n\r\n> That I should be the minister of Jesus Christ to the Gentiles, ministering the gospel of God, that the offering up of the Gentiles might be acceptable, being sanctified by the Holy Ghost.&mdash;Romans 15:16\r\n\r\n#### Sanctification is a part of Salvation\r\n\r\n#### There is not true salvation without a work of sanctification\r\n\r\n### The power of the Holy Ghost helps the saint to stay saved\r\n\r\n#### The Holy Ghost gives the saint power over sin\r\n\r\n#### The Holy Ghost will keep us from the world\r\n\r\n> Who are kept by the power of God through faith unto salvation ready to be revealed in the last time.&mdash;1 Peter 1:5\r\n","title":"1600_ministry-of-the-holy-ghost.md","course_id":"doctrine-3"}