{"pathToFile":"../gospel-of-john/1200_chapter-12-he-is-the-king.html","fileName":"1200_chapter-12-he-is-the-king.html","type":".html","link":"https://githubusercontent.com/raw/gospel-of-john/1200_chapter-12-he-is-the-king.html","id":214,"content":"<h1>Chapter 12: He is the King</h1>\r\n<h2>The King Anointed 12:1-11</h2>\r\n<p>In the beginning of this chapter we see Jesus return from Ephraim to Bethany to attend a diner invitation. We see from Matt. 26:6 and Mark 14:3 that the diner was at Simon the leper&apos;s house. Lazarus and Martha were also at this feast, and it seems that Martha was helping serve the food. It was during this feast that Mary brought an offering to give to her Master.</p>\r\n<h3>The method of her offering</h3>\r\n<p>Mary entered the house and went to where Jesus was sitting, and poured a box of precious ointment on His feet and then dried them with her hair. This is the second time that Jesus was anointed; the first time is a very similar account that is recorded in Luke 7:36-50 in which an unnamed woman entered the house where Jesus was eating and washed he feet of Jesus with her tears, dried them with her hair, and then anointed them with an ointment that she had carried in an alabaster box. This first time, Jesus was anointed to be prepared for service even as David was anointed before he became king. The second time of anointing was to prepare Jesus for burial (Matt. 26:12).</p>\r\n<h3>The reason of her offering</h3>\r\n<h4>To show her humility</h4>\r\n<p>Mark 14:3 shows that the box was broken. When something is broken in Scriptures, it is often a type of humility. As our lives are broken and He is resident, there is going to be sweetness. When the lord is not King, then the hard times make a person hard, bitter, stubborn, or ugly. God never does anything to help us, but is working out good for us. It takes Him to be in residence so that when we are squeezed so, the fragrance of Jesus may fill the atmosphere instead of bitterness.</p>\r\n<h4>To show her gratitude</h4>\r\n<p>Everything we have we have by His grace. It is when we understand this that we can understand true worship.</p>\r\n<p>The bride is going to be filled with gratitude and real true worship. She will not need anyone to coax her to praise God. As you begin to worship God, His presence becomes stronger and the more you can worship. It is a cycle. It is not hard to worship when the Lord is present.</p>\r\n<h3>The results of her offering</h3>\r\n<h4>A fragrance filled the room</h4>\r\n<p>Song of Solomon 1:12 While the king sitteth at his table, my spikenard sendeth forth the smell thereof.</p>\r\n<p>People carry a fragrance or a spirit that will affect you. The Bride&apos;s life is affected by the bridegroom. What He is, she is becoming.</p>\r\n<blockquote>Genesis 8:21 And the Lord smelled a sweet savour; and the Lord said in his heart, I will not again curse the ground any more for man&apos;s sake; for the imagination of man&apos;s heart is evil from his youth; neither will I again smite any more every thing living, as I have done.</p>\r\n<p>Philippians 4:18 But I have all, and abound: I am full, having received of Epaphroditus the things which were sent from you, an odour of a sweet smell, a sacrifice acceptable, wellpleasing to God.</p>\r\n<p>Revelation 5:8 And when he had taken the book, the four beasts and four and twenty elders fell down before the Lamb, having every one of them harps, and golden vials full of odours, which are the prayers of saints.</blockquote>\r\n<h4>Judas was upset</h4>\r\n<h4>Jesus defended her</h4>\r\n<h2>The King Exalted 12:12-36</h2>\r\n<h3>Exalted by man 12:12-19</h3>\r\n<p>Zech. 9:9</p>\r\n<p>The Triumphant entrance John 12:12-15</p>\r\n<blockquote>John 12:13 Took branches of palm trees, and went forth to meet him, and cried, Hosanna: Blessed is the King of Israel that cometh in the name of the Lord.</blockquote>\r\n<p>To carry palms was a mark of triumphant homage to a victor or a king. The palm was an emblem of joy, victory and Glory. Palm-trees grew on the Mount of Olives on the road from Bethany to Jerusalem. The crowds (one in front and one behind, Mark 11:9; Matt. 21:9; John 12:18) cut the branches as they came.</p>\r\n<blockquote>Psalm 118:25-26 Save now, I beseech thee, O Lord: O Lord, I beseech thee, send now prosperity. Blessed be he that cometh in the name of the Lord: We have blessed you out of the house of the Lord.</p>\r\n<p>John 12:14 And Jesus, when he had found a young ass, sat thereon; as it is written, (Zech. 9:9)</blockquote>\r\n<p>The Purpose of Christ is to show He is the Messiah. This was symbolized clearly in the riding of the young colt. The colt was a noble animal. It was used as a beast of service to carry the burdens of men, it was used by Kings when they entered a city in peace, they rode a colt to symbolize their peaceful purpose. When a King entered a city as a conqueror, he rode a stallion. Jesus was demonstrating two things for the people: First, He was the promised King, the Suffering Savior of the world. Second, that He was not coming as the conquering King. His mission was not to come as a worldly potentate, in pomp and ceremony, not to be the leader of an army to kill, injure and maim; The Messiah was coming as the Savior of Peace who had been sent to save. He was coming to show men that God is the God of Everlasting love. The colt was a symbol of peace. Jesus came to bring peace.</p>\r\n<h3>Exalted by God 12:20-36</h3>\r\n<h2>The King Rejected 12:37-50</h2>\r\n<h3>Many did not believe 12:37-41</h3>\r\n<h3>Many believed but would not confess 12:42, 43</h3>\r\n<h3>They did not believe in the Son nor the Father 12:44-50</h3>","title":"1200_chapter-12-he-is-the-king.html","course_id":"gospel-of-john"}