{"pathToFile":"../prophecy-and-daniel/introduction-to-prophecy.html","fileName":"introduction-to-prophecy.html","type":".html","link":"https://githubusercontent.com/raw/prophecy-and-daniel/introduction-to-prophecy.html","id":273,"content":"<h1 id='_Introduction'>Introduction to Prophecy</h1>\r\n<blockquote>Matthew 1:22&mdash;Now all this was done that it might be fulfilled which was spoken of the Lord by the prophet saying,</blockquote>\r\n\r\n<h2>The Meaning of Prophecy</h2>\r\n\r\n<h3>Prophecy is two-fold.</h3>\r\n<p>Prophecy can be both &quot;Predictive&quot; and &quot;Prescriptive&quot; The prophets were both &quot;fore-tellers&quot; and &quot;forth-tellers&quot;. They had both &quot;foresight&quot; and &quot;insight&quot;.</p>\r\n\r\n<h4>Fore-telling</h4>\r\n\r\n<p>Prophecy is history written in advance. Only God knows the future and because of his infinite knowledge History is &quot;His Story&quot;. To God, the future is no more a mystery than the past is to Him!</p>\r\n\r\n<p>For example, Isaiah 45:1 declares the facts of the fall of Babylon almost 150 years BEFORE it happened. Especially phenomenal is the fact that Cyrus is mentioned by name many years before he was even born! </p>\r\n\r\n<blockquote>Isaiah 45:1&mdash;Thus saith the LORD to his anointed, to Cyrus, whose right hand I have holden, to subdue nations before him; and I will loose the loins of kings, to open before him the two leaved gates; and the gates shall not be shut; </blockquote>\r\n\r\n<h4>Forth-telling</h4>\r\n\r\n<p>Most Bible prophecy is giving a remedy to the people by reminding them of truth and what God has already said. The Bible prophets were faithful to relate the Word of God to the people and their circumstances. They described and prescribed the way of escape or deliverance out of calamity and into the favor of God.</p>\r\n\r\n<p>For example, 2 Chronicles 7:14 gives the remedy for healing and forgiveness. The instruction given carries in it the sense of a PROMISE and this promise is from God. From out of the mouth of God&apos;s prophets came forth God&apos;s guarantees.</p>\r\n\r\n<blockquote>2 Chronicles 7:14&mdash;If my people, which are called by my name, shall humble themselves, and pray, and seek my face, and turn from their wicked ways; then will I hear from heaven, and will forgive their sin, and will heal their land.</blockquote>\r\n\r\n<h3>Prophecy is a Divine utterance.</h3>\r\n<p>Prophecy is not reasoned discourse or inspired preaching, but is the utterance of the Spirit.</h4>\r\n\r\n<blockquote>2 Peter 1:21&mdash;For the prophecy came not in old time by the will of man: but holy men of God spake as they were moved by the Holy Ghost.</blockquote>\r\n\r\n<p>The Greek word (prophetes) for &quot;prophecy&quot; is made of two Greek words: &quot;pro&quot; meaning <i>before</i>, or <i>in place of</i> and &quot;phemi&quot; meaning <i>to speak</i>. A true prophet speaks on the behalf of the only One who knows the future&mdash;God.</p>\r\n\r\n\r\n<h2>The Study of Prophecy</h2>\r\n\r\n<p>Reasons we study prophecy:</p>\r\n\r\n<h3>The Bible is prophetic.</h3>\r\n<p>Two-thirds of Scripture is prophetic either in type or direct statement. Unlike any other religious book, the Bible successfully establishes its &quot;authenticity, authority and inspiration&quot; with prophecy.</p>\r\n\r\n<h3>That we be not ignorant of God&apos;s plan.</h3>\r\n<p>If we do not know what is going to happen, we will not make preparation. (Read II Peter 3:3-8.)</p>\r\n\r\n<blockquote>2 Peter 3:4&mdash;And saying, Where is the promise of his coming? for since the fathers fell asleep, <u>all things continue as they were</u> from the beginning of the creation.</blockquote>\r\n\r\n<h3>That we can understand the present and how it relates to the future.</h3>\r\n<p>We can understand how our present time relates to prophetic truth only if we are aware of the &quot;signs of the times&quot;. The Bible is filled with signs of the times. These signs are markers or tells that identify where in the prophetic time-line we are.</p>\r\n<p>Read the following Scriptures: 1 Thessalonians 5:1-6; 2 Timothy 3:13; 2 Thessalonians 2:3; Daniel 12:4-10; 2 Peter 1:19.</p>\r\n\r\n<h3>That we be not led into error.</h3>\r\n<p>It is possible for believers to be led astray. To remain ignorant of God&apos;s prophetic instruction is a fatal mistake.</p>\r\n<blockquote>Hosea 4:6&mdash;My people are destroyed for lack of knowledge: because thou hast rejected knowledge, I will also reject thee, that thou shalt be no priest to me: seeing thou hast forgotten the law of thy God, I will also forget thy children.</blockquote>\r\n<p>Read the following Scriptures: Matthew 24:24; Revelation 3:18-22; 2 Tim. 3:13.</p>\r\n\r\n<h2>The Proof of Prophecy -</h2>\r\n<h3>It must be beyond all human attempts or foresight.</h3>\r\n<p>Beyond one&apos;s knowledge of a situation.</p>\r\n<h3>It must have been made known prior to its fulfillment.</h3>\r\n<h3>It must have a clear and detailed fulfillment.</h3>\r\n<p>Even though there are many impersonators, there are still some true prophets. God has given and continues to give them to His Church.</p>\r\n\r\n<blockquote>Ephesians 4:11&mdash;And he gave some, apostles; and some, prophets; and some, evangelists; and some, pastors and teachers;</blockquote>\r\n<!-- left off editing around here -->\r\n<h2>The Object of Prophecy -</h2>\r\n<p>There are classes of Prophecy - I Cor. 10:32</p>\r\n<h3>1. Jews -</h3>\r\n<h3>2. Gentiles -</h3>\r\n<h3>3. Church -</h3><div class='questions-page'>\r\n<h1>Prophetic Aspect of the Ages</h1>\r\n<p>The first recorded age is prophetic of every other age.</p>\r\n<h2>1. Age of progress and civilization </h2>\r\n<h3>(1) Cities were built Gen. 4:16-17</h3>\r\n<h3>(2) Agriculture flourished Gen. 4:20</h3>\r\n<h3>(3) Instruments invented Gen. 4:21 - music</h3>\r\n<h3>(4) Discoveries and inventions Gen. 4:22</h3>\r\n<h2>2. Age of separation </h2>\r\n<p>Two classes of people -</p>\r\n<h3>(1) Cainites - the worldly</h3>\r\n<h3>(2) Sethites - the Godly</h3>\r\n<p>Age grew progressively worse tremendous moral collapse</p>\r\n<p>Religious corruption set in</p>\r\n<h2>3. Age of grace </h2>\r\n<p>Noah found grace in the sight of God.</p>\r\n<h3>(1) Coming judgment announced</h3>\r\n<p>The warning was an act of grace</p>\r\n<h3>(2) The Ark for a refuge</h3>\r\n<p>For salvation and safety</p>\r\n<h3>(3) The Deluge</h3>\r\n<p>Not to contaminate the rest</p>\r\n<p>All this is prophetic of this age Matt. 24:37</p>\r\n<h3>(4) The Translation</h3>\r\n<p>Enoch is a type of the translated saints. Heb. 11:5 Jude 1415</p>\r\n<h3>(5) The Rapture</h3>\r\n<p>Methuselah is a type of the Church II Thes. 2:7</p>\r\n<h3>(6) The Revelation</h3>\r\n<p>Noah is a type of the saints that pass through the Tribulation Rev. 12:17</p>\r\n<h2>4. Age of judgment</h2>\r\n<h3>(1) The judgment of man</h3>\r\n<p>The results of man&apos;s own wickedness</p>\r\n<p>Disease - sickness - murder</p>\r\n<h3>(2) The judgment of God Gen. 7:11-24</h3>\r\n<p>Noah&apos;s prophecy - Gen. 9:25-27</p>\r\n<p>Brief sketch of the history of nations.</p>\r\n<p>Curse pronounced upon Ham.</p>\r\n<p>Blessing upon Japheth and Shem.</p>\r\n<p>Gen. 10:6 - Four sons of Ham</p>\r\n<p>Cush Mairaim Phut and Canaan</p>\r\n<p>Curse pronounced upon Canaan</p>\r\n<p>Ham the father of Cush grandfather to Nimrod who became the founder of Babylon.</p>\r\n<p>Ham father of Mizraim the progenitor of Egypt.</p>\r\n<p>Ham father of Canaan from who sprang the Canaanites.</p>\r\n<p>Eventually both Egypt and Canaan succumbed to the descendants of Japheth (the Greeks and Romans)</p>\r\n<p>(The Gentiles)</p>\r\n<p>Shem from whom comes the Jews.</p>\r\n<p>Japheth means extended or enlarged - &quot;Let God enlarge Japheth and let him dwell in the tents of Shem and Canaan be his servant.&quot;</p>\r\n<p>Thru Shem Japheth is to receive and share the promised blessing.</p>\r\n<p>John 4:22 Eph. 2:12</p>\r\n<p>Text for the Course - I Cor. 10:32 - Memorize the verse.</p>\r\n<p>Divine analysis of the human race:</p>\r\n<p>I. Jews  II. Gentiles  III. Church</p>\r\n","title":"introduction-to-prophecy.html","course_id":"prophecy-and-daniel"}