{"pathToFile":"../sermon-outlines-by-stephen-reynolds-sr/consecration-to-gods-service.md","fileName":"consecration-to-gods-service.md","type":".md","link":"https://githubusercontent.com/raw/sermon-outlines-by-stephen-reynolds-sr/consecration-to-gods-service.md","id":287,"content":"# \r\n\r\n1 Chronicles 29:1-9\r\n\r\n1Ch 29:5 The gold for things of gold, and the silver for things of silver, and for all manner of work to be made by the hands of artificers. And who then is willing to consecrate his service this day unto the LORD?\r\n\r\nDavid was planning on top of giving.\r\n\r\nAll the gold and precious things were spoils of victories of battles.\r\n\r\nvs. 5 &hellip; who then is willing to consecrate his service this day unto the LORD?\r\n\r\n1Ch 29:0 Wherefore David blessed the LORD before all the congregation:&hellip;.\r\n\r\n[everyone included] &hellip; all the congregation &hellip;\r\n\r\nAll the things we offer to God, He gave it to us in the first place! \r\n\r\nvs. 14 &hellip;for all things come of thee, and of thine own have we given thee.\r\n\r\n1 Peter 4:10 As every man hath received the gift, even so minister the same one to another, as good stewards of the manifold grace of God. 11 If any man speak, let him speak as the oracles of God; if any man minister, let him do it as of the ability which God giveth: that God in all things may be glorified through Jesus Christ, to whom be praise and dominion for ever and ever. Amen.\r\n\r\nTransformation&hellip; GOD IS MY STRENGTH, SWORD, ROCK\r\n\r\n1Sa 17:49 And David put his hand in his bag, and took thence a stone, and slang it, and smote the Philistine in his forehead, that the stone sunk into his forehead; and he fell upon his face to the earth. 1Sa 17:50 So David prevailed over the Philistine with a sling and with a stone, and smote the Philistine, and slew him; but there was no sword in the hand of David.\r\n\r\n&hellip;. saw what God did for David, He will now do something through us!\r\n\r\n1Sa 17:52 And the men of Israel and of Judah arose, and shouted, and pursued the Philistines, until thou come to the valley, and to the gates of Ekron. And the wounded of the Philistines fell down by the way to Shaaraim, even unto Gath, and unto Ekron.\r\n\r\n&hellip;.\r\n\r\nMoments before had NO MIND to pursue the Philistines. A TRANSFORMATION took place!\r\n\r\n> 1 Chronicles 28:10 Take heed now; for the LORD hath chosen thee to build an house for the sanctuary: **be strong, and do it**.\r\n\r\nBE STRONG AND DO IT!","title":"consecration-to-gods-service.md","course_id":"sermon-outlines-by-stephen-reynolds-sr"}