{"pathToFile":"../through-the-psalms/01_classification_lament.md","fileName":"01_classification_lament.md","type":".md","link":"https://githubusercontent.com/raw/through-the-psalms/01_classification_lament.md","id":327,"content":"&nbsp;\r\n<div class=\"fancy\"><span>Deliverance Center House of Prayer</span></div>\r\n\r\n# The Psalms of Lament\r\n\r\n<p class=\"fancy\"><span>March 18, 2018</span></p>\r\n\r\n## Introduction\r\n\r\n> Psalm 60:1 &mdash; O God, thou hast cast us off, thou hast scattered us, thou hast been displeased; O turn thyself to us again.\r\n\r\n1. What are the \"Psalms of Lament\"?\r\n\r\nThese psalms contain a cry for deliverance or defense and are addressed directly to God. There are 56 psalms of lament.\r\n\r\nAs a noun a \"lament\" is a passionate expression of grief or sorrow. Some synonyms are:\twailing, lamentation, moaning, weeping, crying\r\n\r\nAs a verb to \"lament\" means to mourn, feel or express sorrow or regret.\r\n\r\n2. They may be national.\r\n\r\n3. They may be individual. \r\n\r\n## National Lament\r\n\r\nChapters 12, 44, 58, 60, 74, 77, 79, 80, 82, 83, 85, 90, 94, 106, 108, 123, 126, 137.\r\n\r\n> Psalm 137:1 &mdash; By the rivers of Babylon, there we sat down, yea, we wept, when we remembered Zion.\r\n\r\n(Read Psalm 80:1-7)\r\n\r\n## Individual Lament\r\n\r\nChapters 5-7, 13, 17, 22, 25, 26, 28, 31, 35, 36, 38, 39, 42, 43, 51, 54-57, 59, 61, 63, 64, 69-71, 86, 88, 102, 109, 120, 130, 140-143.\r\n\r\n> Psalm 5:1-3 &mdash; Give ear to my words, O Lord, consider my meditation. 2 Hearken unto the voice of my cry, my King, and my God: for unto thee will I pray. 3 My voice shalt thou hear in the morning, O Lord; in the morning will I direct my prayer unto thee, and will look up.\r\n\r\n(Read Psalm 64. David's whole life characterized by the type of struggles descriped and not not a specific occasion inspires this psalm.)\r\n\r\n## Voicing Frustration to God\r\n\r\n(Read Psalm 13)\r\n\r\nIn these psalms of lament we find many questions addressed to God.\r\n\r\n> Psalm 13:1 &mdash; How long wilt thou forget me, O Lord? for ever? how long wilt thou hide thy face from me?\r\n\r\nHow is this different from the grumbling against him, of the Israelites when they journeyed from Egypt to the Promised Land?\r\n\r\n> Numbers 14:22 &mdash; Because all those men which have seen my glory, and my miracles, which I did in Egypt and in the wilderness, and have tempted me now these ten times, and have not hearkened to my voice;\r\n\r\n- The Israelites spoke about God (as it were) behind his back. They spoke as if they had given up on God.\r\n\r\n- The complaints of the psalmists are spoken directly to God. The psalmists have not given up on God but are expressing the opposite of that. \r\n\r\n- Whatever real emotions they had they present to God, but in the context of asking for help and hoping that he would answer them in their distress.\r\n\r\n> Hebrews 4:13 &mdash; Neither is there any creature that is not manifest in his sight: but all things are naked and opened unto the eyes of him with whom we have to do.\r\n\r\n> Psalm 139:4 For there is not a word in my tongue, but, lo, O Lord, thou knowest it altogether.\r\n\r\n## Believing in Deliverance by God\r\n\r\n> Psalm 27:13 &mdash; I had fainted, unless I had believed to see the goodness of the LORD in the land of the living.\r\n\r\n(Read Psalm 108)\r\n\r\n## Committed to Repentance before God\r\n\r\nPsalm 51 is inspired by Nathan confronting David about his adultery with Bathsheba 2 Samuel 11–12.\r\n\r\n> 2 Samuel 12:7 mdash; And Nathan said to David, Thou art the man. Thus saith the Lord God of Israel, I anointed thee king over Israel, and I delivered thee out of the hand of Saul;\r\n\r\n<!-- -->\r\n\r\n> Psalm 51:1 &mdash; Have mercy upon me, O God, according to thy lovingkindness: according unto the multitude of thy tender mercies blot out my transgressions.","title":"01_classification_lament.md","course_id":"through-the-psalms"}