{"pathToFile":"../through-the-psalms/04_classification_praise.md","fileName":"04_classification_praise.md","type":".md","link":"https://githubusercontent.com/raw/through-the-psalms/04_classification_praise.md","id":331,"content":"&nbsp;\r\n<div class=\"fancy\"><span>Deliverance Center House of Prayer</span></div>\r\n\r\n# Psalms of Praise\r\n\r\n<p class=\"fancy\"><span>April 15, 2018</span></p>\r\n\r\n## Introduction\r\n\r\n(Psalms 8, 19, 29, 33, 100, 103, 104, 111, 113, 114, 117, 135, 136, 145 – 150)\r\n\r\nThe **Psalms of Praise** are constructed around three key elements: \r\n\r\n1. A call to praise or introduction\r\n\r\n2. A cause for praise (usually for God’s attributes or deeds)\r\n\r\n3. A conclusion\r\n\r\nPsalm is organized into five books. Each book concludes with a doxology, with the entire book of Psalms capped by Psalm 150, a grand ascribing of praise to God.\r\n\r\n- Book 1 - 1-41 &mdash; DOXOLOGY: 41:13  \r\n- Book 2 - 42-72 &mdash; DOXOLOGY:  72:18,19 \r\n- Book 3 - 73-89  &mdash; DOXOLOGY:  89:52\r\n- Book 4 - 90-106 &mdash; DOXOLOGY:  106:48\r\n- Book 5 - 107-150 &mdash; DOXOLOGY:  150\r\n\r\n## Commmaded to Praise\r\n\r\nAt least 250 times we can find declarative statements regarding praising God in the Bible.\r\n\r\nWe are to say praiseworthy things of God. Not just: \"Praise God\", \"Hallelujah\".\r\n\r\n> HALLELUJAH: praise ye Jehovah, frequently rendered \"Praise ye the LORD,\" stands at the beginning of ten of the psalms (106,111-113,135,146-150), hence called \"hallelujah psalms.\" The Greek form of the word (alleluia) is found in Revelation 19:1,3,4,6.\r\n\r\nPraise is not a feeling, but is a conscious and thoughtful action of extolling God for who He is and what He has done. While singing even a simple song thoughtfully consider God in his love, mercy, holiness, magnificence, etc.\r\n\r\n> Psalm 117:1-2 &mdash; 1 O praise the LORD, all ye nations: praise him, all ye people.\r\n2 For his merciful kindness is great toward us: and the truth of the LORD endureth for ever. Praise ye the LORD.\r\n\r\n> Psalm 150:2 &mdash; Praise him for his mighty acts: praise him according to his excellent greatness.\r\n\r\n## What is Praiseworthy about God?\r\n\r\nPRAISEWORTHY: deserving approval and admiration.\r\n\r\n> Philippians 4:8 Finally, brethren, whatsoever things are true, whatsoever things are honest, whatsoever things are just, whatsoever things are pure, whatsoever things are lovely, whatsoever things are of good report; if there be any virtue, and if there be any praise, think on these things.\r\n\r\n### Psalms 8\r\n\r\n - Excellent is Thy Name v. 1\r\n\r\n> EXCELLENT: superior; very good of its kind; eminently good; first-class\r\n\r\n - Glorious (above the heavens) v. 1\r\n\r\n> GLORIOUS: possessing or deserving glory; marked by great beauty or splendor; delightful, wonderful\r\n\r\n - Strong and the Strength Giver vs. 2,6\r\n\r\n### Psalm 19\r\n\r\n- Glorious in His Handy Work (of making the heavens) v. 1\r\n\r\n- His Law is Perfect, Right, Pure, Enlightening, Desirous (day and night utter knowledge) v. 7\r\n\r\n> PERFECT: having all the required or desirable elements, qualities, or characteristics; as good as it is possible to be: ideal, model, without fault, faultless, flawless, consummate, quintessential, exemplary, best, ultimate, absolute; complete.\r\n\r\n## Psalm 29\r\n\r\n## 33, 100, 103, 104, 111, 113, 114, 117, 135, 136, 145 – 150\r\n\r\n## Psalm 135\r\n\r\n- the LORD is good v. 3\r\n\r\n> GOOD &mdash; to be desired or approved of; having the qualities required for a particular role:\tfine, superior, quality; that which is morally right; righteousness: virtue, righteousness, morality, integrity; benefit or advantage to someone.\r\n\r\n","title":"04_classification_praise.md","course_id":"through-the-psalms"}