{"pathToFile":"../through-the-psalms/06_classification_zion.md","fileName":"06_classification_zion.md","type":".md","link":"https://githubusercontent.com/raw/through-the-psalms/06_classification_zion.md","id":335,"content":"&nbsp;\r\n<div class=\"fancy\"><span>Deliverance Center House of Prayer</span></div>\r\n\r\n# Psalms of Zion\r\n\r\n<p class=\"fancy\"><span>June 6, 2018</span></p>\r\n\r\n## Introduction\r\n\r\n **Psalms of Zion** extol Zion, or Jerusalem, for its exalted role as the abode of God’s glory and as the religious and political capital of the nation (Chapters 15, 24, 46, 48, 50, 76, 81, 84, 87, 95, 122, 134).\r\n\r\n## Pilgrim Psalms\r\n\r\n The Pilgrim Psalms are sometimes included with the Psalms of Zion as they do not really constitute a distinct literary type of their own. Pilgrim Psalms or Song of Ascents is a title given to fifteen of the Psalms, 120–134, each starting with the ascription **Shir Hama'aloth** (literally meaning \"to go up to\"). \r\n\r\n They are also called:\r\n - Gradual Psalms\r\n - Songs of Degrees\r\n - Songs of Steps\r\n - Pilgrim Songs\r\n\r\nFour of these psalms (122, 124, 131 and 133) are linked in their ascriptions to David, and one (127) to Solomon. Psalms of Ascents were sung by pilgrims journeying up to Jerusalem for the three annual feasts of Passover, Pentecost, and Tabernacles (in Hebrew: Pesach, Shavuot and Succot).\r\n\r\n## Zion\r\n\r\n1. The City of David\r\n\r\nDavid Took the Stronghold of Zion which was the easternmost of the two hills of ancient Jerusalem. \r\n\r\n> 2 Samuel 5:6-10 &mdash; 6 And the king and his men went to Jerusalem unto the Jebusites, the inhabitants of the land: which spake unto David, saying, Except thou take away the blind and the lame, thou shalt not come in hither: thinking, David cannot come in hither. 7 Nevertheless David took the strong hold of Zion: the same is the city of David. 8 And David said on that day, Whosoever getteth up to the gutter, and smiteth the Jebusites, and the lame and the blind that are hated of David's soul, he shall be chief and captain. Wherefore they said, The blind and the lame shall not come into the house. 9 So David dwelt in the fort, and called it the city of David. And David built round about from Millo and inward. 10 And David went on, and grew great, and the LORD God of hosts was with him.\r\n\r\nDavid had pitched a tent for the Ark of the Covenant in 1 Chronicles 15. When Solomon built the temple in Jerusalem, the meaning of Zion expanded further to include the temple area.\r\n\r\n> 1 Kings 8:1 Then Solomon assembled the elders of Israel, and all the heads of the tribes, the chief of the fathers of the children of Israel, unto king Solomon in Jerusalem, that they might bring up the ark of the covenant of the LORD out of the city of David, which is Zion.\r\n\r\nIn the Old Testament Zion is used as a name for the city of Jerusalem (Isaiah 40:9), the land of Judah (Jeremiah 31:12), and the nation of Israel as a whole (Zechariah 9:13).\r\n\r\n2. The City of God\r\n\r\nThe word Zion occurs over 150 times in the Bible. It essentially means “fortification” and has the idea of being “raised up” as a “monument.” \r\n\r\nThe word Zion is also used in a spiritual sense in Scripture. In the Old Testament Zion refers figuratively to Israel as the people of God (Isaiah 60:14). In the New Testament, Zion refers to God’s spiritual kingdom. We have not come to Mount Sinai, says the apostle, but “to Mount Zion and to the city of the living God, the heavenly Jerusalem” (Hebrews 12:22). Peter, quoting Isaiah 28:16, refers to Christ as the Cornerstone of Zion: “See, I lay a stone in Zion, a chosen and precious cornerstone, and the one who trusts in him will never be put to shame” (1 Peter 2:6).\r\n\r\nJsust as King David was a temporal version of the eternal King, Jesus Christ, the \"city of David\" was a temporal shadow of the eternal and spiritual city, Zion, where Christ will reign. \r\n\r\nContrasted with Babylon in Psalm 137:1.\r\n\r\n## Reading\r\n\r\n- Psalm 15:1 &mdash; Lord, who shall abide in thy tabernacle? who shall dwell in thy holy hill?\r\n- Psalm 24:3 &mdash; Who shall ascend into the hill of the LORD? or who shall stand in his holy place?\r\n- Psalm 46:7 &mdash; The LORD of hosts is with us; the God of Jacob is our refuge. Selah. (v.11)\r\n- Psalm 48:1 &mdash; Great is the LORD, and greatly to be praised in the city of our God, in the mountain of his holiness.\r\n- Psalm 50:2 &mdash; Out of Zion, the perfection of beauty, God hath shined.\r\n- Psalm 76:2 &mdash; In Salem also is his tabernacle, and his dwelling place in Zion.\r\n- Psalm 81:10,11 &mdash; 10 I am the LORD thy God, which brought thee out of the land of Egypt: open thy mouth wide, and I will fill it. 11 But my people would not hearken to my voice; and Israel would none of me.\r\n- Psalm 84:10 &mdash; For a day in thy courts is better than a thousand. I had rather be a doorkeeper in the house of my God, than to dwell in the tents of wickedness.\r\n- Psalm 87:2 &mdash; The LORD loveth the gates of Zion more than all the dwellings of Jacob.\r\n- Psalm 95:2 &mdash; Let us come before his presence with thanksgiving, and make a joyful noise unto him with psalms.\r\n- Psalm 122:6: &mdash; Pray for the peace of Jerusalem: they shall prosper that love thee.\r\n- Psalm 134:1 &mdash; Behold, bless ye the LORD, all ye servants of the LORD, which by night stand in the house of the LORD. \r\n\r\n## Why Pray for Peace?\r\n\r\n- Psalm 122 A Song of degrees of David.\r\n\r\n> Psalm 122 &mdash; 1 I was glad when they said unto me, Let us go into the house of the Lord. 2 Our feet shall stand within thy gates, O Jerusalem. 3 Jerusalem is builded as a city that is compact together: 4 Whither the tribes go up, the tribes of the Lord, unto the testimony of Israel, to give thanks unto the name of the Lord. 5 For there are set thrones of judgment, the thrones of the house of David. 6 Pray for the peace of Jerusalem: they shall prosper that love thee. 7 Peace be within thy walls, and prosperity within thy palaces. 8 For my brethren and companions' sakes, I will now say, Peace be within thee. 9 Because of the house of the Lord our God I will seek thy good.\r\n\r\n- Glad: to go into \"the house of the Lord\"\r\n- A city that is \"compact together\": \"united together\"\r\n- v.6 \"...: they shall prosper that love thee.\" (also translated \"may those who love you prosper\")\r\n\r\n\t- Psalm 29:11 It is God who causes to prosper: strength and peace (Psalm 118:25)\r\n\t- Psalm 102:14 God's Servants Care About the Prosperity of Jerusalem (stones and dust)\r\n\t- Isaiah 66:10 A Command to Love Jersusalem\r\n\t- Jeremiah 29:7 Those Who Love Jerusalem were to Seek the Prosperity of the City in which they were exiled\r\n\r\n1. \"A Psalm of David\" Pray for Peace in the Time of Peace\r\n\r\nIt is one thing to repine for peace lost and another thing to do what is necessary to maintain peace. David's and Solomons reigns are the \"golden age\" of Israel's history. It is during this golden age that David implores, \"Pray for the peace of Jerusalem\".\r\n\r\n2. Pray for Peace for the City of Exile\r\n\r\nEllicot wrote, \"This was, we may believe, the hardest command of all.\" Some of these are those who hung up their harps on the willows. (Psalm 137) These are thoseIf we are not in peace, our controversy is with God!\r\n\r\n3. Pray for Peace in the Time of Trouble (God has not given up on His people. )\r\n\r\n> Romans 11:2 &mdash; God hath not cast away his people which he foreknew...\r\n\r\nThe True Prince of Peace: \r\n\r\n> Isaiah 9:6 &mdash; For unto us a child is born, unto us a son is given: and the government shall be upon his shoulder: and his name shall be called Wonderful, Counsellor, The mighty God, The everlasting Father, The Prince of Peace.","title":"06_classification_zion.md","course_id":"through-the-psalms"}