{"pathToFile":"../book-of-romans/01_101_pauls-introduction-to-book.md","fileName":"01_101_pauls-introduction-to-book.md","type":".md","link":"https://githubusercontent.com/raw/book-of-romans/01_101_pauls-introduction-to-book.md","id":62,"content":"# Paul&apos;s Introduction to Romans - Ch. 1:1-17\r\n\r\n## Paul&apos;s Salutation\t\t\t\t\t1:1-7\r\n\r\n### His Position, vs. 1, 5\r\n\r\n> Paul, a servant of Jesus Christ, called to be an apostle, separated unto the gospel of God\r\n\r\nPaul gives his credentials:\r\n\r\n#### Paul\r\n\r\nPaul was born Saul about 1 AD in Tarsus. Saul is a Hebrew name meaning &quot;demanded; prayed for.&quot; Paul is a Latin name meaning &quot;small; little.&quot; The changing of Saul&apos;s name to Paul is not explained in the Scripture but is simply and matter-of-factly stated in Acts 13:9. There is an undeniable connection between Paul&apos;s Gentile name and his strongly Gentile ministry. (I Timothy 2:7)\r\nSaul&apos;s hometown of Tarsus was a great center of learning in the ancient world likened to the cities of Athens and Alexandria, but Saul was raised in Jerusalem under the tutelage of the great teacher Gamaliel, a Pharisee and a member of the Sanhedrin. (Acts 22:3) Gamaliel was a doctor of the Jewish law. (Acts 5:34) It was under the mastery of this great rabbi that Paul was infused with a great zeal for Jewish Law which led to his persecution of Christians. Saul eventually became a member of the Sanhedrin and was also a Pharisee. Saul&apos;s training also made him an expert on Jewish Law. He was well-equipped to answer later on his Christian ministry any accusation or question of the Jews.\r\nTarsus was particularly favored by the Roman Empire. Jewish citizens of Tarsus could receive Roman citizenship. Saul of Tarsus was a Roman citizen. The privileges of Roman citizenship included the right to vote, the right to have a legal trial, the right to appeal lower court decision at the higher court levels and in cases of alleged treason the right to be tried in Rome. A Roman citizen could not be tortured, whipped or condemned to death unless convicted of treason. In Acts 22, Paul&apos;s Roman citizenship prevented his death and even a scourging.\r\n\r\n#### A Servant of Jesus Christ\r\n\r\nPaul, a free-born Roman citizen chooses to identify himself as a doulos or &quot;bond-servant&quot; of Jesus Christ. A &quot;bond-servant&quot; is one bound to another by honorable ties for life. The New American Standard Bible Greek Lexicon includes the following statement in its definition of &quot;doulos&quot;: &quot;devoted to another to the disregard of one's own interests.&quot;\r\nThe writers of the New Testament used the title &quot;servant&quot; often as a name by which they expected to be known. Christ commanded His disciples in Mark 10:44, &quot;And whosoever of you will be the chiefest, shall be servant of all.&quot; Paul&apos;s writing of Romans was with great authority not because of his credentials, but because of His Master Whose ambassador he was. Paul made his plea known based on Christ&apos;s Lordship and the blessing of the Believer&apos;s voluntary service to Him. Paul&apos;s heart and spirit rang in trueness with John the Baptist&apos;s declaration and was a world apart from the theologians and &quot;Doctors of Divinity&quot; who strive for masteries. John the Baptist declared speaking of Christ in John 3:30, &quot;He must increase, but I must decrease.&quot; The heart of a true servant exalts its Lord and not itself.\r\nA teacher asked, &quot;How can you tell if you have a servant attitude?&quot; &quot;By the way you react when you are treated like one,&quot; was the reply. As a servant of the master, you must be willing to take all that the Master has taken (John 15:18; 17:14). Sometimes we might have to wash windows, or even someone&apos;s feet. Christ wants more than just words (John 13:5-17). If you want to be great in the Kingdom, learn to be the servant of all!\r\nPaul is a slave to the &quot;savior&quot; (not the &quot;king&quot;). He tells us more in chapter 12.\r\n\r\n#### Called to be an Apostle\r\n\r\nAn apostle is one who has been SENT FORTH as a messenger or representative of and fully authorized by the sender&mdash;a delegate or ambassador. (Acts 9:3-9, 15-22, 28) Paul&apos;s calling was not earthly. He was not even a candidate in the vote taken in Acts 1, but Paul&apos;s calling and sending forth as an apostle came from Christ. (1:5) Paul emphasizes that he was called to be an Apostle; this calling was by God and not by man.\r\n\r\n> Galatians 1:1&mdash;Paul, an apostle, (not of men, neither by man, but by Jesus Christ, and God the Father, who raised him from the dead;)\r\n\r\n#### Separated Unto the Gospel of God\r\n\r\n##### &quot;Separated&quot; &mdash; Paul&apos;s ordination is given in Acts 13:1-4.\r\n\r\n##### &quot;Unto the Gospel of God&quot;\r\n\r\nPaul was a &quot;preacher of the Gospel&quot;. He was a separated messenger with a special Message. The Gospel is a mystery (Mark 4:11; I Tim. 3:9,16; Col. 2:2; 4:3; Eph. 1:9) and a Divine revelation. (Acts 9).\r\n\r\nAbsolute consecration is spoken of in these words. Paul was set apart to preach one message and only one message. Paul did not declare a message that exalted himself nor did he do a work to further his position in the eyes of men. Paul declares that his purpose in life was the Gospel of God, and so should this be our purpose as ministers of the Gospel.\r\n\r\n<!-- Step #17 -->\r\n\r\n### His Message, vs. 1-5\r\n\r\nPaul&apos;s message is the Gospel. The Gospel does not originate from Paul and is wholly concerned with Jesus Christ: our Lord, seed of David, Son of God, resurrected.\r\n\r\n#### Preached by His Apostles \tvs. 1,5\r\n#### Promised &quot;by his prophets&quot; vs. 2 (Isa. 53:11; Jer. 23:6; 33:16)\r\n#### Made of the Seed of David\t\t\tvs. 3\r\n#### Revealed through the Holy Ghost vs. 4\r\n\r\nNOTE: The Gospel does not rest on the incarnation, but on the resurrection of Christ.\r\n\r\n<!-- Step #18 -->\r\n\r\n### His Readers, vs.6-7\r\n\r\n\r\n\r\n#### The called of Jesus Christ:\r\n\r\nThose connected to Jesus are connected with Him by His calling. The Called that Paul is writing to does not simply mean those invited, but means those invited that have come.\r\n\r\n#### All that be in Rome,\r\n\r\n##### It is unquestionable that the recipients of this epistle were the Roman Christians.\r\n\r\nRomans 1:7&mdash;To all that be in Rome, beloved of God, called to be saints&ellip;\r\nRomans 1:15&mdash;&ellip;I am ready to preach the gospel to you that are at Rome also.\r\n\r\n##### The Christians at Rome were Predominately Gentile.\r\n\r\nScripture seems to point to a predominantly Gentile Roman church as Paul&apos;s manner of addressing the church leaves hardly any doubt that he is writing to Gentiles.\r\n\r\nIn chapter one, Paul speaks of his apostleship for obedience of the faith among all the nations (1:5). He refers to the recipients as \"other gentiles\" and also gives as his reason for being ready to preach the Gospel to them as that he is debtor both to the Greeks and to the barbarians (1:14), and that the Gospel is the power of God unto salvation, though to the Jew first, yet to the Greek also (1:16).\r\n\r\n> 1:13&mdash;I might have some fruit among you also, even as among other Gentiles.\r\n\r\nWhen the position and prospects of the Jewish nation are under review and Paul comes to admonition, it is to the Gentile believers that he addresses it.\r\n\r\n> 11:13&mdash;For I speak to you Gentiles, inasmuch as I am the apostle of the Gentiles, I magnify mine office:\r\n> 15:15-16&mdash; Nevertheless, brethren, I have written the more boldly unto you in some sort, as putting you in mind, because of the grace that is given to me of God, 16 That I should be the minister of Jesus Christ to the Gentiles, ministering the gospel of God, that the offering up of the Gentiles might be acceptable, being sanctified by the Holy Ghost.\r\n\r\n#### Beloved of God,\r\n\r\nSinners should believe that God loves them; but , saints should know they are the &quot;beloved of God&quot;. The unsaved are never called &quot;God&apos;s Beloved.&quot;\r\n\r\n#### Called to be saints:\r\n\r\nThe family of God comprises of saints called out of the world by God&apos;s grace to be His own people. (I Cor. 1:2) Saints are those who are set apart for worship and praise.\r\n\r\nAnother word key to understanding the meaning of &quot;saints&quot; is &quot;sanctified.&quot;Saints are directly opposed to sin. Saints are those who allow holiness to become a reality in their lives. True righteousness is a phenomenon of the will. True righteousness always produces outward action and inward results. Every form of sin must be put out of the heart. As moral agents our intellect must disapprove of sin. By an act of the will, saints renounce ALL sin; by the miracle of God&apos;s grace, saints overcome ALL sin.\r\n\r\nNotice the italics in this clause. The Greek word translated &quot;called&quot; is interpreted to mean &quot;invited&quot; but it also could be used to express &quot;made, constituted.&quot; We could properly render this clause &quot;made saints.&quot;\r\n\r\n#### Grace to you and peace from God our Father, and the Lord Jesus Christ.\r\n\r\nThis is a common greeting of Paul in his epistles. The title &quot;Jesus Christ our Lord&quot; or &quot;Lord Jesus Christ&quot; is used ten times in Romans. Jesus is the personal name as Savior. Matt. 1:21. Christ is &quot;God&apos;s anointed one&quot; Lord denotes He is Lord of all things in heaven and earth (Acts 10:36). Jesus Christ our Lord is the Master of every situation!\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n<!-- Step #19 -->\r\n\r\n## Paul&apos;s Readiness (to Visit, Impart & Preach)\t 1:8-15\r\n\r\nVerses 8-15 express Paul&apos;s personal feelings for the Roman saints.\r\n\r\n### Paul is thankful for the faith of the Roman saints and so prays for them. Vs. 8,9\r\n\r\nThe whole world is in reference to the domain of the Roman Empire which often referred to itself as the whole world. It was Augustus who made the decree at the birth of Christ that the whole world should be taxed, which was in reference to the dominions of Rome.\r\n\r\nThe faith of the saints in Rome was spoken of throughout the entire Empire. These Roman Christians are the \"Beloved of God\", \"Called to be saints\", and recipients of the grace and peace \"from God our Father, and the Lord Jesus Christ. Their testimony bears out that they are separated unto God and represent the King of Glory. What a treasure a good testimony is! Paul stands on the battleground in prayer that their faith and testimony would continue.\r\n\r\n### He has a great desire to visit the Roman saints and impart spiritual gifts unto them because of his motive to see the church established. Vs. 10,11,12\r\n\r\nRome was strategic, but Paul is led by the Spirit and not statistics. It is probable that Paul realized the strategic value of building up the church in the capital city of the Roman Empire, but Paul was a caliber of minister that would invest as heavily in a city no one ever heard of. He was blessed to hear that there were saints in Rome and desired to visit them to do his part to strengthen the church there. \r\n\r\nIt is logical that a Revival in the city of Rome would have impact on the entire Empire, but the truth is, anywhere God manifests is power could potentially turn the world on his head.\r\n\r\n> Acts 17:6 And when they found them not, they drew Jason and certain brethren unto the rulers of the city, crying, These that have turned the world upside down are come hither also;\r\n\r\nPaul did not push others down to exalt himself a little higher, but he sought and worked for there to be MUTUAL faith, equal experience, in and with God. Paul knew that God had called him that others would follow in the same path of faith as their testimony grew. (Rom.1:6; I Cor. 3:21-23)\r\n\r\n<!-- Step #20-->\r\n\r\n### Paul had been hindered from going to Rome. Vs. 13,14,15\r\n\r\nWas \"let hitherto\"in v.13 means *to hinder* or *to prevent*. He had wanted to and even planned to go, but he had been hindered.\r\n\r\nPaul would one day go to Rome as a prisoner to stand before the Roman leaders and proclaim the Gospel of Jesus Christ to the Jews and the Gentiles. The book of Acts tells us that Paul dwelt two years in Rome; it is believed that he was under house arrest during this time of being in Rome. He would again return to Rome as a prisoner in AD 67 where he was beheaded under the persecution of Nero.\r\n\r\nPaul had great desire to preach the Gospel in Rome. He uses the word debtor in reference to himself to show that he is committed to preach to all men.- V. 14 (&quot;opheiletes&quot; obliged - transgress against God if he did not go.) He was a debtor to the sinner to tell him about Christ. To preach to all classes &mdash; Greeks; Barbarians&hellip;\r\n\r\n&quot;Greeks&quot; is used to refer to the wise Gentiles who have been educated in Greek culture and philosophy.\r\n\r\n&quot;Barbarians&quot; is used to refer to those outside of the Greek \tculture, that would not have been educated. It was usually applied to foreigners, who Paul also describes as being unwise referring to their lack of education. This phrase then has reference to the entire Gentile world.\r\n\r\nIt matters not Greek, Jew, Barbarian, wise, or unwise, Paul, is ready to preach to them. Paul was indebted to Greek and Jew, there was no difference because the Gospel makes no difference, but is for both the Greek and Jew.\r\n\r\n[SEE: http://www.biblebelievers.org.au/jew.htm (origin of the name JEW)]\r\n\r\nPaul proclaimed as much as in me is, I am ready to preach the gospel to you that are at Rome also.-V. 15 This means he was ready to go and preach with all that was within him; well knowing that he would face opposition to the Gospel message.\r\n\r\nPaul demonstrated the spirit of a True Prophet &mdash;Ambassador &mdash; Oracle-Messenger of God: &quot;I am ready to preach the gospel to you.&quot; We see Paul has a genuine pastor&apos;s heart, as well. (1:11-17; 9:1-3; 15:23-24)\r\n\r\nNOTE: \"ready <prothumos>\" means 'forward in spirit, predisposed; ready, willing.' Matthew 26:41; Mark 14:38\r\n","title":"01_101_pauls-introduction-to-book.md","course_id":"book-of-romans"}