{"pathToFile":"../book-of-romans/01_105_pauls-theme-of-book.md","fileName":"01_105_pauls-theme-of-book.md","type":".md","link":"https://githubusercontent.com/raw/book-of-romans/01_105_pauls-theme-of-book.md","id":66,"content":"## Paul&apos;s Theme: The Gospel\t\t\t1:16-17\r\n\r\nVerses 16 & 17 are the key verses of this epistle and are a summary of the epistle. \r\n\r\n> Romans 1:16-17&mdash;For I am not ashamed of the gospel of Christ: for it is the power of God unto salvation to every one that believeth; to the Jew first, and also to the Greek. For therein is the righteousness of God revealed from faith to faith: as it is written, The just shall live by faith. \r\n\r\n### The Gospel is the power of God unto Salvation.\r\n\r\n#### All who believe can be changed by the power of God.\r\n\r\nThe Scripture declares that the Gospel of Christ is to everyone that believes. Some falsely teach that God chooses only certain people to be saved. The Gospel is not for only a selected few, but for whosoever will come and drink of the waters of life. Whosoever believes in Jesus shall have everlasting life. &mdash; Jn. 3:16 All men have the ability of believing, but all men will not choose to believe in Jesus and accept the provision of redemption through His blood. \r\n\r\n#### Salvation is a work of God.\r\n\r\nMan can do nothing to save himself; he was born in sin with no human means of hope. Man could not be good enough to satisfy the law of God. He is guilty and condemned to hell. There is no price that man could pay to purchase his Salvation. Salvation is a work of God given by grace and received by faith in Jesus Christ. Many complicate the simplicity of the Gospel and cannot accept that sinful man can be made new and transformed by the power of God as he reaches out in faith to the nail scarred hands of Jesus.\r\n\r\n#### It is essential to preach the Word of God.\r\n\r\nPaul is ready to preach to whosoever unashamed because he knows beyond all doubt that the GOSPEL OF CHRIST is the POWER of God unto salvation to the Jew first and also to the Greek. There is salvation by no other, but in that holy name, Jesus. (Acts 4:12) Paul&apos;s last message to Timothy was: PREACH THE WORD. There is life in the Word. It is the truth of the Word that will make men free.\r\n\r\n### The Gospel reveals the righteousness of God from faith to faith.\r\n\r\n#### Righteousness comes from God.\r\n\r\n##### Man has no righteousness of his own.\r\n\r\nIsaiah 64:6&mdash;But we are all as an unclean thing, and all our righteousnesses are as filthy rags; and we all do fade as a leaf; and our iniquities, like the wind, have taken us away.\r\n\r\n##### The righteousness of Christ is put to the account of the \tsinner.\r\n\r\nThis is what is meant by imputed righteousness. Impute is a KJV word that means to set to the account of. ILLUSTRATION: A man who has no money in the bank needs someone else to put money into his account. And the scripture was fulfilled which saith, Abraham believed God, and it was imputed unto him for righteousness:-James 2:23 Abraham had the righteousness of God put to his account. (Rom. 4:3) God views the repentant through the blood of Christ.\r\n\r\n##### Righteousness is received by faith at Salvation.\r\n\r\nThere is a difference between imputed righteousness and imparted righteousness. To impart means to put into. God places His righteousness in man at Salvation. There is a change of nature that accompanies the new birth.\r\n\r\n> Philippians 3:9&mdash;And be found in him, not having mine own righteousness, which is of the law, but that which is through the faith of Christ, the righteousness which is of God by faith:\r\n\r\n#### From faith to faith indicates a progression of faith to receive more revelation of the righteousness of God.\r\n\r\nThe expression from faith to faith is referring to an increase of faith; showing growth from the initial faith of salvation to a greater faith in God that comes with Christian growth. The Scripture tells us that every man is given the measure of faith. &mdash; Rom. 12:3. All men have the ability to believe, yet all do not exercise their faith to believe in Jesus Christ. The apostles asked the Lord to increase their faith. - Lk. 17:5. Faith is increased as it is put into practice. With Christian maturity comes an increase in faith. The righteousness of God is revealed from faith to faith through the Gospel.\r\n\r\n#### The Righteousness of God is progressive in the life of Christians. \r\n\r\nThe revelation of God&apos;s character and nature is not something apart and separate from the Gospel, but is bound up in the Gospel that we as hearers may LIVE. This life and righteousness is not received all at once, but is revealed to us from faith to faith. As we obey and do as we have received, God gives us more and this continual progression in righteousness is the path of life of the JUST. The key to maintaining our experience with God is progression. Paul declares in Hebrews 6:1, &quot;Let us go on.&quot;\r\n\r\n> II Corinthians 5:21&mdash;For he hath made him to be sin for us, who knew no sin; that we might be made the righteousness of God in him.\r\n\r\n### The just shall live by faith.\r\n\r\n#### Paul builds the theme of the epistle on the foundation of Scripture.\r\n\r\n\"As it is written\" is in reference to Habakkuk 2:4 from where this statement is quoted. \r\n\r\n#### The just are those who have been justified by God through faith.\r\n\r\nThe just refers to those who have been set in a right relationship with God through the atonement provided by Jesus Christ. Those who are saved are the just or those who have been justified.\r\n\r\nHabakkuk contrasted the Chaldean whose trust is in himself and will fall because of it with the just who \"supports himself, by a firm expectation of the deliverance of Zion\" (quote John Wesley) and will be saved in the end.\r\n\r\n#### There must be a continuance of faith in order to continue living the Christian life.\r\n\r\n#### The Christian is kept by the power of God.\r\n\r\nThe just remain so by the keeping power of God. In this world of sin, the Christian needs the preserving power of God to keep him on the straightway that leads unto life. Jesus said that no man could pluck the sheep out of His hand.- Jn.10:28 This does not mean that God ever takes away the choice of man. Christians must choose to serve God, to live is an everyday experience (The just shall live) that requires a continual receiving of God&apos;s power by faith.\r\n\r\n#### The path of the just leads to full maturity in Christ.\r\n\r\n> Proverbs 4:18&mdash;But the path of the just is as the shining light, that shineth more and more unto the perfect day.\r\n> Psalms 119:105&mdash;Thy word is a lamp unto my feet, and a light unto my path.\r\n\r\nLight represents truth which guides the Christian on his journey. The further we walk on the path the more truth that is received. God reveals more truth as we obey the truth that has already been received. The life of the just is to continue by faith to mature in Christ and receive the fullness of our inheritance as believers. \r\n\r\n#### The Christian lives his life by faith in Christ.\r\n\r\n> Galatians 2:20&mdash;I am crucified with Christ: nevertheless I live; yet not I, but Christ liveth in me: and the life which I now live in the flesh I live by the faith of the Son of God, who loved me, and gave himself for me.\r\n","title":"01_105_pauls-theme-of-book.md","course_id":"book-of-romans"}