{"pathToFile":"../book-of-romans/01_304_true-purpose-of-the-law.md","fileName":"01_304_true-purpose-of-the-law.md","type":".md","link":"https://githubusercontent.com/raw/book-of-romans/01_304_true-purpose-of-the-law.md","id":73,"content":"# The True Purpose of the Law (vs. 20-30)\r\n\r\n> ROMANS 3: *Justification is by faith without the deeds of the Law. The Law is: an advantage to those who know it (vs. 1-2), absolute in its nature (vs. 3-8), unbending in its authority (vs. 9-19), has a distinct purpose (vs. 20-30), and is not made void, but rather is established\tby our faith. (v. 31).*\r\n\r\n<!-- -->\r\n\r\n## The Law Has Never Justified Anyone vs. 20\r\n\r\n> Romans 3:20 Therefore by the deeds of the law there shall no flesh be justified in his sight: for by the law is the knowledge of sin.\r\n\r\nThe law is accusatory by nature against all mankind.The true purpose of the law is not to justify, but is to bring the knowledge of sin. Alone, the Law cannot produce salvation or righteousness in the eyes of God. Salvation is by grace through faith in Christ Jesus. \r\n\r\n### By the Deeds of the Law there shall no Flesh be Justified\r\n\r\n- flesh: the body (as opposed to the soul (or spirit)), the symbol of what is external, or human nature with its frailties (physically or morally),carnal\r\n\r\n### How important is the knowledge of sin?\r\n\r\n\r\n\r\n## The righteousness of God is manifested to men. &mdash; Vs. 21-23\r\n\r\n### To manifest is to show forth or to declare.\r\n\r\n> Romans 3:21 But now the righteousness of God without the law is manifested, being witnessed by the law and the prophets;\r\n\r\n### Declared Righteous\r\n\t\r\nThe meaning of \"justify\" is to declare righteous. To be justified is to be placed in a right relationship with God. Paul is telling men how they can be justified or declared righteous &mdash; through Jesus Christ. \r\n\r\n- justification: to render (show or regard as) just or innocent:--free, be righteous. \r\n\r\n&quot;Most important, justification does not mean that God makes us righteous, but that He declares us righteous. Justification is a legal matter. God puts the righteousness of Christ on our record in the place of our own sinfulness.&quot; - Wiersbe, W. W. (1996). The Bible Exposition Commentary\r\n\r\nYet, salvation is not complete in this statement. For, In God's declaration of justification, He by giving us His righteousness has made us righteous.\r\n\r\n> Romans 5:19 For as by one man's disobedience many were made sinners, so by the obedience of one shall many be made righteous.\r\n\r\n### Righteousness refers to moral purity.\r\n\r\nIt simply means to be right which is the opposite of being wrong. Sin is wrong and God is right. Applied to God it refers to the perfection or holiness of his nature; God is always right. The words righteousness and justify are closely related and are derived from the same Gk. root dika. Justify-dikaio, righteousness-dikaiosune\r\n\r\n### This righteousness is from God.\r\n\t\r\nThis is not earned righteousness or even righteous works. Justification is the righteousness of God put to the account of a man; that is God counting him righteous solely due to the righteousness of Christ. This passage is showing man the source of righteousness which only comes from God. \r\n\r\n## God&apos;s method of Justification &mdash; V. 24\r\n### Given by the Grace of God\t\r\n\r\nSinful man does not deserve to be justified. Man deserves to die because of sin. God freely justifies those who receive the provision of Christ by faith. Salvation is a gift of God to those who receive the provision of Christ by faith. \r\n### Through the Redemption in Christ Jesus \r\n\t\r\nRedemption means to purchase, to set free by the payment of a ransom. Jesus paid the price for our Salvation in His blood. Man is declared righteous solely on the merit of Jesus Christ.\r\n\r\n## The demands of the law have been satisfied. &mdash; V. 25 \r\n### God still requires justice. \r\n\r\nJustification is not merely God showing pity on the sinner and letting him go free without the penalty being paid. The word propitiation is used in reference to Christ satisfying the demands of the law. Propitiation is a reason for not executing judgment which is deserved. It corresponds to the Hebrew word rendered mercy seat which was the place the blood of atonement was sprinkled to satisfy the judgment of God. This sprinkled blood covered the Tables of the Law contained in the Ark. This is a figure of Him who was to come and shed Divine blood to satisfy the law. The blood of Jesus is the reason that judgment is not executed on the repentant sinner.\r\n\r\n### PROPITIATION.\r\n\r\nPropitiation properly signifies the removal of wrath by the offering of a gift. In the OT it is expressed by the verb kipper (ATONEMENT). The objection to propitiation arises largely from an objection to the whole idea of the wrath of God, which many exponents of this view relegate to the status of an archaism. They feel that modern men cannot hold such an idea. But the men of the OT had no such inhibitions. For them 'God is angry with the wicked every day&apos;s (Ps. 7:11, AV). They had no doubt that sin inevitably arouses the strongest reaction from God. He is vigorously opposed to evil in every shape and form while he may be 'slow to anger&apos;s. - New Bible Dictionary \r\n\r\n> Romans 3:25&mdash;Whom God hath set forth to be a propitiation through faith in his blood, to declare his righteousness for the remission of sins that are past, through the forbearance of God;\r\n> \r\n### Let us look at the phrase for the remission of sins that are past.\r\n\t\r\nIn the Old Testament period, the blood of animals could never take away sin. - Heb. 10:4 The blood of animals, a shadow of the blood of Christ, was only temporary until the time when Jesus would come and offer Himself as the supreme sacrifice for sin. The literal translation of this phrase is: &quot;God had passed over the sins that were past.&quot; This He did knowing that Jesus would come and pay the price in full upon the cross. The blood of animals was like a credit until the price could be paid. No man was ever saved by the blood of an animal; all men have only been saved by the blood of Jesus both OT and NT.\r\n\r\n## A man is justified by faith without the deeds of the law.- V. 28\r\n\r\n### Faith is the requirement to receive from God.\r\n\r\nFaith and Righteousness - Go hand in hand If you see a man with righteousness, you see a man with faith. . NOTE Faith apart from righteousness is not scriptural. Righteousness - is absolutely essential. Mark 11:22 Righteousness: Ability to think and act like God. There are 2 kinds of Righteousness: 1. Imputed - Act of Grace (God reckons to our account) 2. Imparted - Grace to give or share. 1:17 - &quot;For therein is the righteousness of God revealed from faith to faith.&quot; Steps:\tI Cor. 1:30 There are degrees of faith. We are changed from belief to belief, faith to faith, glory to glory.&quot;Metron&quot; - Greek - Measure of faith, degree, portion. Measure of Faith: Saving faith. If you have Christ you have faith in your heart\r\n\r\n### Works of the law cannot secure justification.\r\n\r\n","title":"01_304_true-purpose-of-the-law.md","course_id":"book-of-romans"}