{"pathToFile":"../book-of-romans/01_700_introduction-to-romans-7.md","fileName":"01_700_introduction-to-romans-7.md","type":".md","link":"https://githubusercontent.com/raw/book-of-romans/01_700_introduction-to-romans-7.md","id":79,"content":"# The Law Reigns over the Man Living in Sin &mdash; Romans 7\r\n\r\n## Introduction\r\n\r\n### Theme: The Law Reigns Over the Man Living in Sin\r\n\r\nThe law with his prescription of condemnation has dominion over the man living in his sin. Righteousness in life is impossible through the works of the law as the sinner is bound to his sin. Romans chapter seven deals with Carnality and the sinners relationship (so long as he lives) to sin and death. This chapter also emphasizes that the Law of God is holy.\r\n\r\n### Division: Three Sections:\r\n\r\n#### Verses 1 &mdash; 6: Died that You May be Married to Another\r\n\r\nIn the first section, God shows how those that were placed by Him under the law were released from that relation by sharing in the death of Christ; so that, joined to a risen Christ, they bear fruit; and released from law, they are glad and willing to serve Him.\r\n\r\nThe Apostle Paul reminds his Jewish brethren that the power of the law is terminated, and uses the illustration of a wife who has been freed by the death of her husband to marry another. The main thought is death dissolves legal obligation and that on the death of her husband a wife is legally free to contract another marriage.\r\n\r\n> Romans 7:1&mdash;Know ye not, brethren, (for I speak to them that know the law) how that the law hath dominion over a man as long as he liveth?\r\n\r\n#### Verses 7- 13: The Law is Holy, And Just and Good\r\n\r\nPaul explains that sin&apos;s dominion is not that the fault of the Law of God. The law is good, but sin took advantage of him.\r\n\r\n> Romans 7:12&mdash;Wherefore the law is holy, and the commandment holy, and just, and good.\r\n\r\n#### Verses 14 &mdash; 25: Paul&apos;s Captivity to the Law of Sin\r\n\r\nIn the final section, we have Paul testifying of his struggle under the law as an Israelite, before he experienced the great truth that in Christ he was dead to the law and to sin.\r\n\r\n> Romans 7:24&mdash;O wretched man that I am! who shall deliver me from the body of this death?\r\n","title":"01_700_introduction-to-romans-7.md","course_id":"book-of-romans"}