{"pathToFile":"../book-of-romans/03_1501_chapter-15.md","fileName":"03_1501_chapter-15.md","type":".md","link":"https://githubusercontent.com/raw/book-of-romans/03_1501_chapter-15.md","id":98,"content":"# Laboring for Unity &mdash; Ch. 15\r\n\r\n## Introduction\r\n\r\nBelievers are to receive one another, as Christ received the Gentiles - to God's glory. The first section of this chapter describes Christian relationships, with Christ as the perfect example of them. Paul's personal message to the Romans begins in Verse 14. Paul's ministry was to both those who were within (the Jews, those to whom were given the oracles of God) and to those who were without (the Gentiles).\r\n\r\nThe Work of Unity in the Body of Christ is the work of God.\r\n\r\n## We are to Labor in Receiving Another with Christ as Our Example, vs. 1-12\r\n\r\n> 1 We then that are strong ought to bear the infirmities of the weak, and not to please ourselves. 2 Let every one of us please his neighbour for his good to edification. 3 For even Christ pleased not himself; but, as it is written, The reproaches of them that reproached thee fell on me. 4 For whatsoever things were written aforetime were written for our learning, that we through patience and comfort of the scriptures might have hope. 5 Now the God of patience and consolation grant you to be likeminded one toward another according to Christ Jesus: 6 That ye may with one mind and one mouth glorify God, even the Father of our Lord Jesus Christ. 7 Wherefore receive ye one another, as Christ also received us to the glory of God. 8 Now I say that Jesus Christ was a minister of the circumcision for the truth of God, to confirm the promises made unto the fathers: 9 And that the Gentiles might glorify God for his mercy; as it is written, For this cause I will confess to thee among the Gentiles, and sing unto thy name. 10 And again he saith, Rejoice, ye Gentiles, with his people. 11 And again, Praise the Lord, all ye Gentiles; and laud him, all ye people. 12 And again, Esaias saith, There shall be a root of Jesse, and he that shall rise to reign over the Gentiles; in him shall the Gentiles trust.\r\n\r\n### There Are Some Differences (historical background)\r\n\r\nThere are many cultural and religious differences between the Jews and Gentiles and with the opening of the Gospel to the Gentiles there were alot of hurdles to overcome. Paul admonishes the church adamantly, that we are to labor to receive the Gentiles as God has already received them. The high standard and rule by which our conduct is measured is \"as Christ also received us to the glory of God. (vs. 7)\".\r\n\r\nBeing predominately Jewish, the early churches would feel \"very Jewish\" (a mixture of culture and conviction). There was an early expulsion from Rome of all Jews and it is only natural the cultural shift that took place in the Roman churches. Eventually, Jews began to return back to the city of Rome finding things different than when they had left. In order to not become divided, the early church had to labor together in overcoming their cultural differences by learning what things were \"most needful\". \r\n\r\n> Acts 15:28&mdash;For it seemed good to the Holy Ghost, and to us, to lay upon you no greater burden than these necessary things; [necessity]\r\n<!-- -->\r\n> Ephesians 4:3, 13&mdash; Endeavouring to keep the unity of the Spirit in the bond of peace. &hellip; 13 Till we all come in the unity of the faith, &hellip;\r\n\r\n### There Are Universal Principles\r\n\r\n#### Christians are Called to Unselfish Living, vs. 1,2\r\n\r\nPut Verse 1 & 2 into your own words. Compare with Chapter 14, Verse 19.\r\n\r\nRomans chapter fifteen talks about living an unselfish life. Those that are strong are to help the weak. We are to not live to please ourselves but to please God, to put others before us. This chapter ends with Paul&apos;s missionary journeys.\r\n\r\nThe fifteenth chapter of Romans has a strong feeling of conclusion. As is Paul&apos;s style in this book, he repeats concepts already presented but more directly and personally. He prescribes the following instructions to his readers:\r\n\r\n- The Strong ought to bear the infirmities of the weak.\r\n- Please our neighbor to their good and edification.\r\n- Bearing toward another the mind of Christ. That ye may with ONE mind and ONE mouth glorify God.\r\n- Jesus is a minister to the Jew and Gentile.\r\n- The Gentiles have reason to rejoice and are commanded to do so in the Scripture.\r\n\r\n#### Christ is the Christian's Example for Living, vs. 3\r\n\r\nWhy should the Christian be concerned with others instead of himself?\r\n\r\nVerse 3:\t\tWe should use Christ as our example \"For even Christ pleased not himself, His concern was for others demonstrated by his love, His teaching, and His healing.\"\r\n\r\n#### The Word of God is the Christian's Source of Encouragement for Living, vs. 4\r\n\r\nHow can the Scripture be a source of encouragement for leading the Christian life?\r\n\r\nVerse 4:\t\tNote these 4 words - learning, patience, comfort, and hope.\r\n\r\nWe can be comforted in time of need by reading the Scriptures. We can also look forward in Hope.\r\n\r\n#### Unity in the Body of Christ is the Goal Toward Which Christians Move, vs. 5,6\r\n\r\nVerses 5 - 6:\tWe should be united in one mind and spirit glorifying God who is our goal in life.\r\n\r\n#### Christ is the Standard by Which Christians Will be Judged, v. 7\r\n\r\nHow are we to welcome and receive fellow Christians?\r\n\r\nVerse 7:\t\t\"Receive ye one another as Christ also received us.\"\r\n\r\n#### God Keeps His Word and God is Merciful, vs.8-12\r\n\r\nWhat was the purpose of Christ's work?\r\n\r\nVerse 8: To comfirm the promises made unto the Fathers\r\n\r\nWhat people were affected?\r\n\r\nVerses 8 - 9:\tJews and Gentiles\r\n\r\nHow do the Old Testament quotations in Verses 9 - 12 substantiate the purpose for Christ's work?\r\n\r\nChrist was fulfillment of prophecy.\r\n\r\n## We are to Labor in Reaching those Who Are Without, vs. 13-21\r\n\r\n### You are My Brethren and Filled With Many Good Things ..., vs. 13-14\r\n\r\n> Romans 15:13-14 &mdash; Now the God of hope fill you with all joy and peace in believing, that ye may abound in hope, through the power of the Holy Ghost. 14 And I myself also am persuaded of you, my brethren, that ye also are full of goodness, filled with all knowledge, able also to admonish one another. \r\n\r\nWhat was Paul's Opinion concerning the Christians at Rome?\r\n\r\n- Paul believes God is going to cause them to Abound in Hope and Power, vs. 13\r\n- Full of goodness.\r\n- Filled with all knowledge.\r\n- Able to admonish one another.\r\n\r\nAlthough Paul had never been in Rome, he was aware and encouraged by their faith.\r\n\r\n>  Romans 1:8 &mdash; First, I thank my God through Jesus Christ for you all, that your faith is spoken of throughout the whole world.\r\n\r\n### ... Nevertheless, vs. 15-21\r\n\r\nThere are alot of encouraging things Paul can say and has said (Romans 1:8), but we all have something to learn. \r\n\r\n#### I Have Written Boldly, vs. 15\r\n\r\n> Romans 15:15&mdash;Nevertheless, brethren, I have written the more boldly unto you in some sort, as putting you in mind, because of the grace that is given to me of God, \r\n\r\n&mdash; daringly; with more confidence\r\n\r\nAt the risk of sounding unappreciative of their example and faith, Paul as a faithful minister of the Gospel challenges the church boldly with necessary things.\r\n\r\n#### I Have a Call and Responsibility, vs. 16a\r\n\r\n> Romans 15:16a &mdash; That I should be the minister of Jesus Christ to the Gentiles, ministering the gospel of God, &hellip;\r\n\r\nWhat does Paul refer to himself as? A minister of Jesus Christ to the Gentiles. Preaching the Word in the power of the Spirit. With signs and wonders as the result. Paul's identity is wrapped up in His call.\r\n\r\n**GOD HAS SHOWN ME** ... !\r\n\r\n> Acts 10:28  And he said unto them, Ye know how that it is an unlawful thing for a man that is a Jew to keep company, or come unto one of another nation; but God hath shewed me that **I should not call any man common or unclean.**\r\n\r\nPaul Prioritizes his call and must delay personal desires and goals. It is not that he does not have a burden for his brethren, but that he has a call that takes precedent.\r\n\r\n#### I Have a Goal (The Offering Up of the Gentiles), v. 16b\r\n\r\n> Romans 15:16b &mdash;&hellip;that the offering up of the Gentiles might be acceptable, being sanctified by the Holy Ghost.\r\n\r\n- Purposeful Ministry\r\n- Offering Up -- a sacrifice, offering unto God, both Paul's Service and the Gentile's Worship (and see to it that the Jewish Christians do not hinder that)\r\n\r\n> Colossians 3:17&mdash;And whatsoever ye do in word or deed, do all in the name of the Lord Jesus, giving thanks to God and the Father by him.\r\n\r\n#### I Have an Audience (God has Given Them to Me!), vs. 17-21\r\n\r\n> 17 I have therefore whereof I may glory through Jesus Christ in those things which pertain to God. 18 For I will not dare to speak of any of those things which Christ hath not wrought by me, to make the Gentiles obedient, by word and deed, 19 Through mighty signs and wonders, by the power of the Spirit of God; so that from Jerusalem, and round about unto Illyricum, I have fully preached the gospel of Christ. 20 Yea, so have I strived to preach the gospel, not where Christ was named, lest I should build upon another man's foundation: 21 But as it is written, To whom he was not spoken of, they shall see: and they that have not heard shall understand.\r\n\r\n- As boldly as Paul is speaking, he is careful not to speak but of that which Christ has wrought by him\r\n\t- God has Used me mightily, but not all that God has done in this arena has he done using me. \r\n\t- I'm not the only minister to the Gentiles.\r\n\t- Careful: Allow those Healed to Testify\r\n\t- Careful so as not to Hinder what God is doing elsewhere - Paul did not wish to build on another man's foundation (work).\r\n\t- Here laborers have hindered.\r\n\r\n- I Have a Message for Those Who Have Not Heard (God has promised it! vs. 21)\r\n\r\n> Isaiah 52:15&mdash;So shall he sprinkle many nations; the kings shall shut their mouths at him: for that which had not been told them shall they see; and that which they had not heard shall they consider. \r\n<!-- -->\r\n> Isaiah 65:1&mdash;I am sought of them that asked not for me; I am found of them that sought me not: I said, Behold me, behold me, unto a nation that was not called by my name.\r\n\r\n## We are to Labor in Reaching those Who Are Within, v. 22-33\r\n\r\n 30 Now I beseech you, brethren, for the Lord Jesus Christ's sake, and for the love of the Spirit, that ye strive together with me in your prayers to God for me; 31 That I may be delivered from them that do not believe in Judaea; and that my service which I have for Jerusalem may be accepted of the saints; 32 That I may come unto you with joy by the will of God, and may with you be refreshed. 33 Now the God of peace be with you all. Amen.\r\n\r\n### It is not for Lack of Love, but for a Great Cause I have Been Hindered, vs. 22-24\r\n\r\n> Romans 15:22-24&mdash;For which cause also I have been much hindered from coming to you. 23 But now having no more place in these parts, and having a great desire these many years to come unto you; 24 Whensoever I take my journey into Spain, I will come to you: for I trust to see you in my journey, and to be brought on my way thitherward by you, if first I be somewhat filled with your company.\r\n\r\nThese many times - show how continually Roman Christians were on his mind and his desire.\r\n\r\nA longing to come - He had a tremendous desire to visit these people.\r\n\r\nNow having exhausted room for his ministry at that time (to those who have not heard), how would the Roman Church now Receive Paul after his great delay in visiting?\r\n\r\n### Paul's Itinerary, vs. 25-28\r\n\r\n25 But now I go unto Jerusalem to minister unto the saints. 26 For it hath pleased them of Macedonia and Achaia to make a certain contribution for the poor saints which are at Jerusalem. 27 It hath pleased them verily; and their debtors they are. For if the Gentiles have been made partakers of their spiritual things, their duty is also to minister unto them in carnal things. 28 When therefore I have performed this, and have sealed to them this fruit, I will come by you into Spain. 29 And I am sure that, when I come unto you, I shall come in the fulness of the blessing of the gospel of Christ. \r\n\r\nPaul restates again his desire and intention to visit the church at Rome and his itinerary. He must first go to Spain and collect an offering for the saints at Jerusalem. He would then bring the offering to Jerusalem, after which he intends to visit Roman.\r\n\r\nHow are the Christians in Macedonia and Achaia concerned for the poor among the Christians at Jerusalem? They contributed to the poor. Paul himself together with other brethren took this offering back to Jerusalem, to deliver in person\r\n\r\nWhat spiritual principal is Paul teaching the Romans by relating this news? It was an act of love on the part of the Gentile Saints. It was a fulfilling of our Lord's words:\r\n\r\n- John 13:17 \"If ye know these things, blessed are ye if ye do them.\" \r\n- John 13:35 By this shall all men know that ye are my disciples if ye have love one to another.\r\n\r\n## Conclusion\r\n\r\n### The Unity of the Trinity\r\n\r\nIn Verse 30 we once again see the trinity:\r\n\t- For the Lord Jesus Christ's sake.\r\n\t- For the Love of the Spirit.\r\n\t- Your prayers to God for me.\r\n\r\n### The Benediction, vs. 33\r\n\r\n> Romans 15:33&mdash; Now the God of peace be with you all. Amen.\r\n\r\nThe beautiful benediction of Verse 33, \"The God of peace be with you all,\" shows how fully at peace was the apostle's heart, and how fully in God's will! Also his overflowing love for the Saints. (Twice in this chapter Paul PRAYS for the church at Rome. vs. 13, 33)\r\n\r\nThe motive and power behind Christian unity is Christ's example of love and service and sacrifice. To have such harmony among Christians, we need to pray as Paul did for the Lord's enabling. Paul's sense of commission did not make him independent of his fellow Christians.\r\n","title":"03_1501_chapter-15.md","course_id":"book-of-romans"}