{
	"id":"sgrjr",
	"type":"course",
	"blocks":[
		{"type":"md","value":"# The Ministry of John - Making Jesus Known\n\n- John 1:1-51, 6-7\n- John:  the grace or mercy of Jehovah\n- The circumstances of his birth.\n\nHis birth foretold to barren parents and given a name and called before being born! It was to his mother Elizabeth (6 mos with John) that Mary ran to with her own news:\n\n> Luke 1:39 And Mary arose in those days, and went into the hill country with haste, into a city of Juda;\n\n- Raised by his priestly father Zechariah, most assuredly to be a priest.\n- As he moves independence he lives a rugged life (camels hair, locusts and wild honey) in the wilderness preaching the Gospel of Jesus\n- John even spoke out against Herod who married his brother's wife which eventually led to John's death.\n\n> John 1:6 There was a man sent from God, whose name was John. 7 The same came for a witness, to bear witness of the Light, that all men through him might believe. 8 He was not that Light, but was sent to bear witness of that Light.\n\n> John 1:15 ¶ John bare witness of him, and cried, saying, This was he of whom I spake, He that cometh after me is preferred before me: for he was before me. 16 And of his fulness have all we received, and grace for grace. 17 For the law was given by Moses, but grace and truth came by Jesus Christ.\n \n> John 1:23 &mdash; He said, I am the voice of one crying in the wilderness, Make straight the way of the Lord, as said the prophet Esaias.\n\n> John 1:26 &mdash; John answered them, saying, I baptize with water: but there standeth one among you, whom ye know not;\n\n## A CLEAR VOICE AND MESSAGE\n\n- I am not the LIGHT\n- I am a Witness to that LIGHT\n- v.15 HE is preferred before me (v.27 whose shoe's latchet I am not worthy to unloose.)\n- He was before me\n- Grace and Truth came by Jesus Christ\n- No man hath seen God at any time; the only begotten Son, which is in the bosom of the Father, he hath declared him\n- Who art thou? \"I am not the Christ.\" \"I am not Elias\" \n- I am the voice of one crying in the wilderness, Make straight the way of the Lord\n- v.25 \"Why baptizest thou then if thou be not that Christ, nor Elias, neither that prophet?\"\n- I Baptize with water ( v.28 These things were done in Bethabara beyond Jordan, where John was baptizing.) v.31\n\nI should be publicly baptizing so that when I Baptize the Christ, He should be SEEN AND KNOWN for who He is!\n\nWho John was NOT, I am not:\n- That LIGHT\n- The Christ\n- Elias\n\n- Whom YE Know not and Whom I know not.(v.26 & 33)\n\n> Adam Clarke: John 1:31 John did not know our Lord personally, and perhaps had never seen him, at the time he spoke the words in Joh 1:15. Nor is it any wonder that the Baptist should have been unacquainted with Christ, as he had spent thirty years in the hill country of Hebron, and our Lord remained in a state of great privacy in the obscure city of Nazareth, in the extreme borders of Galilee. (81+ miles)\n\nJohn sees Jesus, RECOGNIZES Him!\n\n- \"And I knew him not, BUT that He sent me to baptize with water and upon whom thou shalt see the Spirit descending, and remaining on him, the same is he which baptizeth with the Holy Ghost.\" (Mr 1:8)\n\n> John 1:29 ¶ The next day John seeth Jesus coming unto him, and saith, Behold the Lamb of God, which taketh away the sin of the world. (This is He!)\n\n> John 1:31 And I knew him not: but that he should be made manifest to Israel, therefore am I come baptizing with water.\n\n- Matthew 3:13-17\n- I bare record that this is the Son of God. v.34\n\nTimeline:\n\nDay 1: John is Questioned by Jews\nDay 2: Behold the Lamb of God, This is the Son of God\nDay 3: Behold the Lamb of God (2 disciples, Andrew and John?)\n\n- BEHOLD: John directed his disciples attention TO JESUS! Both as LAMB and TEACHER (the complete teacher)\n\n> John 1:37 &mdash; And the two disciples heard him speak, and they followed Jesus.\n\n- Has Christ been clearly pointed out to you? HAVE YOU FOLLOWED HIM!\n\n> Joh 1:38 Then Jesus turned, and saw them following, and saith unto them, What seek ye? They said unto him, Rabbi, (which is to say, being interpreted, Master,) where dwellest thou?\n\n- What Seek Ye?\n- Rabbi, where Dwellest thou?\n\n(REVIVAL is in the air! Andrew, John, Peter, Philip, Nathanael)\n\n- Andrew and John spend with night with Jesus\n- Andrew finds his brother Sime Peter \"We have found the Messias, which is, being interpreted, the Christ.\"\n\n> John 1:42 And he brought him to Jesus. And when Jesus beheld him, he said, Thou art Simon the son of Jona: thou shalt be called Cephas, which is by interpretation, A stone.\n\n- NEXT DAY: Jesus finds Philip \"follow me\" (was of the same city as Andrew and Peter)\n- Philip finds Nathanael \"We have found Him\" v.45\n\n> John 1:46 And Nathanael said unto him, Can there any good thing come out of Nazareth? Philip saith unto him, Come and see. 47 Jesus saw Nathanael coming to him, and saith of him, Behold an Israelite indeed, in whom is no guile! 48 Nathanael saith unto him, Whence knowest thou me? Jesus answered and said unto him, Before that Philip called thee, when thou wast under the fig tree, I saw thee.\n \n- Nathanael answered and saith unto him, Rabbi, thou art the Son of God; thou art the King of Israel.\n\n## Application\n\n- What about ME displays Jesus?\n\n> Galatians 2:20 &mdash; I am crucified with Christ: nevertheless I live; yet not I, but Christ liveth in me: and the life which I now live in the flesh I live by the faith of the Son of God, who loved me, and gave himself for me.\n\n> Colossians 1:27 &mdash; To whom God would make known what is the riches of the glory of this mystery among the Gentiles; which is Christ in you, the hope of glory:\n\n> Matthew 10:32 &mdash; Whosoever therefore shall confess me before men, him will I confess also before my Father which is in heaven. 33 But whosoever shall deny me before men, him will I also deny before my Father which is in heaven.\n",
		"lesson":1},
		{"type":"LINK_MD", "value":"courses/sermon-outlines/stephen-reynolds-jr/20210523A_the-lord-will-see-to-it/20210523A_the-lord-will-see-to-it.md", "lesson":2}
		

	]
}