[{"type":"md","value":"Key Texts:\n- Revelation 19\n- Philippians 3:10\n- Psalm 45\n- Zephaniah 1:14\n- Revelation 12:15","lesson":13},{"type":"md","value":"<div id=\"R\"/>\n\n# R. The Marriage and Marriage Feast of the Lamb [19]\n\n# Three Revelations of Who God Is\n\nTEXT: Revelation 19\n\n## Introduction\n\n### That I May Know Him\n\n> Philippians 3:10&mdash;**That I may know him**, and the power of his resurrection, and the fellowship of his sufferings, being made conformable unto his death;\n\nFrom behind the veil of the human condition, it is difficult to get a clear picture of God. We describe with limited vocabulary and understand him through limited experiences. \n\nMan often weighs in one hand, what the Bible says about God and then in the other hand weighs what we have experienced in this life. This method of \"getting to know God\" is faulty at best and has resulted in multitudes of skewed impressions of Who God is and what He is like.\n\n- Is He Angry?\n- Is he Love?\n- Is FULL of mercy?\n- Does he hate me?\n- Will he receive me?\n\nIt is not God's fault humanity does not truly KNOW Him. It is the fault of our limited perspective. It will not be until \"by-and-by\" that even the most faithful of God's people will see and understand Him in His fullness. But, until then, it is a journey of faith that brings us closer and closer to God. \n\nWill I believe God is Who He says He is? Will I take Him at His Word? Will I pattern my life on the foundation of a faith that says, \"God is True and Faithful?\"\n\nToday that faith is developed and tested, but one day it will be rewarded!\n\nBlinded very young, hymn-writer Francis Jane Crosby (1820-1915) began writing poetry as young girl. At the age of eight she wrote these words: \n\n<blockquote class=\"quote\">Oh, what a happy soul am I! Although I cannot see,<br/> I am resolved that in this world, contented I will be.<br/> How many blessings I enjoy that other people don&apos;t;<br/> To weep and sigh because I am blind, I cannot, and I won&apos;t.</blockquote>\n\nOnce a well-intentioned Scottish minister remarked to her: &quot;I think it is a great pity that the master, when He showed so many gifts upon you, did not give you sight.&quot; She responded, &quot;Do you know that if at birth I had been able to make one petition to my Creator, it would have been that I should be born blind?&quot;\n&quot;Why?&quot; asked the surprised minister.\n&quot;Because, when I get to heaven, the first face that shall ever gladden my sight will be that of my Savior.&quot;\n\nIn her hymn \"My Savior First of All\", she wrote&hellip;\n\n<blockquote class=\"quote\">When my lifework is ended and I cross the swelling tide, \nWhen the bright and glorious morning I shall see; I shall know my Redeemer when I reach the other side, And His smile will be the first to welcome me. <br/> I shall know Him, I shall know Him, And redeemed by His side I shall stand; I shall know Him, I shall know Him By the print of the nails in His hand.</blockquote>\n\n>2 Timothy 4:7-8&mdash;I have fought a good fight, I have finished my course, I have kept the faith: Henceforth there is laid up for me a crown of righteousness, which the Lord, the righteous judge, shall give me at that day: and not to me only, but unto all them also that **love his appearing**. [manifestation, (especially) the second coming of Christ]\n\nGod is infinite and our understanding of him is constantly developing.\n\nIn Revelation chapter 19 we are given three different scenes that illuminate different aspects of God's nature. Herein are three revelations of Who God is:\n\n- <a href=\"#first\">The Lord Our God Omnipotent who Reigns (vs. 1-6)</a>\n- <a href=\"#second\">The Bridegroom Who Will be Wed (vs. 7-10)</a>\n- <a href=\"#third\">The Lion Who will Return in Judgment (vs. 11-21)</a>\n","lesson":13},{"type":"md","value":"\n## The Lord Our God Omnipotent who Reigns (vs. 1-6)\n\n### He Gave Us a Voice for Singing\n\n- Much People\n> Revelation 19:1 &mdash; &hellip: I heard a great voice of much people in heaven&hellip;\n\nCompare with Revelation 15:2,3 before the 7 vials were poured out. \n\n> Revelation 15:2 &mdash; And I saw as it were a sea of glass mingled with fire: and them that had gotten the victory over the beast, and over his image, and over his mark, and over the number of his name, stand on the sea of glass, having the harps of God. 3 And they sing the song of Moses the servant of God, and the song of the Lamb, saying, Great and marvellous are thy works, Lord God Almighty; just and true are thy ways, thou King of saints.\n\n- 24 Elders\n- 4 Beasts\n> Revelation 19:4 &mdash; And the four and twenty elders and the four beasts fell down and worshipped God that sat on the throne &hellip;\n\nRevelation 19:4 is the last reference in the Bible to the twenty-four elders and the four living creatures (by those titles). \n\n- Great Multitude\n> Revelations 19:6 &mdash;And I heard as it were the voice of a great multitude, and as the voice of many waters, and as the voice of mighty thunderings &hellip;\n\n### He is the Words of the Song\n\n> &hellip;saying, Alleluia; Salvation, and glory, and honour, and power, unto the Lord our God:\n\n#### Alleluia/Hallelujah\n\nThe Hebrew word \"halal\" [STRONG's 01984] in relation to God means to be clear of sound or color or to shine. Therefore, it means to make a show, to boast or to celebrate. 'Halal' can be found in 140 verses in the O.T.\n\n\"Halal\" [Hallelujah] is common in the Psalms where it is mostly translated \"Praise Ye the LORD\" (Psalm 105:45; 106:1; 106:48; 111:1; 112:1; 113:1; 146:1; 148:1; 149:1; 150:1).\n\n> Psalm 150:1&mdash;Praise ye the LORD. Praise God in his sanctuary: praise him in the firmament of his power.\n\nInterestingly, in the N.T., Alleluia/Hallelujah can only be found here in Revelation 19. The Greek word \"allelouia\" is imperative just as the Hebrew word \"halal\". Alleluia is a command to Praise the Lord (Jah)! It is an adoring exclamation and command &mdash; HALLELUJAH!\n\nHIS Salvation, HIS Glory, HIS Honor, HIS Power\n\n### He is the Reason Why We Sing\n \n#### His Judgments are True\n\n> Revelation 19:2a &mdash For true and righteous are his judgments: for he hath judged the great whore, which did corrupt the earth with her fornication, &hellip;\n\n1. What has she done?\n\n- Corrupt the earth with her fornication \"great whore\"\n- What if she hadn't been so unfaithful?\n- Sexual sin and spiritual unfaithfulness to God\n- Shed blood of saints\n- avenged as it was an offense against God and not just those slain HIS SERVANTS\n\n2. How did she get the opportunity to do these things? Who allowed it?\n3. Who is SHE? BY NATURE OF WHAT SHE HAS DONE SHE IS ... abomination\n4. The truth of His judgments ... lies ... last word -- TRUTH and RIGHTEIOUSNESS\n\n#### He Keeps His Promises\n\n> Revelation 19:2b &mdash &hellip; and hath avenged the blood of his servants at her hand. 3 And again they said, Alleluia. And her smoke rose up for ever and ever.\n \n#### He Reigns\n\n> Revelation 19:6 &mdash; &hellip; saying, Alleluia: for the Lord God omnipotent reigneth.\n","lesson":13},{"type":"md","value":"<bookmark id=\"second\"/>\n\n## The Bridegroom/Lamb Who Will be Wed (vs. 7-10)\n\n> Revelation 19:7-10 &mdash Let us be glad and rejoice, and give honour to him: for the marriage of the Lamb is come, and his wife hath made herself ready. 8 And to her was granted that she should be arrayed in fine linen, clean and white: for the fine linen is the righteousness of saints. 9 And he saith unto me, Write, Blessed are they which are called unto the marriage supper of the Lamb. And he saith unto me, These are the true sayings of God. 10 And I fell at his feet to worship him. And he said unto me, See thou do it not: I am thy fellowservant, and of thy brethren that have the testimony of Jesus: worship God: for the testimony of Jesus is the spirit of prophecy.\n\n### A Joyous Marriage and Marriage Supper\n\n#### The Marriage Supper\n\n> Revelation 19:7&mdash;Let us be glad and rejoice, and give honour to him: for the marriage of the Lamb is come,&hellip; \n\nNow that the harlot has fallen, the faithful woman comes to her rightful honors. The bethrothed, now becomes a bride. The time of her marriage has come, and a grand banquet will follow.\n\n> Revelation 19:9&mdash;And he saith unto me, Write, Blessed are they which are called unto the marriage supper of the Lamb. And he saith unto me, These are the true sayings of God.\n\n#### The Wedding\n\nThere is no question who the Bridegroom is, but who is the Bride? The Bride is not merely going to witness a marriage or eat a celebratory feast, but she is one of the two reasons for the grand day! She is the Bridegroom's heart's desire and the one He has chosen to unite with as one. (Amos 3:3; 2 Corinthians 6:14)\n\n##### 1. Psalm 45 \"A Song of Loves\"\n\nSome say, that ALL who are born again make up the Bride. Let's consider Psalm 45 in light of this. The preface to Psalm 45 gives us some keys:\n\n> To the chief Musician upon Shoshannim, for the sons of Korah, Maschil, A Song of loves.\n\n- Shoshannim: \"set to the lilies\" (general beauty of the composition or to the tune, or even to a six-stringed instrument)\n- Sons of Korah: Levites in the ministry of worship in the temple\n- A Song of Loves\n- vs.1 The Psalmist is \"PARTICULARLY\" inspired! (This is no ordinary psalm, but is a revelation.)\n\nHere is a brief outline of Psalm 45:8,9,14.\n\n- vs. 8 First, the King Comes Forth Out of the Ivory Palaces (Alone)\n- vs. 9 Second, the King with the Queen\n- vs. 14 Third, we see the virgins who are the companions, associates or bosom friends of the Queen\n\nThese virgins do not go with the Queen when she is taken, but they follow after her. \n\n> Psalm 45:14&mdash;She shall be brought unto the king in raiment of needlework: the virgins her companions that follow her shall be brought unto thee\n\n##### 2. Matthew 25 \"Parable of 10 Virgins\"\n\nWe also see this truth in the parable of the ten virgins of Matthew 25. Implied in this parable is that not all those who finally get to heaven are of that class which makes up the Bride.\n\nTo understand who the Bride is, we need to observe the different classes of persons given in the text. \n\n1. The Voice of the one who says \"Let us be glad\", vs. 10\n2. Those who are to rejoice with him (\"us\") vs. 9\n\nThese are considered blessed to a) witness the marriage and to b) participate in the banquet.\n\n### The Preparation of the Lamb's Wife\n\n> Revelation 19:7,8&mdash;&hellip;and his wife hath made herself ready. 8 And to her was granted that she should be arrayed in fine linen, clean and white: for the fine linen is the righteousness of saints.\n\n#### The Making of the Bride\n\nHow does this bride so capture the eye and heart of the groom? What has led her to this grand wedding day? Three things catch our notice in her preparation:\n\n##### Her Self Activity - \"made herself ready\"\n\nThe Bridegroom does not prepare her directly, but she will ready herself by applying what He has provided.\n\n##### The Action of Bestowing of the Gifts of Grace- \"to her was granted\"\n\n##### The Action of Faith and Obedience - \"arrayed in fine linen\"\n\nThe garments reveal the nature of preparation. The outstanding characteristics of her garments are: clean (free from impurity) and white (shining and brilliant). The fine linen she wears is the [dikaioma] \"righteous acts\" or \"equitable deeds\" of the saints. \n\nThere is righteousness that is imputed by faith which is the free gift of God in Christ. There is also righteousness that is imparted which is the fruit or works of faith. Consider Philippians 3:8-14. In Psalm 45:13-14, her clothing is of wrought gold (divine righteousness) and her raiment is also of needlework (righteous acts or works of faith).\n\n#### The Marks of the Bride\n\n- She Will have a Lamb's Nature\n- She Will be Meek and Lowly\n- Humble\n- Obedient\n- Overcomer\n\n### The Marriage of the Lamb\n\nWhat is the marriage of the Lamb? John did not see it, but he did hear the heavens rejoicing!\n\nWe can assume a few things about this \"wedding\" based on the terms used. Any marriage being a union, the Bride will be united with the Bridegroom. Being with Him, she will reign with him and share with Him in all His glorious inheritance.\n\nWe are not told what the ceremony will hold. It is still a grand and glorious mystery!\n\n### John's Response\n\n> Revelation 19:10&mdash;And I fell at his feet to worship him. And he said unto me, See thou do it not: I am thy fellowservant, and of thy brethren that have the testimony of Jesus: worship God: for the testimony of Jesus is the spirit of prophecy.\n ","lesson":13},{"type":"md","value":"<bookmark id=\"third\"/>\n\n## The Lion Who will Return in Judgment (vs. 11-21)\n\n> Revelation 19:11 &mdash; And I saw heaven opened, and behold a white horse; and he that sat upon him was called Faithful and True, and in righteousness he doth judge and make war.\n\nRevelation 19:11-21 is about the battle of the Great Day of the Lord. (Zephaniah 1:14; Revelation 16:14) This battle will be of great and yet righteous violence and vengeance.\n\n### \"Rod of Iron\": Violence &amp; Vengeance\n\nThe Lion is a mighty conqueror.\n\n**Words of Battle**: &hellip; white horse &hellip; judge and make war &hellip; vesture dipped in blood&hellip; armies &hellip; sharp sword, &hellip;smite &hellip; rule &hellip; rod of iron &hellip; treadeth &hellip; fierceness and wrath .. eat the flesh &hellip; make war&hellip;beast was taken, and with him the false prophet&hellip;These both were cast alive into a lake of fire burning with brimstone&hellip;slain with the sword\n\nA search for \"vengeance\" in the Bible will result in at least 40 verses. And the context is almost always in reference to God taking vengeance on His enemies.\n\nRead: Deut. 32:35; Psalm 94:1; Romans 12:19; Romans 3:5\n\n> Deuteronomy 32:35 To me belongeth vengeance, and recompence; their foot shall slide in due time: for the day of their calamity is at hand, and the things that shall come upon them make haste.\n\n> Psalms 94:1 O LORD God, to whom vengeance belongeth; O God, to whom vengeance belongeth, shew thyself.\n\n> Romans 12:19 Dearly beloved, avenge not yourselves, but rather give place unto wrath: for it is written, Vengeance is mine; I will repay, saith the Lord. (Leviticus 19:18)\n\n<blockquote class=\"quote\">The best revenge is to be unlike him who performed the injury. &mdash;Marcus Aurelius, Meditations</blockquote>\n\nGod alone is God. We are never to usurp the AUTHORITY of God -- vengeance for spiritual wrong belongs exclusively to God.\n\n<blockquote class=\"quote\">On 17 June, Michel Servetus was convicted of heresy, thanks to the 17 letters sent by John Calvin (Calvin agreed that those whom the ruling religious authorities determined to be heretics should be punished:), and sentenced to be burned with his books. Historians record his last words as: \"**Jesus, Son of the Eternal God, have mercy on me**.\"</blockquote>\n\nIs God unrighteous in His vengeance? [\"Do as I say and not as I do\"?]\n\n> Romans 3:5 But if our unrighteousness commend the righteousness of God, what shall we say? Is God unrighteous who taketh vengeance? (I speak as a man)\n\n<blockquote class=\"quote\">Dictionary definition of Avenge: inflict hurt or harm on someone for an injury or wrong suffered at their hands. (to carry out a grudge)</blockquote>\n\nEven deeper than the sense of carrying out a \"grudge\" is the sense that Scripture gives to revenge. In the scripture, in reference to God, revenge/avenge/vengeance has at its root meaning **PUNISHMENT**. God is not petty, he is righteous. We see God in our text not passionately out of control because of a vendetta, but we see **Christ in His Divine glory***.\n\n### The Lion is a Mighty Conqueror (vs 11-16)\n\n### Verse 11 He is Righteous and Glorious\n\n> Revelation 19:11&mdash;And I saw heaven opened, and behold a white horse; and he that sat upon him was called Faithful and True, and in righteousness he doth judge and make war.\n\n- Heaven Opened\n- All the Judgments of God are righteous\n- Conquering BY RIGHTEOUSNESS\n\n### Verse 12 His Eyes, Crowns and Name\n\n>12 His eyes were as a flame of fire, and on his head were many crowns; and he had a name written, that no man knew, but he himself.\n\n#### His Eyes were a Flame of Fire\n\nTwo things to consider: His omniscent perception and his omnipotent wrath.\n\n#### On His Head Many Crowns\n\nHe is not just Judge and General, but He is also King. In 2 Samuel 12:30 when David defeated the Ammonites he put the crown of the vanquished king on his head. The Dragon has seven diadems as \"possesor of the seven great world powers\". (Rev. 12:3) The beast has ten crowns combining 10 soveriegn powers. (Rev. 13:1) The accumulation of crowns relates to the accumulation of victories and dominion.\n\n#### He has an Unknowable Name\n\nJohn saw that the name was written, but did not and could not record it as he was awed with its splendor making it too much for him to understand or know. (Matthew 11:27 the depth of God)\n\nThe Mystery of His Name is also a message to his enemies: you don't even know me! Contrast this with the sign written over Christ's head on the cross.\n\n> Mt 27:29,37 And when they had platted a crown of thorns, they put it upon his head, and a reed in his right hand: and they bowed the knee before him, and mocked him, saying, Hail, King of the Jews! 37 And set up over his head his accusation written, THIS IS JESUS THE KING OF THE JEWS.)\n\n> Revelation 19:13-16 &mdash; And he was clothed with a vesture dipped in blood: and his name is called The Word of God. 14 And the armies which were in heaven followed him upon white horses, clothed in fine linen, white and clean. 15 And out of his mouth goeth a sharp sword, that with it he should smite the nations: and he shall rule them with a rod of iron: and he treadeth the winepress of the fierceness and wrath of Almighty God. 16 And he hath on his vesture and on his thigh a name written, KING OF KINGS, AND LORD OF LORDS.\n\n### Verse 13 Reputation, Purpose and Position of Christ\n\n#### His Reputation\n> &hellip;And he was clothed with a vesture.\n\nHis moral character or reputation is seen. He is not naked. He and all those in Heavenly places are clothed. Those who serve the devil are naked. (Mark 5:15 \"legion\"; Acts 19:16 \"Sons of Sceva\") \n\nHe is clothed with a long inner garment (Rev. 1:13) and an outer garment (\"vesture\").\n\n#### His Purpose\n\n> &hellip; dipped in blood:&hellip;\n\nThe blood in this context is not His own, but are the bloodstains of His enemies. We see here the marks of a veteran mighty in battle. This is He who fought for Israel as He fought from Heaven against Egyptians, Canaanites, Philistines and many others. Remember what happened to Dagon? (1 Samuel 5:1-7)\n\n> Isaiah 63:1-4&mdash;Who is this that cometh from Edom, with dyed garments from Bozrah? this that is glorious in his apparel, travelling in the greatness of his strength? I that speak in righteousness, mighty to save. 2 Wherefore art thou red in thine apparel, and thy garments like him that treadeth in the winefat? 3 I have trodden the winepress alone; and of the people there was none with me: for I will tread them in mine anger, and trample them in my fury; and their blood shall be sprinkled upon my garments, and I will stain all my raiment. 4 For the day of vengeance is in mine heart, and the year of my redeemed is come.\n\nHe is in our text wearing the \"same garments\" as then! He is coming in the same capacity for the same purpose and with the same invincible power.\n\n#### His Position\n> &hellip;and his name is called The Word of God. (John 1:1)\n\nIn our text, He is not coming at this time as a lamb to save, but as \"the Word of God\" / Judge. He will judge the world by His Word. Three names are given here indicating his position:\n\n1. An Unknowable Name vs. 12\n2. The Word of God vs. 13, 15\n\n> Revelation 19:15&mdash;And out of his mouth goeth a sharp sword, that with it he should smite the nations: and he shall rule them with a rod of iron: and he treadeth the winepress of the fierceness and wrath of Almighty God.\n\n3. King of Kings and Lord of Lords vs. 16\n\n> Revelation 19:16&mdash;And he hath on his vesture and on his thigh a name written, KING OF KINGS, AND LORD OF LORDS.\n\n### Verse 14 The Armies of Heaven\n\n#### The Lion of Judah is Not Alone\n\nWhen the Lord Jesus is revealed from Heaven in flaming fire taking vengeance upon them that know not God and that obey not the Gospel (2 Thessalonians 1:8), He does not come alone.\n\n> Revelation 19:14&mdash;And the armies which were in heaven followed him upon white horses, clothed in fine linen, white and clean.\n\n- His Army Will Include His Mighty Angels\n\n> 2 Thessalonians 1:7,8&mdash;And to you who are troubled rest with us, when the Lord Jesus shall be revealed from heaven with his mighty angels, 8 In flaming fire taking vengeance on them that know not God, and that obey not the gospel of our Lord Jesus Christ:\n\nCompare with 2 Kings 6:17 and Psalm 68:17;\n\n- His Army will Include 10,000's of His Saints\n\nJude 1:14,15&mdash;And Enoch also, the seventh from Adam, prophesied of these, saying, Behold, the Lord cometh with ten thousands of his saints, 15 To execute judgment upon all, and to convince all that are ungodly among them of all their ungodly deeds which they have ungodly committed, and of all their hard speeches which ungodly sinners have spoken against him.\n\nSaints from all ages of time, make up the armies of the sky. Notice that the Bride goes to Heaven in a Battle (Revelation 12:7) and then comes again in a battle (Revelation 19:14).\n\n- \"Rod of Iron\"\n\n>  Psalm 2:9 &mdash; Thou shalt break them with a rod of iron; thou shalt dash them in pieces like a potter's vessel.\n\n> Revelation 2:27 And he shall rule them with a rod of iron; as the vessels of a potter shall they be broken to shivers: even as I received of my Father.\n\n> Revelation 12:5 And she brought forth a man child, who was to rule all nations with a rod of iron: and her child was caught up unto God, and to his throne.\n\n> Revelation 19:15 And out of his mouth goeth a sharp sword, that with it he should smite the nations: and he shall rule them with a rod of iron: and he treadeth the winepress of the fierceness and wrath of Almighty God.\n\n- Also translated \"iron scepter\". An \"IRON ROD\" could be a shepherds staff.\n\n> Psalm 23:4 &mdash; Yea, though I walk through the valley of the shadow of death, I will fear no evil: for thou art with me; thy rod and thy staff they comfort me.\n\n- Will His rule be marked by \"coercion\"? Not merely an exercise of MIGHT but RIGHT!\n\n#### They Followed Him\n\nHe is the commander who gives the orders. They do His bidding. In Matthew 26:53 He could have called 12 legions of angels, but He died alone. (A Roman legion consisted of about six thousand soldiers, or upwards.)\n\n#### Upon White Horses\n\n#### Clothed in Fine Linen, white and clean\n\n#### They Wear no Armor\n\n### The Lion's Last Battle (vs. 17-21)\n\n\n#### An Invitation to this Battle\n\nAn Invitation to another 'supper' is given:\n\n>Revelation 19:17-21 &mdash; And I saw an angel standing in the sun; and he cried with a loud voice, saying to all the fowls that fly in the midst of heaven, Come and gather yourselves together unto the supper of the great God; 18 That ye may eat the flesh of kings, and the flesh of captains, and the flesh of mighty men, and the flesh of horses, and of them that sit on them, and the flesh of all men, both free and bond, both small and great. 19 And I saw the beast, and the kings of the earth, and their armies, gathered together to make war against him that sat on the horse, and against his army. 20 And the beast was taken, and with him the false prophet that wrought miracles before him, with which he deceived them that had received the mark of the beast, and them that worshipped his image. These both were cast alive into a lake of fire burning with brimstone. 21 And the remnant were slain with the sword of him that sat upon the horse, which sword proceeded out of his mouth: and all the fowls were filled with their flesh.\n\n- Invitation is given to the fowls that \"fly in the midst of Heaven\"\n- There is going to be great death\n- Will eat: Flesh of Kings, Captains, Mighty Men, Horses, Horsemen, Free Men, Bond Men, Great Men, Small Men\n\n#### Some Background on this Battle\n\n##### The Demise of Satan throughout Scripture\n\nChrist is always the victor. Lucifer rebelled and fell to the condemnation of the devil. Satan deceived Eve, but out of a woman came the seed of the Redeemer! Jesus Christ was betrayed or forsaken by those closest to Him through the wiles of the devil, but three days later Up from the Grave Christ Arose! In the last days, the devil will deceive many, but God will still have his faithful and holy remnant.\n\nWe are in a time, when evil appears to advance his cause without much opposition. No matter the appearances, satan is a defeated foe. We are commanded to resist, defend against and oppose the devil in daily battles. But Christ will have the final say-so and a final \"battle\" will END the Wicked One and his servants.\n\n> 2 Thessalonians 2:8&mdash;And then shall that Wicked be revealed, whom the Lord shall consume with the spirit of his mouth, and shall destroy with the brightness of his coming:\n\n##### The Gathering and Wine Press in Revelation 14:14-20\n\nRevelation 14 describes Christ coming as one like unto the Son of man sitting on a white cloud. Having in His hand a sharp sickle, the following judgment is described as both a \"gathering of harvest\" and a \"wine press of wrath\".\n\n> Revelation 14:19-20&mdash; And the angel thrust in his sickle into the earth, and gathered the vine of the earth, and cast it into the great winepress of the wrath of God. 20 And the winepress was trodden without the city, and blood came out of the winepress, even unto the horse bridles, by the space of a thousand and six hundred furlongs.\n\n>Revelation 19:15&mdash;&hellip;he treadeth the winepress of the fierceness and wrath of Almighty God.\n\n##### The 6th vial in Revelation 16:12-16\n\nRevelation 16 told us that the location of this great battle would be in Armageddon. On the human side, the kings of the earth are inspired to gather together against God by evil spirits.\n\n> Revelation 16:14 For they are the spirits of devils, working miracles, which go forth unto the kings of the earth and of the whole world, to gather them to the battle of that great day of God Almighty.\n\n> Revelation 16:16 And he gathered them together into a place called in the Hebrew tongue Armageddon.\n\n##### Making War with the Lamb in Revelation 17:14\n\nRevelation 17:14 describes the kings of the earth as making war with the lamb, but the Lamb and those that are with Him overcome them.\n\n> Revelation 17:14 These [the ten kings of the earth] shall make war with the Lamb, and the Lamb shall overcome them: for he is Lord of lords, and King of kings: and they that are with him are called, and chosen, and faithful.","lesson":13},{"type":"md","value":"## Conclusion\n\n","lesson":13},{"type":"h1","value":"B. Christ and the 7 Golden Candlesticks [1:9-20]","lesson":2},{"type":"h1","value":"Revelation Study","lesson":1},{"type":"md","value":"<div id=\"a\"></div>\n\n# Lesson 1","lesson":1},{"type":"md","value":"## Study Outline\n\n        <h3><a href=\"/revelation/lesson?part=front\">Some Keys to Studying the Book of Revelation</a></h3>\n\n      <!--1--!>  <h3>(A) <a href=\"/revelation/lesson?part=a\">Introduction [1:1-8]</a></h3>\n      <!--2--!>  <h3>(B) <a href=\"/revelation/lesson?part=b\">Christ and the 7 Golden Candlesticks [1:9-20]</a></h3>\n      <!--3--!>  <h3>(C) <a href=\"/revelation/lesson?part=c\">7 Letters to 7 Churches [2-3]</a></h3>\n      <!--4--!>  <h3>(D) <a href=\"/revelation/lesson?part=d\">Vision of the Throne [4]</a></h3>\n      <!--5--!>  <h3>(E) <a href=\"/revelation/lesson?part=e\">Seven Seals [5-8:1]</a></h3>\n      <!--6--!>  <h3>(F) <a href=\"/revelation/lesson?part=f\">Angels and 7 Trumpets [8:2-13; 9-11]</a></h3>\n      <!--7--!>  <h3>(G) <a href=\"/revelation/lesson?part=g\">A War in Heaven and a War on Earth [12]</a></h3>\n      <!--8--!>  <h3>(H) <a href=\"/revelation/lesson?part=h\">2 Beasts and the Dragon [13]</a></h3>\n      <!--9--!>  <h3>(I) <a href=\"/revelation/lesson?part=i\">A Lamb Stood on Mount Sion [14:1-5]</a></h3>\n      <!--10--!>  <h3>(J) <a href=\"/revelation/lesson?part=j\">Judgement Hour Messages [14:6-20]</a></h3>\n      <!--11--!>  <h3>(K) <a href=\"/revelation/lesson?part=k\">7 Last Plagues in Vials [15-16]</a></h3>\n      <!--12--!>  <h3>(L) <a href=\"/revelation/lesson?part=l\">Fall of Babylon [17-18]</a></h3>\n      <!--13--!>  <h3>(M) <a href=\"/revelation/lesson?part=m\">The Marriage and Marriage Feast of the Lamb [19]</a></h3>\n      <!--14--!>  <h3>(N) <a href=\"/revelation/lesson?part=n\">Millenial Kingdom [20:1-10]</a></h3>\n      <!--15--!>  <h3>(O) <a href=\"/revelation/lesson?part=o\">Last Judgment [20:11-15]</a></h3>\n      <!--16--!>  <h3>(P) <a href=\"/revelation/lesson?part=p\">All Things New [21-22:1-5]</a></h3>\n      <!--17--!>  <h3>(Q) <a href=\"/revelation/lesson?part=q\">Closing [22:6-21]</a></h3>\n\n        <h2>Topical Studies</h2>\n        <h3><a href=\"/revelation/lesson?part=picturesofchrist\">Pictures of Christ</a></h3>     \n        <h3><a href=\"/revelation/lesson?part=peopleofrevelation\">People of Revelation</a></h3>  ","lesson":1},{"type":"md","value":"---\ntitle: Some Keys to Studying the Book of Revelation \nsubject: Revelation | Bible Study\nlast_edited: November 23, 2020\n---\n# Some Keys to Studying the Book of Revelation\n\n## General Instructions on Bible Study\n\n- All Scripture is given by inpiration of God and is profitable for DOCTRINE - REPROOF - CORRECTION - INSTRUCTION IN RIGHTEOUSNESS\n\n> 2 Timothy 3:16 All scripture is given by inspiration of God, and is profitable for doctrine, for reproof, for correction, for instruction in righteousness:</p>\n\n- STUDY, ENDEAVOR, LABOR\n\n> 2Ti 2:15 &mdash; Study to shew thyself approved unto God, a workman that needeth not to be ashamed, rightly dividing the word of truth.\n\n<p>Its often in the process of the work, that discovery unexpected is made.</p>\n<ol>\n<li>KEEP THE UNITY OF SPIRIT </li>\n</ol>\n<blockquote>\n<p>Ephesians 4:3 Endeavouring to keep the unity of the Spirit in the bond of peace.</p>\n</blockquote>\n<p>Study with the intent of acquiring truth to help others as well as ourselve. NOT TO WIN A DEBATE.</p>\n<p>It is true of Scripture as all &quot;manifestations of the Spirit&quot;: That the manifestations of the spirit are given to every man to profit withall.</p>\n<blockquote>1 Corinthians 12:7 &mdash; But the manifestation of the Spirit is given to every man to profit withal.</blockquote>\n\n<ol>\n<li>Emphasis prayer coupled with study.</li>\n</ol>\n<blockquote>\n<p>Php 1:9 &mdash; And this I pray, that your love may abound yet more and more in knowledge and in all judgment;</p>\n</blockquote>\n<ol>\n<li>Interpretation is made by comparing Scripture with Scripture.</li>\n</ol>\n<blockquote>\n<p>2 Peter 1:20,21 &mdash; Knowing this first, that no prophecy of the scripture is of any private interpretation. 21 For the prophecy came not in old time by the will of man: but holy men of God spake as they were moved by the Holy Ghost.</p>\n</blockquote>\n<p>The Bible is a UNITED work.</p>\n\n## Some Keys to Studying Revelation in Particular\n\n<ol>\n<li><p>It IS GIVEN that we understand it!</p>\n</li>\n</ol>\n<blockquote>\n<p>Daniel 9:13 &mdash; As it is written in the law of Moses, all this evil is come upon us: yet made we not our prayer before the LORD our God, that we might turn from our iniquities, and understand thy truth.</p>\n</blockquote>\n<ol>\n<li><p>Don&#39;t major on the minors.</p>\n</li>\n<li><p>John was exiled by emperor Domition in his persecution of the Christians to the Isle of Patmos. Stands stil today with an enormous fortress like Greek orthodox church in its center.</p>\n</li>\n<li><p>SCOPE</p>\n<p> addressed to 7 churches of Asia. All existed within a 150 sq miles of where John was exiled.\n 1:1; 3; 9; 4:1 &quot;shortly&quot;,&quot;John&#39;s lifetime&quot;\n &quot;the last days&quot; Genesis 49:1; Isaiah 2:2; Micah 4:1; Acts 2:17; 2 Timothy 3:1; Hebrews 1:2; 2 Peter 3:3\n IS, IS BEING, WILL BE</p>\n</li>\n\n<li>Adopt some Rules for Consistent Interpretation</li>\n\n<p>In this study, we will seek to faithfully apply the following principles.</p>\n\n- Unless textual statements or clues are given otherwise, we will interpret Revelations prophetic events as being fulfilled in the sequence they are written.\n\n- Being a book of prophecy, we will look to the future first for fulfillment before the past.\n\n- We will interpret the numbers of this book literally first, before applying typical meaning to them.</li>\n\n- We will interpret symbols consistently through the book of Revelation and in the greater context of the Bible as a whole.</li>\n\n- God is good and He keeps His Word. We will shine the light of these truths and the revelations of God's nature throughout the Bible upon all the events of this Book and with them temper our interpretations. ( Psalm 73:1; )\n\n</ol>","lesson":1},{"type":"md","lesson":30,"value":"# Revelation Quiz"},{"type":"h1","value":"L. Fall of Babylon [17 & 18]","lesson":12},{"type":"quiz","lesson":30,"title":"Revelation Bible Bowl","questions":[{"q":"Where was John exiled?","ref":"Revelation 1:9","type":"ALL_ANSWER","answers":[{"text":"Isle of Gibeah","points":"0"},{"text":"Isle of Patmos","points":500},{"text":"Isle of Rome","points":0},{"text":"Isle of Galilee","points":0}]},{"q":"Who did John see in the midst of the seven candlesticks?","ref":"Revelation 1:13","type":"BUZZER","answers":[{"text":"Jesus","points":500},{"text":"Himself","points":0},{"text":"The Church","points":0},{"text":"Angels","points":0}]},{"q":"How did John describe the eyes of the one in the midst of the seven candlesticks?","ref":"Revelation 1:14","type":"ALL_ANSWER","answers":[{"text":"white as snow","points":"0"},{"text":"like brass","points":0},{"text":"golden","points":0},{"text":"as a flame of fire","points":"500"}]},{"q":"FILL IN THE BLANK: \"the seven candlesticks which thou sawest are the seven ____________.","ref":"Revelation 1:20","type":"ALL_ANSWER","answers":[{"text":"ministers","points":"0"},{"text":"nations","points":0},{"text":"scrolls","points":0},{"text":"churches","points":"500"}]},{"q":"Which of the following is NOT one of the 7 churches of Asia addressed in Revelation?","ref":"Revelation 1:11","type":"BUZZER","answers":[{"text":"Thyatira","points":"0"},{"text":"Philadelphia","points":0},{"text":"Smyrna","points":"0"},{"text":"Jerusalem","points":"500"}]},{"q":"What 2 churches in Revelation 2 & 3 were the only churches who passed inspection?","ref":"Revelation 2:13; 3:8","points":"ALL_ANSWER","type":"","answers":[{"text":"Ephesus and Smyrna","points":"0"},{"text":"Pergamos and Philadelphia","points":"500"},{"text":"Ephesus, Philadelphia","points":0},{"text":"Pergamos, Sardis","points":0}]},{"q":"Of the 7 Churches addressed in Revelation 2 and 3, which church was the only one not to receive a commendation?","ref":"Revelation 3:14-22","type":"BUZZER","answers":[{"text":"Pergamos","points":"0"},{"text":"Philadelphia","points":0},{"text":"Laodicea","points":"500"},{"text":"Smyrna","points":0}]},{"q":"What color is the rainbow around the throne?","ref":"Revelation 4:3","type":"ALL_ANSWER","answers":[{"text":"jasper","points":"0"},{"text":"many colors","points":0},{"text":"emerald","points":"500"},{"text":"sardonyx","points":0}]},{"q":"How many wings did each beast/living creature around the throne have?","ref":"Revelation 4:8","type":"BUZZER","answers":[{"text":"7","points":"0"},{"text":"6","points":"500"},{"text":"3","points":0},{"text":"2","points":"0"}],"x":"ALL_ANSWER"},{"q":"Revelation Chapter 4 opens with what great event?","ref":"Revelation 4:1","points":"ALL_ANSWER","type":"BUZZER","answers":[{"text":"rapture","points":500},{"text":"war","points":0},{"text":"marriage","points":0},{"text":"antichrist","points":0}]},{"q":"FILL IN THE BLANK:  And I saw in the _____ hand of him that sat on the throne a book written within and on the backside, sealed with seven seals","ref":"Revelation 5:1","type":"BUZZER","answers":[{"text":"strong","points":"0"},{"text":"left","points":"0"},{"text":"right","points":"500"},{"text":"small","points":0}]},{"q":"The Lamb that stood in the midst of the throne had how many horns and eyes?","ref":"Revelation 5:6","type":"ALL_ANSWER","answers":[{"text":"7","points":500},{"text":"6","points":0},{"text":"5","points":0},{"text":"2","points":0}]},{"q":"What were the golden vials full of odors that the four beasts and four and twenty elders a type of?","ref":"Revelation 5:8","type":"ALL_ANSWER","answers":[{"text":"peace offerings to God","points":"0"},{"text":"remembrance of martyrs","points":0},{"text":"songs of the redeemed","points":0},{"text":"prayers of saints","points":"500"}]},{"q":"John heard the voices of how many around the throne?","ref":"Revelation 5:11","type":"ALL_ANSWER","answers":[{"text":"trillions","points":"0"},{"text":"ten thousand times ten thousand and thousands of thousands","points":"500"},{"text":"one thousand thousands","points":0},{"text":"144,000","points":0}]},{"q":"Who is the \"opener\" of the seals?","ref":"Revelation 6:1","type":"ALL_ANSWER","answers":[{"text":"Him on the Throne","points":"0"},{"text":"John the Revelator","points":0},{"text":"the Lamb","points":"500"},{"text":"the Dragon","points":0}]},{"q":"4 Times the command to \"come and see\" is given to John by?","ref":"Revelation 6:1,3,5,7","type":"ALL_ANSWER","answers":[{"text":"the Lamb","points":"0"},{"text":"one of the 24 Elders","points":0},{"text":"one of the 4 beasts","points":"500"},{"text":"an angel","points":0}]},{"q":"Which of the 7 seals gives us a picture of Persecution and Martyrdom?","ref":"Revelation 6:9","type":"BUZZER","answers":[{"text":"4","points":"0"},{"text":"5","points":"500"},{"text":"6","points":0},{"text":"7","points":0}]},{"q":"What two tribes of Israel are missing in the 144,000?","ref":"Revelation 7","type":"BUZZER","answers":[{"text":"Naphtali and Gad","points":"0"},{"text":"Joseph and Levi","points":0},{"text":"Reuben and Asher","points":0},{"text":"Dan and Ephraim","points":"500"}]},{"q":"Which of the following is NOT a blessing promised to those of the Palm-Bearing Innumerable Multitude?","ref":"Revelation 7","type":"ALL_ANSWER","answers":[{"text":"not hunger or thirst any more","points":"0"},{"text":"serve God day and night in his temple","points":0},{"text":"God shall wipe away all tears from their eyes","points":0},{"text":"a crown","points":"500"}]},{"q":"Who are the Palm-Bearing Innumerable Multitude?","ref":"Revelation 7","type":"ALL_ANSWER","answers":[{"text":"the Bride","points":"0"},{"text":"the Church","points":0},{"text":"tribulation saints","points":"500"},{"text":"resurrected martyrs","points":0}]},{"q":"Where is the seal placed of the 144,000?","ref":"Revelation 7:3","type":"ALL_ANSWER","answers":[{"text":"right hand","points":"0"},{"text":"left hand","points":0},{"text":"arm","points":0},{"text":"forehead","points":"500"}]},{"q":"What immediately followed the opening of the 7th Seal?","ref":"Revelation 8:1","type":"BUZZER","answers":[{"text":"Half Hour of Silence in Heaven","points":500},{"text":"a Great Earth Quake","points":0},{"text":"Hell opened up","points":0},{"text":"a mountain-like meteor crashed into the ocean","points":0}]},{"q":"Who is the \"Mystery Angel\" with the golden censer and who will offer up the prayers of the saints to God?","ref":"Revelation 8","type":"ALL_ANSWER","answers":[{"text":"a Christian martyr","points":"0"},{"text":"Elijah","points":0},{"text":"an Arch Angel","points":0},{"text":"Jesus","points":"500"}]},{"q":"The 3rd Trumpet signaled the fall of a star named Wormwood. What will the effect of this event be?","ref":"Revelation 8","type":"ALL_ANSWER","answers":[{"text":"will kill 50% of all animals","points":"0"},{"text":"1/3 of all rivers will become poisonous","points":"500"},{"text":"1/3 of the sea will become blood","points":0},{"text":"1/3 of the sun, moon and stars will be darkened","points":0}]},{"q":"After the fifth trumpet, out of a bottomless pit ascended what?","ref":"Revelation 9:3","type":"ALL_ANSWER","answers":[{"text":"horses","points":"0"},{"text":"spirits","points":0},{"text":"lava","points":0},{"text":"locusts","points":"500"}]},{"q":"What comparison is made to the power of the locusts from out of the smoke?","ref":"Revelation 9:3","type":"BUZZER","answers":[{"text":"like wasps","points":"0"},{"text":"like lions","points":0},{"text":"like fire","points":"0"},{"text":"like scorpions","points":"500"}]},{"q":"What is the name of the king over the locusts out of the smoke?","ref":"Revelation 9:11","type":"ALL_ANSWER","answers":[{"text":"Abaddon","points":500},{"text":"Blasphemer","points":0},{"text":"Ruthless","points":0},{"text":"Lucifer","points":0}]},{"q":"What is on the head of the Cloud Robed Angel in Chapter 10?","ref":"Revelation 10:1","type":"ALL_ANSWER","answers":[{"text":"crown","points":"0"},{"text":"7 jewels","points":0},{"text":"a throne","points":0},{"text":"rainbow","points":"500"}]},{"q":"FILL IN THE BLANK: \"(Revelation 10) And he had in his hand a little book open: and he set his _________________________. \"","ref":"Revelation 10:2","type":"ALL_ANSWER","answers":[{"text":"right foot upon the mountains, and his left foot on the oceans","points":"0"},{"text":"left foot upon the sea, and his right foot on the earth","points":"0"},{"text":"right foot upon the sea, and his left foot on the earth","points":"500"},{"text":"left hand upon the throne, and his left hand on the earth","points":0}]},{"q":"What did John do concerning the what the \"7 Thunders\" uttered?","ref":"Revelation 10:4","type":"ALL_ANSWER","answers":[{"text":"he gave a parable in its place","points":"0"},{"text":"he wrote it down","points":"0"},{"text":"he didn't know what they said","points":0},{"text":"he didn't record it","points":"500"}]},{"q":"How many days did the 2 witnesses prophecy?","ref":"Revelation 11:3","type":"ALL_ANSWER","answers":[{"text":"1,260 days","points":500},{"text":"5 years","points":0},{"text":"100 days","points":0},{"text":"72 hours","points":0}]},{"q":"Why was the outer court not measured in Revelation 11?","ref":"Revelation 11:2","type":"ALL_ANSWER","answers":[{"text":"it is given unto the Gentiles","points":500},{"text":"it is given unto the descendants of Joseph","points":0},{"text":"it is given unto Rome","points":0},{"text":"it is given unto Bride","points":0}]},{"q":"In what way will the ministry of the \"Two Witnesses\" be like Elijah's ministry?","ref":"Revelation 11:6","type":"BUZZER","answers":[{"text":"They will smite the earth with plagues","points":"0"},{"text":"They will shut the heavens to no rain","points":"500"},{"text":"They will be raptured in a chariot of fire","points":0},{"text":"They will turn water to blood","points":"0"}]},{"q":"In order, list the dragon's targets in Revelation 12.","ref":"Revelation 12:4,13,17","type":"ALL_ANSWER","answers":[{"text":"sun-clothed woman, man child, remnant","points":"0"},{"text":"man child, sun-clothed woman, remnant","points":"500"},{"text":"remnant, man child, sun-clothed woman","points":0},{"text":"man child, remnant, sun-clothed woman","points":0}]},{"q":"After the Man-child is translated to the throne, to where does the Sun-clothed woman flee?","ref":"Revelation 12:6","type":"ALL_ANSWER","answers":[{"text":"the city","points":"0"},{"text":"the ocean","points":0},{"text":"the wilderness","points":"500"},{"text":"heaven","points":0}]},{"q":"What angel leads the angelic hosts in the war in Heaven?","ref":"Revelation 12:7","type":"BUZZER","answers":[{"text":"Michael","points":500},{"text":"Gabriel","points":0},{"text":"Arturo","points":0},{"text":"Malachi","points":0}]},{"q":"TRUE OR FALSE: The False Prophet will arise out of the sea.","ref":"Revelation 13:11","type":"ALL_ANSWER","answers":[{"text":"TRUE","points":500},{"text":"FALSE","points":0},{"text":"","points":0},{"text":"","points":0}]},{"q":"Upon the heads of the beast rising out of the sea is what name?","ref":"Revelation 13:1","type":"ALL_ANSWER","answers":[{"text":"Blasphemy","points":500},{"text":"Apollyon","points":0},{"text":"Beelzebub","points":0},{"text":"Terror","points":0}]},{"q":"Which of the following does the \"False Prophet\" use to deceive?","ref":"Revelation 13:14","type":"ALL_ANSWER","answers":[{"text":"an image of the Beast","points":"0"},{"text":"eloquent words","points":0},{"text":"mighty armies","points":0},{"text":"miracles","points":"500"}]},{"q":"What was in the hand of the man upon a white cloud that John saw in Revelation 14?","ref":"Revelation 14:14","type":"ALL_ANSWER","answers":[{"text":"a book","points":"0"},{"text":"a whip","points":0},{"text":"a sharp sickle","points":"500"},{"text":"a sword","points":0}]},{"q":"How many stood with the lamb on mount Zion?","ref":"Revelation 14:1","type":"ALL_ANSWER","answers":[{"text":"10,000 times 10,000","points":"0"},{"text":"Innumerable","points":0},{"text":"Thousands of thousands","points":0},{"text":"144,000","points":"500"}]},{"q":"Where did the second angel with the sickle cast those he \"harvested\"? ","ref":"Revelation 14:18-20","type":"BUZZER","answers":[{"text":"into the winepress of the wrath of God","points":500},{"text":"into the bottomless pit","points":0},{"text":"into hell","points":0},{"text":"into the grave","points":0}]},{"q":"John saw 7 angels with 7 vials full of what?","ref":"Revelation 15:17","type":"ALL_ANSWER","answers":[{"text":"last plagues and wrath of God","points":500},{"text":"judgment and mercy","points":0},{"text":"prayers and petitions","points":0},{"text":"oil and gladness","points":0}]},{"q":"The sea of glass is mingled with what?\n\n","ref":"Revelation 15:2","type":"BUZZER","answers":[{"text":"fire","points":500},{"text":"ice","points":0},{"text":"water","points":0},{"text":"gems","points":0}]},{"q":"Before the 7 vials are poured out a song is sung in Heaven. What is the song?","ref":"Revelation 15:3","type":"ALL_ANSWER","answers":[{"text":"song of eterinity","points":"0"},{"text":"song of the redeemed","points":0},{"text":"revelation song","points":0},{"text":"song of moses and of the lamb","points":"500"}]},{"q":"Upon whom was the first vial of wrath poured?","ref":"Revelation 16:2","type":"ALL_ANSWER","answers":[{"text":"those having mark of beast and worshipped the image of the beast","points":500},{"text":"upon the waters","points":0},{"text":"upon the sun","points":0},{"text":"upon the antichrist","points":0}]},{"q":"In Revelation 16, Why did the angel of the waters say God was righteous in the judgment of His wrath?\n","ref":"Revelation 16:6","type":"ALL_ANSWER","answers":[{"text":"they persecuted the church","points":"0"},{"text":"they martyred saints and prophets","points":"500"},{"text":"they denied God","points":0},{"text":"they worshipped the image of the Beast","points":0}]},{"q":"Where did the fourth angel poured out his vial?","ref":"Revelation 16:8","type":"ALL_ANSWER","answers":[{"text":"upon the sun","points":500},{"text":"upon the earth","points":0},{"text":"upon the waters","points":0},{"text":"upon the moon","points":0}]},{"q":"How many horns does the scarlet coloured beast, full of names of blasphemy have?","ref":"Revelation 17:3","type":"ALL_ANSWER","answers":[{"text":"6","points":"0"},{"text":"9","points":0},{"text":"10","points":"500"},{"text":"12","points":0}]},{"q":"MYSTERY, BABYLON THE GREAT, THE MOTHER OF HARLOTS AND ABOMINATIONS OF THE EARTH was arrayed in what two colors?","ref":"Revelation 17:5","type":"ALL_ANSWER","answers":[{"text":"purple and scarlet","points":500},{"text":"blue and gold","points":0},{"text":"red and black","points":0},{"text":"silver and gold","points":0}]},{"q":".. Babylon the great is fallen, is fallen, and is become the habitation of devils ... and a _________ of every unclean and hateful bird","ref":"Revelation 18:2","type":"ALL_ANSWER","answers":[{"text":"song","points":"0"},{"text":"talons","points":0},{"text":"color","points":0},{"text":"cage","points":"500"}]},{"q":"Babylon the Great boasted, \"... I sit a queen, and am no widow, and shall see no ___________.\"","ref":"Revelation 18:7","type":"ALL_ANSWER","answers":[{"text":"defeat","points":"0"},{"text":"death","points":0},{"text":"sorrow","points":"500"},{"text":"comfort","points":0}]},{"q":"Him that sat on the white horse, had a name written on his thigh, what was it?","ref":"Revelation 19:16","type":"ALL_ANSWER","answers":[{"text":"Faithful and True","points":"0"},{"text":"Judge and Faithful Witness","points":0},{"text":"King of kings and Lord of lords","points":"500"},{"text":"Protector of the Weak","points":0}]},{"q":"What is the the fine linen granted to the Bride of Christ?","ref":"Revelation 19:8","type":"ALL_ANSWER","answers":[{"text":"the righteousness of saints","points":500},{"text":"the purity of the crystal see","points":0},{"text":"the sanctification of the ministry","points":0},{"text":"the priesthood's holiness","points":0}]},{"q":"FILL IN THE BLANK: And I heard as it were the voice of a great multitude, and as the voice of many waters, and as the voice of mighty thunderings, saying, Alleluia: for the Lord God ____________________ reigneth.","ref":"Revelation 19:6","type":"ALL_ANSWER","answers":[{"text":"mighty","points":"0"},{"text":"Holy","points":0},{"text":"omnipotent","points":"500"},{"text":"righteous","points":0}]},{"q":"What 2 names are given to identify the nations deceived by the devil and joining in battle against God's people and the beloved city?","ref":"Revelation 20:8","type":"ALL_ANSWER","answers":[{"text":"Gog and Magog","points":500},{"text":"Nineveh and Babylon","points":0},{"text":"Rome and Italy","points":0},{"text":"Jerusalem and Washington","points":0}]},{"q":"During the millennial reign of Christ some will be resurrected to reign but others will have to wait until after. Who will be the ones resurrected in this first resurrection?","ref":"Revelation 20:4,5","type":"BUZZER","answers":[{"text":"old testament prophets","points":"0"},{"text":"tribulation martyrs beheaded for Christ","points":"500"},{"text":"the 12 apostles","points":0},{"text":"Jews","points":0}]},{"q":"During what time is the devil bound temporarily so he cannot deceive nations?","ref":"Revelation 20:3","type":"ALL_ANSWER","answers":[{"text":"first half of tribulation","points":"0"},{"text":"second of half of tribulation","points":0},{"text":"during ministry of the 2 witnesses","points":0},{"text":"millennial reign of Christ","points":"500"}]},{"q":"The 12 Foundations of the wall of New Jerusalem included:","ref":"Revelation 21","type":"ALL_ANSWER","answers":[{"text":"gold and silver","points":"0"},{"text":"topaz and amethyst","points":"500"},{"text":"steal and aluminum","points":0},{"text":"iron and emerald","points":0}]},{"q":"What is the size of the wall of New Jerusalem?","ref":"Revelation 21:17","type":"ALL_ANSWER","answers":[{"text":"12,000 cubits","points":"0"},{"text":"1,000 cubits","points":0},{"text":"three score cubits","points":0},{"text":"144 cubits","points":"500"}]},{"q":"What are the dimensions of the New Jerusalem (long, wide and high)?","ref":"Revelation 21","type":"ALL_ANSWER","answers":[{"text":"12,000 furlongs","points":500},{"text":"1,200 furlongs","points":0},{"text":"120 furlongs","points":0},{"text":"12 furlongs","points":0}]},{"q":"In the listed \"no mores\" of the heaven and new earth in Revelation 21, which 1 of the following belongs?","ref":"Revelation 21","type":"ALL_ANSWER","answers":[{"text":"no music","points":"0"},{"text":"no animals","points":"0"},{"text":"no candle","points":"500"},{"text":"no food","points":0}]},{"q":"In Revelation 21, what did John see coming down from heaven prepared as a bride adorned?","ref":"Revelation 21:2","type":"ALL_ANSWER","answers":[{"text":"Jericho","points":"0"},{"text":"Saints","points":0},{"text":"New Jerusalem","points":"500"},{"text":"Bethlehem","points":0}]},{"q":"What were the leaves of the tree of life for?","ref":"Revelation 22:2","type":"ALL_ANSWER","answers":[{"text":"the healing of the nations","points":500},{"text":"the peace of Jerusalem","points":0},{"text":"the sanctifying of the church","points":0},{"text":"food for animals in heaven","points":0}]},{"q":"How many times in Revelation 22 does Jesus say \"I come quickly\"?","ref":"Revelation 22","type":"BUZZER","answers":[{"text":"7","points":"0"},{"text":"3","points":"500"},{"text":"8","points":0},{"text":"2","points":0}]},{"q":"Why was John told not to seal the prophecy of this book?","ref":"Revelation 22:10","type":"ALL_ANSWER","answers":[{"text":"for the angels would seal it","points":"0"},{"text":"it was to be sealed at John's death","points":0},{"text":"the antichrist would be the one to seal it","points":0},{"text":"for the time is at hand","points":"500"}]},null,{"q":"FILL IN THE BLANK.  And he shewed me a pure river of water of life, _______________ as crystal, proceeding out of the throne of God and of the Lamb.","ref":"Revelation 22:2","type":"ALL_ANSWER","answers":[{"text":"clear","points":"500"},{"text":"pristine","points":"0"},{"text":"beautiful","points":0},{"text":"amazing","points":"0"}]},null,{"q":"List the 7 Churches of Asia (50%) in order (50%) addressed in Revelation 2 and 3.","ref":"","type":"NOT_MULTIPLE_CHOICE","answers":[{"text":"Ephesus, Smyrna, Pergamos, Thyatira, Sardis, Philadelphia, Laodicea.","points":"1000"},{"text":"","points":0},{"text":"","points":0},{"text":"","points":"0"}]},{"q":"(Name both churches) The deeds of the Nicolaitans in _[church name]_ became doctrines of Nicolaitans in _[church name]_.","ref":"","type":"NOT_MULTIPLE_CHOICE","answers":[{"text":"Ephesus and Pergamos","points":"1000"},{"text":"","points":0},{"text":"","points":0},{"text":"","points":"0"}]},{"q":"Match what was in the hand of each of the 4 horsemen of the first 4 seals with their respective color?","ref":"","type":"NOT_MULTIPLE_CHOICE","answers":[{"text":"1. Bow-White, 2. Great Sword-Red 3. Balances-Black 4. Unsaid-Pale/ashen or pale green or yellowish green","points":"1000"},{"text":"","points":0},{"text":"","points":0},{"text":"","points":"0"}]},{"q":"What comparisons are made with the SHAPES, HEADS, FACES, HAIR, and TEETH of the locusts from out of the pit?","ref":"Revelation 9:7","type":"NOT_MULTIPLE_CHOICE","answers":[{"text":"shapes like unto horses prepared unto battle ... heads like gold crowns ... faces as the faces of men ... hair as the hair of women ... teeth as the teeth of lions","points":"1000"},{"text":"","points":0},{"text":"","points":0},{"text":"","points":"0"}]},{"q":"After the seventh angel poured out his vial into the air; and there came a great voice out of the temple of heaven, from the throne, saying what? ","ref":"","type":"NOT_MULTIPLE_CHOICE","answers":[{"text":"It is done.","points":"1000"},{"text":"","points":0},{"text":"","points":0},{"text":"","points":"0"}]}]},{"type":"md","value":"<div id=\"l\"></div>\n\nRevelation 16:19 and 14:8 have already declared Babylons fall. In Revelation 17 and 18, the fall of Babylon is carefully detailed.\n\n> Revelation 14:8 &mdash; And there followed another angel, saying, Babylon is fallen, is fallen, that great city, because she made all nations drink of the wine of the wrath of her fornication.\n\n> Revelation 16:19 &mdash; And the great city was divided into three parts, and the cities of the nations fell: and great Babylon came in remembrance before God, to give unto her the cup of the wine of the fierceness of his wrath. \n\n## Fall of Religious Babylon [17]\n\nRevelation 17 tells about the judgment of the False Church who is called the &quot;Mother of Harlots&quot; because of her spiritual adultery. Harlotry is symbolic of false worship or the worship of idols (idolatry).\n\nThis woman represents a one-world church that will be attended with lewdness. Religion has never been so rich, so powerful, united and so unclean. Before her judgment, she is in a moral and spiritual wilderness, but advanced in achievements of science, materialism and humanistic philosophy.\n\n### 1. The Time of the Judgment\n\n> Revelation 17:3&mdash;So he carried me away in the spirit&hellip;\n\n> Revelation 1:10&mdash;I was in the Spirit on the Lord's day&hellip;\n\nThe False Church will suffer this prophesied judgment in the End-Time. She is an End-Time False Church and will face her judgment in the time of the end.\n\n### 2. The Place of the Judgment\n\n> Revelation 17:3&mdash;&hellip;into the wilderness&hellip;\n\nIn a general sense, the wilderness is a place of testing and more specific to Revelation it is symbolic of the tribulation period that takes place just before the Lord returns (12:14). This false church will be in control for most of the tribulation hour.\n\n### 3. The Receiver of the Judgment\n\n> Revelation 17:3&mdash;&hellip;and I saw a woman&hellip;\n\nIn relation to Christ, the Scripture refers to the church as a woman (1 Corinthians 11:3; 2 Corinthians 11:2; Ephesians 5:24-32). God illustrated His desired relationship with His people with the relationship of a husband and wife.\n\nIn Revelation 12, we read about the True Church (<a href=\"/courses/revelation/the-sun-clothed-woman_73\">&quot;The Sun-Clothed Woman&quot;</a>). Now, in Chapter 17, we read about the judgment on the False Church.\n\n### 4. The Outstanding Details of the Judgment\n\n#### a. She is a Mother (vs.5)\n\nAs she is a mother, she is producing something. The True Church produced a singular and unified Man Child (12:5), as well as, truth and strength. The False Church produces a divided and plurality of harlots (17:5), as well as, error and weakness.\n\n#### b. She is Sitting (vs. 1,3,9)\n\nSitting is a position of control or rule. As a king or judge sits in their authority. She is a dictator over <strong>the people and nations</strong> (vs. 1,15 &quot; many waters&quot;) and <strong>the beast</strong> (vs. 1,3,8,11-13,16 this beast is the anti-christ).\n\nShe sits with overwhelming control of the one-world government that is evil and sinful. The False Church rides in control on the scarlet colored beast. She is therefore in control of the nations.\n\n#### c. She is Clothed (vs. 4)\n\nThe Bride of Christ is dressed in fine linen clean and white which is the righteousness of saints (Revelation 19:8). This woman is dressed in the attire of a harlot.\n\n- She is arrayed in purple which is the color of royalty. This woman is not truly royal, but is a hypocrite.\n\n- Not only is color of the beast scarlet, but she is also clothed in scarlet. Scarlet is the color of sin.\n\n> Isaiah 1:18&mdash;&hellip;though your sins be as scarlet&hellip;</p>\n\nShe revels in all that is an abomination to God. Read Proverbs 6:16-19; Deuteronomy 22:5.\n\n- She is decked with gold and precious stones and pearls.\n\nThere are two Scriptural aspects to Gold. In the positive, gold speaks of divinity and the perfect nature of God. In the negative, gold is the best of the riches of the world. She is not godly or divine, but she is rich with the riches of the world.\n\nAll her ornaments are form the world. Her inspiration comes form the pagan and godless cultures of the world.\n\n#### d. She Has a Cup in Her Hand (vs. 4)\n\nThis not the cup of the Lord, but is the cup of devils. This golden cup is filled with the abominations and filthiness of her fornication. She is not sharing the Gospel, but it is &quot;another gospel&quot;.\n\n> vs. 2&mdash;With whom the kings of the earth have committed fornication, and the inhabitants of the earth have been made drunk with the wine of her fornication.\n\nShe is very influential. She has corrupted many others with the teaching of her false religion (1 Timothy 4:1).\n\n#### e. She has a Name (vs. 5)\n\n> MYSTERY, BABYLON THE GREAT, THE MOTHER OF HARLOTS AND ABOMINATIONS OF THE EARTH.\n\n#### f. She is Drunk (vs. 6)\n\nShe is drunk with precious blood of martyrs who are the saints of the Lord Jesus Christ. This was all a great (megas) mystery (admiration) to John.\n\n#### g. She has an End (vs. 16)\n\nThere is a two-foldness to her judgment. Her fall is mentioned twice (17:16 and 18:21).\n\nShe is hated and overthrown. At first the beast carries the woman (vs. 3) and the torn horns hate her and make her desolate and naked and then burn her.\n\nShe had her time of rule and it glittered like gold, but &quot;pay day&quot; always comes for the enemies of God. With every blasphemous act or false doctrine she added to the cup of her own judgment.\n\n> Revelation 17:16&mdash;&hellip;burn her with fire.\n\n\n\n\n","lesson":12},{"type":"md","value":"## Those that are with the Lamb (17:14)\n\nIn the midst of judgment within a spiritual wilderness, we see a glorious promise.\n\n> Revelation 17:14 &mdash; These shall make war with the Lamb, and the Lamb shall overcome them: for he is Lord of lords, and King of kings: and they that are with him are called, and chosen, and faithful.\n\nWe see the action and the resulting end of the False church, Antichrist and the powers that rule with him. They make war with the Lamb and the Lamb will overcome them! For He is Lord of lords and King of kings. There are those who set themselves in opposition to the Great King, but in this verse we also see some are \"with Him\". Herein is a promise to some, that they can overcome WITH the Lamb. These are the Called, Chosen and Faithful of God. These are the army of the Lamb.\n\n### Called\nDefinition of \"called\": GREEK - kletos - adjective - invited, appointed\n\n> Romans 1:7&mdash;To all that be in Rome, beloved of God, called to be saints: Grace to you and peace from God our Father, and the Lord Jesus Christ.\n\n- Called to Salvation. All are invited to salvation (Matthew 11:28; 20:16; 22:14; 2 Thessalonians 2:13).\n- Called to be Saints. We are saints \"by calling\" (Jeremiah 31:3; John 6:44; 12:32; Romans 1:7; 8:28; 1 Corinthians 1:2; Jude 1).\n- Called According to His Purpose.\n\n> Romans 8:28&mdash;And we know that all things work together for good to them that love God, to them who are the called according to his purpose.\n\n### Chosen\n\nDefinition of \"chosen\": GREEK - eklektos - adjective - chosen out, select, favorite.\n\n- Luke 23:35; 1 Peter 2:4,9\n- Not all are Chosen (Matthew 22:14)\n- Chosen Before the World (Ephesians 1:4)\n- To Pick Out. To hand pick and choose for oneself. This does not imply the rejection of what is not chosen (Mark 13:20; Luke 6:13; John 15:16; Ephesians 1:4; James 2:5).\n- To Take that which May be Taken. Taking that which is eligible or suitable to be taken. The choice is made according to suitability (Matthew 12:18; Psalm 25:12).\n- The Chosen are the Elect (1 Peter 2:9)\n\n### Faithful\n\nDefinition of \"faithful\": GREEK - pistos - verb - trustworthy, true, reliable, loyal, believe, faith.\n\n- Passive: Meaning Faithful in the sense of to be trusted and reliable. Matthew 24:45; 25:21-23; Acts 16:15; 1 Corinthians 4:2; Ephesians 6:2; Colossians 1:7; 1 Timothy 1:12; Hebrews 3:5\n- Active: Faithful in the sense of actively believing and trusting. John 20:27; Acts 16:1; 2 Corinthians 6:15; Galatians 3:9.</p>\n- The Faithful will be wise\n- The Faithful will be good\n- Faithful to God\n- Faithful to the Truth\n\n### Conclusion\n\nThese are not separate groups (Called, chosen, faithful), but is a description of those who are WITH and overcome WITH the Lamb.\n\n> 2 Timothy 2:12 &mdash; If we suffer, we shall also reign with him: if we deny him, he also will deny us:","lesson":12},{"type":"md","value":"# Fall of Political and Commercial Babylon (Ch. 18)\n\n## The Uniting of Babylon the Great\n\nBabylon is an unholy union of the religious, commercial and political systems of the world. The system will be judged in two stages (17:16 and 18:21): Religious (Ch. 17) and Commercial/Political (Ch. 18).\n\nIn the judgment upon the religious part of the system (Ch. 17), she is put down and taken over by the Antichrist. She will for a season \"rule\" over the kings of the earth (17:3,18) &mdash; after her judgment, we see who is really controlling who. These kings will turn on her being inspired by God [as a sovereign act of judgment]. Those in whom she trusted so much and with whom had become mutually enriched, will rejoice to finally be rid of her.\n\n> Revelation 17:3 &mdash; So he carried me away in the spirit into the wilderness: and I saw a woman sit upon a scarlet coloured beast, full of names of blasphemy, having seven heads and ten horns.\n\n> Revelation 17:13, 16, 17 &mdash; 13 These have one mind, and shall give their power and strength unto the beast. 16 And the ten horns which thou sawest upon the beast, these shall hate the whore, and shall make her desolate and naked, and shall eat her flesh, and burn her with fire. 17 For God hath put in their hearts to fulfil his will, and to agree, and give their kingdom unto the beast, until the words of God shall be fulfilled.\n\nThis will unite religion and commerce, making the State (Antichrist) supreme. Babylon the Great, in final revelation, is a city ruled over by the Antichrist as both the religious and political head. She becomes abundantly rich in carnal wealth for her aid to the devil but she will ultimately suffer greatly for her supporting role in the Antichrist's efforts.\n\n## Placing Babylon\n\nBabylon is a place as well as a system. Presently, there is no city &quot;Babylon&quot;. If the ancient city of &quot;Babylon&quot; (50 miles south of modern Iraq) is to be included in this judgment, Babylon as a city must first be rebuilt.\n\nBabylon is mentioned 287 times in the Scriptures, more than any other city except Jerusalem.\n\nThe more important detail concerning Babylon is not where on a map can we place her, but what is she guilty of that would incur such severe action from God. Babylon in Chapters 17 and 18, is at the very least symbolic of both a religious system (ch. 17) and a commercial system (ch. 18) that made themselves enemies of God.\n\nThe concept of Babylon is greater than Revelation 17-18 and the Antichrists reign. Babylon was present before and in Johns day (typified by Rome), in our day, and throughout history, as the world system. But under the Antichrist, Babylon (in both its religious and commercial aspects) will have influence over the earth as never before\n\n- Cain Genesis 4:16,17 Cain went out from the presence of the LORD ... Cain built a city. Cain being uninterested in being ruled by God and attempting to ensure his legacy of self rule by building cities\n- Tower of Babel - Resisting the Sovereignty of God\n- Compare Revelation 18:21-24 & Jeremiah 51:63,64\n\n## Normalization of Babylon\n\nBabylon will be a \"one world\" system that by nature of its pervasiveness will effect everything. Despite her extremes, excesses, perversion and corruption, she will become \"normalized' in a reversed sense. Instead of bringing her to a standard of \"normal\", normal will be redefined to be in harmony with her standards. Any rebellion against the system and her corruption, will be viewed as \"crimes against humanity\". \n\nFor example:\n\n- Refusing the Mark of the Beast to buy, trade and sale will be characterized as criminal to the level of worthy of capital punishment.\n- Refusing to worship the Beast or his image, will be characterized idolatry.\n- To speak the TRUTH of God's Word, will be condemned as spreading lies and false information.\n- State sponsored corruption will be accepted \"as they way things are\" and any rebellion (verbal, action, inaction) against Babylon will be characterized as acts of terrorism.\n\nThough for a season Babylon will be the standard of the world, she will be judged for her corruption.\n\n<h2>The Announcement of her Judgment (vs. 1-8)</h2>\n\n<h3>The Announcing Angel, vs. 1-3</h3>\n<p>A glorious messenger appears from out of heaven.</p>\n<h4>He Comes with Great Authority</h4>\n<p>All power and authority truly belongs to God! (Daniel 7:14; John 5:26-27; 1 Corinthians 15:24)</p>\n<blockquote>\n<p>John 5:25&mdash;Verily, verily, I say unto you, The hour is coming, and now is, when the dead shall hear the voice of the Son of God: and they that hear shall live.</p>\n</blockquote>\n<h4>The Earth is Lighted with His Glory</h4>\n<p>This is never said describing created beings, but is often said of God! (Psalm 72:18,19; Isaiah 6:1-3; Ezekiel 43:2; Revelation 1:13-16; 21:23)</p>\n<h4>He Cries Mightily with a Strong Voice</h4>\n<h3>The Calling Out of God's People, vs. 4-8</h3>\n<blockquote>\n<p>Revelation 18:4&mdash;And I heard another voice from heaven, saying, Come out of her, my people, that ye be not partakers of her sins, and that ye receive not of her plagues.</p>\n</blockquote>\n<p>Before the mighty word goes into effect, a voice from heaven (probably, the Father) says come out of her, my people. His people are warned to avoid getting caught up in the marketing of the evil system. (An effective advertisement is one that convinces you that you need something.) </p>\n<ul>\n<li>Come Out of her</li>\n<li>Call on Jesus </li>\n<li>Repent of Sin</li>\n<li>Be Born of the Spirit (Not a soul-ish or intellectual thing, but a spiritual experience.)</li>\n</ul>\n\n<p>Satans really merchandise is the souls of men. He takes advantage of and seeks to rob a man of his soul. What do we want? Faith or Feeling. Bible or Psychology. (1 Corinthians 13:45) The devil employs all manner of means in this market: business, religion, drugs, sex, gossip, lustful and rebellious music, </p>\n\n<h2>The Reaction to Her Judgment (vs. 9-20)</h2>\n\n<p>The fall of Babylon is one of the most marvelous events of all time (i.e., the flood, Sodom and Gomorrah). Consider how this would effect the whole world and even how it would effect you. Her fall is a great disappointment to many as just at her height of success she is destroyed. All the schemes of human progress are left disappointed and many will lament. , but there are mixed reactions to her judgment for two worlds are involved. There some who will rejoice while others are crying.</p>\n\n<blockquote>\n<p>Revelation 18:9,20&mdash;And the kings of the earth, who have committed fornication and lived deliciously with her, shall bewail her, and lament for her, when they shall see the smoke of her burning, 20 Rejoice over her, thou heaven, and ye holy apostles and prophets; for God hath avenged you on her.</p>\n</blockquote>\n<h3>Lamentation</h3>\n<h4>Lamenting of Royalty, vs. 9-10</h4>\n<h4>Lamenting of Merchants, vs. 11-16</h4>\n<h4>Lamenting of Shipmasters, vs. 17-19</h4>\n<p>But while these lament, a grand jubilee fills the sky!</p>\n\n<h3>Rejoicing</h3>\n<h4>The Heavenly Beings Rejoice</h4>\n<h4>The Apostles Rejoice</h4>\n<h4>The Prophets Rejoice</h4>\n\n<h2>After her Fall (vs. 21-24)</h2>\n\n> Jer 51:63 And it shall be, when thou hast made an end of reading this book, that thou shalt bind a stone to it, and cast it into the midst of Euphrates: 64 And thou shalt say, Thus shall Babylon sink, and shall not rise from the evil that I will bring upon her: and they shall be weary. Thus far are the words of Jeremiah.\n\n> Re 18:21 And a mighty angel took up a stone like a great millstone, and cast it into the sea, saying, Thus with violence shall that great city Babylon be thrown down, and shall be found no more at all. 22 And the voice of harpers, and musicians, and of pipers, and trumpeters, shall be heard no more at all in thee; and no craftsman, of whatsoever craft he be, shall be found any more in thee; and the sound of a millstone shall be heard no more at all in thee; 23 And the light of a candle shall shine no more at all in thee; and the voice of the bridegroom and of the bride shall be heard no more at all in thee: for thy merchants were the great men of the earth; for by thy sorceries were all nations deceived. 24 And in her was found the blood of prophets, and of saints, and of all that were slain upon the earth.","lesson":12},{"type":"md","value":"# Introduction to Revelation\n\n> 1:1 says \"&hellip;he sent and signified it by his angel unto his servant John.\" \"Signified\" is the Greek word \"Semaino\" meaning to give a sign or to express or reveal by signs. God in his infinite wisdom has chosen to use the language of symbolism and imagery to communicate this Revelation.\n\nHow can we unlock the symbolism of this book? Mainly by comparing scripture with scripture (2 Peter 1:20) do we understand its symbolism. This Revelation is profoundly positioned as the last book of the Bible. It not only contains prophecy of last things, but it is in its nature a climax to all Biblical revelation. We in part find understanding of the symbolism in Revelation by understanding previously given symbolism.\nSome examples include: 1) The Four Living Creatures Ezekiel 1:5; Revelation 4:6 2) The 7 Churches of Asia were both literal and symbolic. As the New Testament Epistles were relevant to a first century Church so they are still relevant today. 3) Water of Life John 4:14; Revelation 21:6\nThis Revelation with all its symbolism was given to John by God's \"angel\". John himself was puzzled as to the role of this \"angel\" and eventually falls at his feet in 22:8 to worship him. In verse 9, the angel rebuked him saying he was only a \"fellow servant\" and that John must only \"worship God\". The Believer must keep in constant remembrance amidst all the majesty of God's Grace that all the glory belongs to God and we are just \"His messengers\".\n\n## The Scribe of this Book (1:2)\n\n> Revelation 1:1 &hellip;unto His servant John 2 Who bare record of the word of God, and of the testimony of Jesus Christ, and of all things that he saw.\n\n### The Apostle John\n\n### He bare record (1:2; John 1:1-14)\n\n### He gave witness (I John 1:1-3; 20:31)\n\n## The Value of this Book (1:3)\n\n### It is rewarding\n\n\"Blessed\" - happy, spiritually prosperous, one to be envied\n\n#### \"He that readeth\"\n\n#### \"They that hear the words\"\n\n#### \"And keep those things which are written\"\n\n### It is enlightening (22:10)\n\n> Revelation 22:10--Seal not the sayings of the prophecy of this book: for the time is at hand.\n\n## The Premise of this Book(1:4-9)\n\nWe will search out the source, subject, substance and circumstances of the book of Revelation.\n\n### The Sources of this Revelation (1:4,5)\n\n#### John\n\nHe is the writer - the Scribe\n\n#### The Father\n\n> \"Which is, which was, and which is to come.\"\n\n#### The Spirit\n\n> \"From the seven Spirits which are before His throne;\" \n\nSEVEN: \"Hepta\" - signifying to be full - \"Pneuma\" \"Spirit\" . Therefore, meaning: a \"Seven-fold spirit\". God is described here in the fullness of His office and powers.\n\n#### The Son\n\n> \"And from Jesus Christ, who is the faithful witness, and the first begotten of the dead, and the prince of the kings of the earth.\"\n\n### The Subjects of this Revelation\n\n#### The Churches\n\n> \"To the Seven Churches in Asia\" v. 4 not church but \"churches\".\n\n#### Their location (Asia) - v. 4\n\n#### Their need - v. 7\n\nEach church had unique needs and problems so a special message is addressed to each of the seven Churches in Asia (Ephesus - Smyrna - Pergamos - etc.)\n\n### The Substance of this Revelation\n\n#### Grace - v 4 G-R-A-C-E: God's Riches At Christ's Expense\n#### Peace - v. 4 Peace from God brings peace with God. Peace with God brings peace with man.\n#### Consolation - v. 7 \"Behold He cometh\"\n#### Confirmation - v. 8 He will keep His word with you.\n\n### The Circumstances of this Revelation v.9\n#### Common Brotherhood - \"your brother\"\n#### Common Suffering - \"companion in tribulation\"\n#### Common Royalty - \"in the kingdom\"\n#### Common Promise - \"patience of Jesus Christ\"\n#### Common Place - \"Patmos-a place of exile\"\n\nThe Isle of Patmos was a place of EXILE with barren rocks that was located in the open sea. It was in this unfriendly place the awesome revelation was written.\n","lesson":1},{"type":"md","value":"## Outline of Revelation \n\n<ul>\n\t<li>The Church Age</li>\n\t<ul>\n\t\t<li>Pentecost: Birth of the Church --> John Exiled on Isle of Patmos</li>\n\t\t<li>Vision of the Glorified Christ and His Church</li>\n\t\t<li>7 Letters to 7 Churches: Ephesus, Smyrna, Pergamos, Thyatira, Sardis, Philadelphia, Laodicea.</li>\n        <li>Near the end of the Church age will be a TRANSLATION of the Bride and its conclusion will be the RAPTURE of the Church</li>\n\t</ul>\n\n\t<li>7 Years of Tribulation</li>\n\n\t<ul>\n\t\t<li>First 3.5 Years of Tribulation</li>\n\t\t\t<ul>\n\t\t\t\t<li>Concludes withe Rapture of the Church</li>\n\t\t\t\t<li>Vision of the Throne</li>\n\t\t\t</ul>\n\t\t<li>Second 3.5 Years of Tribulation</li>\n\n\t\t<ul>\n\t\t\t<li>7 Seals</li>\n\t\t\t<ul>\n\t\t\t\t<li>Seal #1 White Horse</li>\n    \t\t\t<li>Seal #2 Red Horse</li>\n    \t\t\t<li>Seal #3 Black Horse</li>\n    \t\t\t<li>Seal #4 Pale Horse</li>\n    \t\t\t<li>Seal #5 Martyrs</li>\n    \t\t\t<li>Seal #6\tCataclysmic Physical Events</li>\n    \t\t\t<li>Sealing of 144,000</li>\n    \t\t\t<li>Palm Bearing Multitude</li>\n    \t\t\t<li>Seal #7 Half-Hour of Silence in Heaven</li>\n\t\t\t</ul>\n\t\t\t<li>Angels and 7 Trumpets</li>\n\t\t\t<ul>\n\t\t\t\t<li>\"Another\" Angel</li>\n    \t\t\t<li>Trumpet #1 Hail and Fire mingled with blood</li>\n    \t\t\t<li>Trumpet #2 Something (Meteor) like a Burning Moutain Plunges in the Sea</li>\n    \t\t\t<li>Trumpet #3 A Star Called Wormwood</li>\n    \t\t\t<li>Trumpet #4 1/3 of Sun, Moon and Stars Darkened and Announcement of Greater Judgment (Woe, Woe, Woe)</li>\n    \t\t\t<li>Trumpet #5 Woe #1 The Fallen Star and the Locusts</li>\n    \t\t\t<li>Trumpet #6 Woe #2 The Release of Four Bound Angels &amp; thier Army of Horsemen</li>\n    \t\t\t<li>Cloud-Robed Angel</li>\n    \t\t\t<li>The Measuring of the Temple of God</li>\n    \t\t\t<li>The Two Witnesses</li>\n    \t\t\t<li>Trumpet #7 Woe #3 The Coming of the Lord</li>\n    \t\t\t<ul>\n    \t\t\t\t<li>The Attending Manifestations</li>\n    \t\t\t</ul>\n\t\t\t</ul>\n\t</ul>\n\n    \n\t\t\t<li><a href=\"#a-war-in-heaven-and-a-war-on-earth\">A War in Heaven and a War on Earth</a></li>\n\t\t\t<ul>\n\t\t\t\t<li>Sun-Clothed Woman</li>\n    \t\t\t<li>Man-child</li>\n    \t\t\t<li>Dragon</li>\n    \t\t\t<li>Remnant of the Woman's Seed</li>\n\t\t\t</ul>\n\t\t\t<li>A Beast out of the Sea</li>\n\t\t\t<li>A Beast ouf the Earth</li>\n\t\t\t<ul>\n\t\t\t\t<li>The Mark of the Beast</li>\n\t\t\t</ul>\n\n\t\t\t<li>The Song of the Redeemed Sung before the Throne</li>\n    \t\t<li>An Angel Preaches the Everlasting Gospel</li>\n    \t\t<li>Another Angel Preaches 'Babylon is Fallen'</li>\n    \t\t<li>Another Angel Warns Against the Mark of the Beast</li>\n\t\t</ul>\n\n\t\t<li>Two Harvests</li>\n\t\t\t<ul>\n\t\t\t\t<li>The Son of Man with a Sharp Sickle. Another Angel Invites 'Thrust in thy sickle, and Reap'. He Thrusts in His Sickle and the Earth Was Reaped</li>\n\t\t\t\t<li>Another Angel Coming Out of the Temple Also havig a Sickle</li>\n\t\t\t\t<li>Another Angel Coming Out from the Altar Cries 'Thrust in thy sharp sickle'</li>\n\t\t\t\t<li>The Angel Thrusts in His Sickle and cast it into the great winepress of the wrath of God - The Blood of the Winepress</li>\t\n\t\t\t</ul>\n\n\t    <li>7 Vials of Definitive and Final Judgments</li>\n    \t\t <ul>\n    \t\t \t<li>7 Angels Come Out of the Temple and One of the Four Beasts Give These Angels 7 Golden Vials</li>\n    \t\t \t<li>Vial #1 Judgment on the Folowers of the Anti-christ</li>\n    \t\t \t<li>Vial #2 Judgment on the Sea</li>\n    \t\t \t<li>Vial #3 Judgment on the Rivers</li>\n    \t\t \t<li>Vial #4 Judgment of the Suns Heat Released</li>\n    \t\t \t<li>Vial #5 Judgment of the Throne of the Beast</li>\n    \t\t \t<li>Vial #6 Judgment of Armageddon</li>\n    \t\t \t<li>Vial #7 Judgment of the Nations</li>\n    \t\t \t<li>Judgment of Mystery Babylon</li>\n    \t\t \t<li>Judgment of Babylon the Great City</li>\n    \t\t </ul>\n\t\t \t\n\t \t<li>Those in Heaven Rejoice at the Previous Judgments</li>\n\t \t\t<ul>\n\t \t\t<li>a great voice of much people in heaven</li>\n\t \t\t<li>the four and twenty elders</li>\n\t \t\t<li>the four beasts</li>\n\t \t\t<li>a voice came out of the throne, saying, Praise our God, all ye his servants, </li>\n\t \t\t<li>the voice of a great multitude, and as the voice of many waters, and as the voice of mighty thunderings</li>\n\t \t\t<li>the marriage of the Lamb is come, and his wife hath made herself ready</li>\n\t \t\t<li>Blessed are they which are called unto the marriage supper of the Lamb</li>\n\t \t\t</ul>\n\n\t \t<li>The Great War</li>\n\t \t\t<ul>\n\t \t\t\t<li>of Him that Sat on the White Horse and the Beast with the Kings of the Earth</li>\n\t \t\t\t<li>Heaven Opened and 'Faithful and True' on a White Horse</li>\n\t \t\t\t<li>King of Kings</li>\n\t \t\t\t<li>The Supper of the Great God</li>\n\t \t\t</ul>\n\n    \t\t\n    \t\t\n\n    \t\t\t\n\n\n\n\n    <li>1000 Year Reign<li>\n    \t<ul>\n    \t\t<li>Devil Bound</li>\n    \t\t<li>Reign of Righteousness</li>\n    \t\t<li>Devil Released and Deceives</li>\n    \t\t<li>A Great and Final Rebellion</li>\n    \t\t<li>The Last Judgment/Great White Throne Judgment</li>\n    \t</ul>\n\n    <li>All Things New</li>\n    \t<ul>\n    \t<li>New Heaven and New Earth</li>\n    \t<li>New Jerusalem</li>\n    \t<li>one of the seven angels which had the seven vials full of the seven last plagues, 'I will shew thee the bride, the Lamb's wife'</li>\n    \t<li>River of Life Flowing from the Throne</li>\n    \t<li>A Tree of Life</li>\n    \t<li>New, Different</li>\n    \t\t<ul>\n    \t\t\t<li>No More Curse</li>\n    \t\t\t<li>No More Sinners</li>\n    \t\t\t<li>No Night</li>\n    \t\t\t<li>No need of a candle</li>\n    \t\t</ul>\n    \t</ul>\n\n    <li>Closing of the Book 'I Come Quickly'</li>\n    <ul>\n    \t<li>These sayings are faithful and true: </li>\n    \t<li>the things which must shortly be done.</li>\n    \t<li>Behold, I come quickly</li>\n    \t<li>blessed is he that keepeth the sayings of the prophecy of this book.</li>\n    \t<li>John Falls Down and Worships at the feet of the Angel</li>\n    \t<li>Seal not the sayings of the prophecy of this book: for the time is at hand.</li>\n    \t<li>Blessed are they that do his commandments,</li>\n    \t<li>the Spirit and the Bride say, Come. And let him that heareth say, Come. And let him that is athirst come. And whosoever will, let him take the water of life freely</li>\n    \t<li>A Curse on those Who Add or Take Away from the Words of this Book</li>\n    \t<li>I Come Quickly</li>\n    </ul>\n     </li>\n      </li>\n</ul>","lesson":1},{"type":"md","value":"<h1 id=\"E\">E. Who is Worthy to Open Book of Seven Seals? [5]</h1>\n\n\n{/*<!-- chapter 5 fix numberings-->*/}\n\n<h1>The Sealed Book, vs. 1-4</h1>\n\n<p>This chapter continues the description of the vision in chapter four. The scene is still the throne, the Elders, the Living creatures.</p>\n\t<p>This prophecy is in connection with the Church, but not of the Church. Also, this prophecy has its description given in Heaven, but its fulfillment on the earth.</p>\n\n<h2>The Position of the Book</h2>\n<h3>v. 1 \"In the right hand\"</h3>\n<p>The place of power.</p>\n<h3>v. 1 \"Of Him that sat on the throne.\"</h3>\n<p>The place of rule of authority.</p>\n<h2>The Characteristics of the Book</h2>\n<h3>v. 1 \"A book written within\"</h3>\n<p>A scroll - about judgment</p>\n<p>The book contained a revelation and demonstration of things to come at the consummation of this present age after the Rapture of the Church.</p>\n<h3>v. 1 \"On the backside, sealed with seven seals\"</h3>\n<p>Reserved judgment. This is not a familiar judgment seen. This is an exceptional administration of justice never before witnessed.</p>\n<blockquote>Reserved unto the Day of Judgment</blockquote>\n<h2>The Dignity of the Book</h2>\n<h3>The question by the angel</h3>\n<blockquote>v. 2 \"Who is worthy to open the book\"</blockquote>\n<h3>The answer to the question</h3>\n<blockquote>v. 3 \"No man in heaven, or in earth, neither under the earth,was able to open the book, neither to look therein.\"</blockquote>\n<p>Notice also that this \"strong\" angel is not able to open the book either. (powerful, forceful, boisterious, mighty)</p>\n<h3>John's reaction to this fact</h3>\n<blockquote>v. 4 \"And I wept much\"</blockquote>\n<p>Because of three things -</p>\n<h4>None found \"worthy\" to \"open the book\"</h4>\n<h4>None found worthy to \"read the book\"</h4>\n<h4>None found worthy to \"look thereon\"</h4>\n<h2>The Time of the Opening of the Book</h2>\n<p>After the Rapture, 4:1</p>\n<h2>The Purpose of the Opening of the Book</h2>\n<p>To release the judgments of God on the earth</p>\n\n<h1>The Nature of the Victor, vs. 5-7</h1>\n<p>The Book's Opener is presented as a Victor!</p>\n<blockquote>Revelaton 5:5 - And one of the elders saith unto me, Weep not: behold, the Lion of the tribe of Juda, the Root of David, hath prevailed to open the book, and to loose the seven seals thereof.</blockquote>\n<h3>A lion</h3>\n<blockquote>v. 5 \"Lion of the tribe of Judah\"</blockquote>\n<blockquote>\"The Root of David\"</blockquote>\n<p>Being of the Root of David, his prowess is of no coincidence. It is by PROMISE and therefore Divine appointment.</p>\n <blockquote>Revelation 22:16 - I Jesus have sent mine angel to testify unto you these things in the churches. I am the root and the offspring of David, and the bright and morning star.</blockquote>\n<p>He is both ROOT and OFFSPRING of David! By nature, Jesus is the ROOT of David and by divine incarnation he is the offspring of David. David, the greatly revered and legendary king of Israel, received his authority from this same Jesus!</p>\n\n<h3>A lamb</h3>\n<blockquote>v. 6 \"Stood a lamb\"</blockquote>\n<p>A lion in power, but a lamb in nature. Notice:</p>\n<h4>He is standing</h4>\n<p>Because He is not dead, but alive.</p>\n<p>Because He is accepted.</p>\n<p>Because of us, on our behalf.</p>\n<h4>He is a sacrificial lamb</h4>\n<blockquote>v. 6 \"A lamb as it had been slain\"</blockquote>\n<h4>His has perfect power and strength</h4>\n<blockquote>v. 6 \"Having seven horns\"</blockquote>\n<h4>He has perfect and universal intelligence</h4>\n<blockquote>\"And seven eyes\"</blockquote>\n<blockquote>\"Which are the seven spirits of God\"</blockquote>\n<h4>He has unlimited rights v. 7</h4>\n\n<h1>The Response to The Victor's Worthiness, vs. 8-14</h1>\n<h2>Of the Four Beasts and of the Twenty-four Elders v. 8</h2>\n<h3>Fell down before the Lamb</h3>\n<h3>Having every one of them harps</h3>\n<h3>And golden vials - stored up prayers</h3>\n<h3>Sing a new song</h3>\n<h2>What Their Song Is About</h2>\n<h3>Worthy by right of being</h3>\n<p>He is Lord - Jehovah God</p>\n<h3>Worthy by right of character</h3>\n<blockquote>I Peter 1:19 A lamb without spot or blemish</blockquote>\n<h3>Worthy by right of obedience</h3>\n<p>He earned the right</p>\n<blockquote>\"For thou wast slain, and hast redeemed us to God by thy blood out of every kindred\" etc.</blockquote>\n<blockquote>Luke 23:41 - And we indeed justly; for we receive the due reward of our deeds: but this man hath done nothing amiss.</blockquote>\n<h2>Of the Angels vv. 11,12</h2>\n<h2>Of All Creation v. 13</h2>\n\n{/*<!-- chapter 5 end -->*/}\n\n<h1 id=\"F\">F. The 7 Seals [6; 8:1]</h1>\n\n<h1>Introduction to the Seven Seals</h1>\n<p>This scene of the breaking of the Seven Seals follows after the translation of the Bride, for the elders already have their crowns, (Rev. 4:10). Also this scene comes after the Rapture of the Church. We read of the rapture in type in Rev. 4:1. The Four Beasts or Four Living Creatures which represent \"the Body of Christ\" or the Church are at the Throne, also.</p>\n<h2>The Similarities of the First Four Seals</h2>\n<h3>The Opener of the Seals. \"The Lamb\" vs. 1</h3>\n<p>In Chapter 5, it was dramatically shown that only the Lamb had the power to take the Book and the power and authority to open the book.</p>\n<h3>The Seals Opened</h3>\n<h4>John saw something vs. 1.</h4>\n<p>John saw something before the thunder. Like a flash of lightening before the storm.</p>\n<h4>He heard something.</h4>\n<p>He heard - \"As it were the noise of thunder\".</p>\n<h3>The Command Given. \"Come\"</h3>\n<h4>The Command is Not to John. He is there in the Throne.</h4>\n<h4>The Command is A call into Action. A release of Judgment.</h4>\n<h4>The Command is Repeated. In regard to the first four seals.</h4>\n<h3>The Source of the Command.</h3>\n<p>\"One of the Four Beasts\". The Elders are involved with things concerning heavenly subjects (ch. 5 &amp; 7) and The living Creatures are directly involved with things that are Earthly.</p>\n\n<blockquote>1 Corinthians 6:2 -- Do ye not know that the saints shall judge the world? and if the world shall be judged by you, are ye unworthy to judge the smallest matters? 3 Know ye not that we shall judge angels? how much more things that pertain to this life?</blockquote>\n\n<h2>The Particulars of the Seven Seals</h2>\n\n<h3>The Number Seven</h3>\n<p>There are Seven Seals in Number. This is indicative of the COMPLETENESS of this administration.</p>\n<p>The Seals are arranged in two distinct groups - first there are four and then there are three. A Worldly number that is followed by the heavenly number. These Seven Seals are a Divine judgment on a wicked world</p>\n<h3>The First Four Seals are Distinguished by Horses and Horsemen.</h3>\n<p>Horses are symbolic pictures of the Power of the Almighty.</p>\n<blockquote>2 Kings 6:17 -- And Elisha prayed, and said, LORD, I pray thee, open his eyes, that he may see. And the LORD opened the eyes of the young man; and he saw: and, behold, the mountain was full of horses and chariots of fire round about Elisha. [Job 39:19-25; Zech. 1:8-10; Zech. 6:2-5]</blockquote>\n\n<p>Four Spirits of the heavens from Zechariah 6:</p>\n<blockquote>Zechariach 6:1-8 -- And I turned, and lifted up mine eyes, and looked, and, behold, there came four chariots out from between two mountains; and the mountains were mountains of brass. 2 In the first chariot were red horses; and in the second chariot black horses; 3 And in the third chariot white horses; and in the fourth chariot grisled and bay horses. 4 Then I answered and said unto the angel that talked with me, What are these, my lord? 5 And the angel answered and said unto me, These are the four spirits of the heavens, which go forth from standing before the Lord of all the earth. 6 The black horses which are therein go forth into the north country; and the white go forth after them; and the grisled go forth toward the south country. 7 And the bay went forth, and sought to go that they might walk to and fro through the earth: and he said, Get you hence, walk to and fro through the earth. So they walked to and fro through the earth. 8 Then cried he upon me, and spake unto me, saying, Behold, these that go toward the north country have quieted my spirit in the north country.</blockquote>\n\n<h1>Opening of Seals 1, 2, 3, &amp; 4</h1>\n\n<h2>The Opening of the First Seal 6:1-2</h2>\n<h3>The Releasing of Divine Judgment \"A white horse\"</h3>\n<p>\"White\" Righteousness</p>\n<p>\"Horse\" Divine Power.A righteous judgment of God on the Earth.</p>\n<h3>The Commission of The Rider</h3>\n<p>\"He that sat on him had a bow. \"The \"bow\" is an instrument of war.Not of a destructive war-but of a moral war.Psa. 64:7-9; Hab. 3:8-9; Isa. 26:9.</p>\n<p>\" And a crown was given un to him\" \"And he went forth conquering, and to conquer. \"Psa. 110:3; Isa. 26:9; Dan 12:8-10; Joe12:28-32.</p>\n\n<h2>The Opening of The Second Seal 6:3-4</h2>\n<h3>The Releasing of Divine Vengeance \"A Red Horse\"</h3>\n<p>\"Red\" the color of blood.Wars and Blood shed.</p>\n<p>\"Horse\" Divine Power.The wrath of God on the Earth.</p>\n<h3>The Commission to the Rider.</h3>\n<p>\"Power was given to him.. .to take peace from the earth\" II Chron. 15: 3,5 A type.\"They shall kill one another\"</p>\n<p>\"There was given unto him a great sword.\" \"Rhomphaia \" \"Megas\" -Sword &mdash;Large</p>\n\n<h2>The Opening of The Third Seal. 6:5-6</h2>\n<h3>The Commission of The Third Rider. vs. 5-6</h3>\n<h4>A Black Horse -</h4>\n<p>Black is the symbolic color of dearth and famine.\nJer. 14:1-2; Lam.4:8-10 5:10.\nNotice verse nine &mdash;\nFamines are the scenes of violence and tragedy.\nII Kings 6:25-29; Luke 21:23; Matt. 24:19.</p>\n<h4>\"A Pair of Balances in His Hand.\"</h4>\n<p>Balances are used for exact weighing Indicating that there is a scarcity of food. vs.6Bread by weight always implies scarcity. Lev.26:26; Eze.4:16.When corn is in abundances; it is sold by gross measures and no attention is paid to a few hundred grains.</p>\n<h4>The Settling of Prices. vs. 6</h4>\n<p>This also adds to the fact of scarcity of food.\n\"A Measure of Wheat.\"The word, measure, used here is the Greek word, choenix (which would be about a quart). Davis Dictionary of the Bible. A measure or quart of wheat would be the ordinary allowance of wheat to a man for one day's scanty subsistence.</p>\n<p>The Usual Price.The usual price of a \"choenix\" of wheat was one-eighth of a \"penny\" , or denarius. The price named in the text, being eight times this, indicating further the greatness of the famine.</p>\n<p>The Value of the Penny.In the A.S.R.V. the word \"penny\" is translated \"shilling.\" A shillingin the Greek denotes a coin worth about eight pence, or nearly seventeen cents. Probably the Roman Denarias a coin worth about 17 cents. This was the amount a soldier received for a days pay. Also in Matt. 20:###The ordinary wage for a full days labor, would be (17 cents) a penny. All that a man can do is earn the bread that he will use himself. What if he has a family?</p>\n<p>The Barley By Price. Food of horses and cattle - And also the days subsistence of a slave.\"Hurt not the oil and the wine\" A matter of grace. In judgment God remembers mercy.</p>\n\n<h2>The Opening of The Fourth Seal 6:7-8</h2>\n<p>The Commission of The Fourth Rider vs. 8</p>\n<h3>\"A Pale Horse\" \"Chloros\"</h3>\n<p>It is translated \"Green\" Rev. 8:7,9:4; Mark 6:39.</p>\n<h3>Its Rider -\"Death\" Personified</h3>\n<p>Death, and Hell followed him.</p>\n<h3>Its Power -</h3>\n<p>Power over a fourth part of the earth . Of the total population of the earth one forth will die.</p>\n<h3>Its Manner of Death.</h3>\n<h4>Kill with sword</h4>\n<h4>With hunger</h4>\n<h4>With Death (Pestilence) Jer. 38:2; Eze.6:11; Matt. 24:7; Luke 21:10-11</h4>\n<h4>With Beasts Ezek. 14:21</h4>\n\n<h1>Opening of Seals 5 and 6</h1>\n<h2>The Opening of The Fifth Seal 6:9-11</h2>\n<p>The manifestations under the breaking of this seal differ, in some respects, from the four preceding. There is no expression from the Living ones. There are no 'horsemen or horses. And the burden of the description is exhibited in the results rather than in the processes. Yet, everything belongs to the same general category of trial and suffering. Under this fifth seal, we have added, bloody persecution of those who hold and testify to the truth. The good as well as the bad suffer the hour of trial. Hence, this fifth seal is the picture of Persecution and Martyrdom.</p>\n<p>There are no voices of command from Heaven under this seal, and no messengers despatched from the throne; the reason, bloody persecutions of God's servants come from beneath -not from above. It is the devil who is the murderer. It is Dragon that makes war with the saints. These are martyrs of this particular period of time. Martyrs of the Judgment.</p>\n<h3>The Cause of Their Martyrdom. vs. 9</h3>\n<p>It is not death, but the cause of death, which constitutes a martyr. Millions upon millions perish under the preceding seals, but they are not called marytrs. The cause for which these were slain makes them martyrs.</p>\n<h4>\"Slain for the Word of God\"</h4>\n<p>What they may have rejected in the past, now hold to be the very Word of God .</p>\n<h4>\"And for the testimony which they held. \"</h4>\n<p>(Steadfast adherence to the faith) Probably the testimony of all that was happening. Plagues, disorders, and horrors around them. It will be more than the hardened hearts of scorning unbelievers can bear.</p>\n<h3>Their Estate at That Time vs.9</h3>\n<h4>They are \"Soul s\" Their slaying is not the end.</h4>\n<h4>They can be seen. \"Saw\" Invisible to men in the flesh, seen in the spirit.</h4>\n<h4>They can speak. vs. 10 \"They cried with a loud voice.\"</h4>\n<p>It is wrong to say the dead is in a state of non-existence, unconsciousness, or oblivion. Matt. 10:28; kill body - not soul Luke 20:38; Not the God of the dead. Luke 16:19-31 Rich man and Lazarus. Luke 23: 43 \"To-day\" Consider the experiences of dying believers,and their testimonies.</p>\n<h3>The Message They Convey. vs. 10 (last part)</h3>\n<h4>It is a cry addressed to the throne. \"0 Lord, holy and true\"</h4>\n<h4>It is a cry for fulfillment. It has started why the delay.</h4>\n<h3>The Response To Their Message. vs. 11</h3>\n<h4>They were given White Robes.</h4>\n<p>They were approved and precious</p>\n<h4>They were to rest awhile</h4>\n<p>They were to rest in Him</p>\n<h4>The reason for their rest.</h4>\n<p>There were others God wanted to make it. \"Until their fellow-servants also and their brethren, that should be killed as they were, should be fulfilled. \"</p>\n<h2>The Opening of The Sixth Seal. 6:12-17</h2>\n<h3>Fearful Physical Events</h3>\n<h4>\"A great earthquake\"</h4>\n<p>A great shaking -applied to the shaking of a fig tree- everything will be shaken.</p>\n<h4>\"Sun became black \"</h4>\n<p>\"As sackcloth of hair\"</p>\n<h4>\"The moon became as blood \"</h4>\n<p>Joe12:31; Matt 24:29; Mark 13:24-26; Luke 21:25; Acts 2:19-21</p>\n<h4>\"The Stars Fall \"</h4>\n<h4>The Effect on Earth of These. Starts vs. 14</h4>\n<h3>The Effects of these Events on Humanity. vs. 15-17</h3>\n<h4>The General Condition of Society</h4>\n<p>Kings -great men -rich men - chief captains etc.</p>\n<h4>The Security is Gone.</h4>\n<p>\"hid themselves\"</p>\n<h4>They realized the source of these events. vs. 16</h4>\n<blockquote>Hide us from the face of Him that sitteth on the throne, and from the wrath of the Lamb.</blockquote>\n\n\n\n<h1 id=\"G\">144,000 [7:1-12]</h1>\n\n<h1>The Sealing of the 144,000. 7:1-8</h1>\n<p>The judgment has begun, and has progressed through a number of its most important stages, but grace has not entirely departed. The sealing must take place before the judgment can continue. vs. 1-3</p>\n<h2>Who The 144,000 Are vs. 4</h2>\n<p>\"Of all the tribes of the children of Israel. \" They are Jews- not the Church. The sealed ones are one company, complete in itself; and the Elders and Living ones are another company complete in themselves. John sees them all at the same time, the one in the presence of the other.\n12 thousand from each tribe: (Two tribes are not mentioned. Which two are they? Why not possibbly?</p>\n<h3>Judah -confession or praise of God</h3>\n<h3>Reuben- behold a Son or viewing the Son</h3>\n<h3>Gad -a company or a troupe</h3>\n<h3>Asher- blessed or happy</h3>\n<h3>Naphtali- obtained by wrestling</h3>\n<h3>Manasseh -making to forget</h3>\n<h3>Simeon -hearing or obeying</h3>\n<h3>Levi -adhesion or cleaving to</h3>\n<h3>Issachar -a reward</h3>\n<h3>Zebulon- habitation or dwelling</h3>\n<h3>Joseph -added or addition</h3>\n<h3>Benjamin- Son of the right hand</h3>\n<p>Look at them all together. Confessors or praises of God, looking upon the Son, a company of blessed ones, wrestling or fighting for what is ahead, forgetting these things that are behind, hearing and obeying the word, cleaving unto the reward of a heavenly habitation, an addition to what has already happened, sons of the day of God's hand, or the day of His Power, begotten in the extremity of the age.</p>\n<p>One reason the names of Dan and Ephraim is left out. Dan means a judge. These 144,000 are not judges, and never become judges. Ephraim -double fruitfulness, or increase, or growth by multiplication. These are a fixed number 144,000. These are Israelites, living in the period of the judgment, who confess and look to Christ as their Messiah.</p>\n<h2>The Time of Their Sealing</h2>\n<h3>It takes place on earth.</h3>\n<h3>After the opening of the Sixth Seal Chpt. 7:1</h3>\n<h3>Before the opening of the Seventh Seal vs. 3</h3>\n<h2>The Nature of Their Sealing</h2>\n<h3>It is a mark Of some sort. The impression or mark of a seal or signet. Conspicuous and observable.</h3>\n<p>In the Old Testament the Mark of Circumcision\nIn Egypt the Mark of the Blood\nRahab the Mark of the scarlet thread .\nAnti-christ puts a mark on his followers.</p>\n<h3>In their foreheads -vs. 3</h3>\n<p>Similar to Eze. 9:4</p>\n<h3>It is something Supernatural. vs. 2</h3>\n<p>\"The seal of the living God\"\nAs all believers are sealed by the Lord. Eph. 1:13; Eph. 4:30; II Cor. 1:22</p>\n<h2>The Agent of Their Sealing</h2>\n<h3>By an angel vs. 2</h3>\n<p>\"I saw another angel\"</p>\n<h3>Coming from the East -</h3>\n<p>The rising of the Sun. \"Unto you that fear my name shall the Sun of Righteousness arise.\"</p>\n<h2>The Basis of Their Sealing -</h2>\n<p>They are \"The Servants of God\" vs. 4.</p>\n\n\n<h1 id=\"H\">Innumerable Redeemed [7:13-17]</h1>\n\n<p>The Palm&ndash;Bearing Multitude 7:9&ndash;17</p>\n<p>It was from heaven that John beheld the shaking and the sealing;. and from the same point of view he sees this company. The question of the Elder is what we want to deal with first. vs. 9 &quot;Who are they? and whence came they?&quot;\nSome believe they are the early Christians victorious over the sorrows and persecutions. Some believe they are the Christians under Constantine. To decide who they are look at:</p>\n\n<h2>Who They Are Not</h2>\n<h4>They are not the highest class of the redeemed.</h4>\n<p>The Elders &quot;Sit&quot; &ndash;these &quot;Stand&quot; vs. 9 &quot;Stood before the Throne&quot;. The Elders have Crowns and Thrones &ndash; These have neither. The Elders appear in their places &ndash; And have received their reward before judgment. These came to the throne after judgment has started. The Elders were &quot;counted worthy to escape all these things&quot; [Luke 21:36]. These were in the Judgment. &quot;Out of the great tribulation. &quot; vs. 14</p>\n<h4>They are not the Church</h4>\n<p>The Four Living creatures make up the Church. The Rapture of the Church takes place before the Great Tribulation. These are taken out of the Great Tribulation.</p>\n<h4>They are not the sealed ones &ndash;</h4>\n<p>The sealed ones were a definite number. These are uncounted and numberless. vs.9 The sealed ones were of Israel. &quot;These are out of every nation, and kindreds, and people, and tongues.&quot;</p>\n\n<h2>Who They Are</h2>\n<h3>They are redeemed people.</h3>\n<p>They were once sinners. They are now saved. Vs. 10 &quot;Salvation to Our God, &quot; &quot; And to the Lamb.&quot;</p>\n<h3>They are people living on the Earth during the Judgment vs. 14</h3>\n<p>&quot;Come out of Great Tribulation. &quot; Some believe because of the number that they are from all ages&ndash; Come out of Great Tribulation.</p>\n<h3>They are people who were unprepared, and were &quot;left&quot; when the Rapture took place.</h3>\n<p>There were ten virgins in Matthew 25. Five were wise and five were foolish. The five foolish were left outside the marriage door.</p>\n<blockquote>Matthew 25:11-13 &mdash; Afterward came also the other virgins, saying, Lord, Lord, open to us. 12 But he answered and said, Verily I say unto you, I know you not. 13 Watch therefore, for ye know neither the day nor the hour wherein the Son of man cometh.</blockquote>\n\n<p>There are no crowns or thrones, but only palms. They did not hear the gentle voice of the Spirit, and therefore were not rewarded in the same way those that overcame and escaped the great tribulation. But they did learn their lesson through great trial and are given great promises of blessing.</p> \n<blockquote>Isaiah 26:9,10 &mdash;&hellip;for when thy judgments are in the earth, the inhabitants of the world will learn righteousness. 10 Let favour be shewed to the wicked, yet will he not learn righteousness: in the land of uprightness will he deal unjustly, and will not behold the majesty of the LORD.</blockquote>\n<p>Some will learn righteousness, but not all will turn to God even in such terrible judgment.</p>\n<blockquote>Daniel 12:10 &mdash;Many shall be purified, and made white, and tried; but the wicked shall do wickedly: and none of the wicked shall understand; but the wise shall understand.</blockquote>\n\n<h2>Their Eternal State</h2>\n<h3>They are in heaven. Lazarus &ndash;The Richman</h3>\n<p>Where God is etc.</p>\n<h3>They are &quot;before&quot; the throne. vs. 9</h3>\n<p>They&apos;re not in the throne but; They are before it.\n&quot;Serve in the temple&quot; vs. 15</p>\n<h3>They are &quot;clothed in white robes.&quot;</h3>\n<p>The garments of saints.</p>\n<h3>They have &quot;palm branches in their hands&quot; the ancient people &ndash;the feast of Tabernacles. Palms are Symbolic of Victory. Also&ndash; vs. 10</h3>\n<h3>They shall hunger no more, vs 16 &quot;neither thirst any more.&quot;</h3>\n<h3>They shall not be burnt &quot;neither&hellip;sun&hellip; nor&hellip; heat&quot; vs. 16</h3>\n<h3>They shall be Fed. vs. 17</h3>\n\n<h1>Opening of The Seventh Seal (8:1)</h1>\n\n<p>Chapter 7 details the the sealing of the 144,000 and the palm-bearing multitude before completing the Seals with the seventh and final seal.</p>\n\n<h2>Details of the Silence</h2>\n\n<p>The Lamb is &quot;He&quot; Who breaks or opens the seal. In response to the breaking of the seal there is silence. This silence appears to be a &quot;calm before the storm&quot;.</p>\n\n<p>This silence takes place &quot;In Heaven&quot; and lasts for half an hour (&quot;Hemioron&quot; &quot;Hemi&quot;: Half plus &quot;Hora&quot;: Hour).</p>\n\n<h2>Meaning of the Silence</h2>\n\n<p>This seal and the resulting silence are quite mysterious. We can consider the definitions of the words used, but any other suggestings to their meaning is speculation.</p>\n\n<p>In Revelation 8:1, \"Silence\" (siqe) means hush, voluntary stillness or refusal to speak. It is a silence of intense interest and awful expectancy with reference to the results of the breaking of the seventh seal.</p>\n\n<p>As the following section of Revelation makes several strong allusions to the different parts of temple worship. For example:</p>\n\t<ul class='bullets'>\n\t\t<li>Altar and incense in 8:3.</li>\n\t\t<li>Four horns of the altar in 9:13.</li>\n\t\t<li>Temple of God in 11:1.</li>\n\t</ul>\n<p>Adam Clarke makes a comparison of this silence and the prayerful silence of the people who waited while the priest went in to burn incense in the holy place.\n </p>\n \n <blockquote>Luke 1:10 -- And the whole multitude of the people were praying without at the time of incense.</blockquote>","lesson":5},{"type":"md","value":"<h1 id=\"D\">D. Vision of the Throne [4]</h1>\n\n{/*<!-- chapter 4 end -->*/}\n\n<h2>The Rapture</h2>\n\n<blockquote>\"Things which must be hereafter\"</blockquote>\n<p>This chapter begins a new vision, which constitutes the second section of the Revelation. It is related not to things on the earth, but to things in heaven, and to things following the period covered by the seven churches.</p>\n<p>The Translation of the Bride has already taken place and this section begins with the rapture.</p>\n\n<h3>He saw a door opened - v. 1 \"A door opened in heaven\"</h3>\n<h3>He heard a voice -</h3>\n\n<p>\"Voice which I heard as it were of a trumpet.\" (I Thessalonians 4:16-18)</p>\n<blockquote>Come up hither</blockquote>\n<blockquote>I will shew thee things</blockquote>\n<blockquote>Which must be hereafter</blockquote>\n<p>After the Rapture of the Church.</p>\n<h3>He was caught up -</h3>\n<p>v. 2 \"I was in the Spirit\" Caught up in the Spirit.</p>\n<p>\"A throne was set in heaven\" set/Keimai- to be out stretched.</p>\n\n<h2>The Throne of Majesty -</h2>\n<h3>The Throne is in heaven -</h3>\n<blockquote>v. 2 A throne was set in heaven</blockquote>\n<blockquote>Psalm 103:19&mdash;The LORD hath prepared His Throne in the heavens;and His kingdom ruleth over all.</blockquote>\n<h3>The Throne is Occupied -</h3>\n<blockquote>v. 2 \"One sat on the throne\"</blockquote>\n<p>No name mentioned and No figure described. Only His appearance stated.Not in shape - but in color and flashing brilliancy.</p>\n<blockquote>v. 3 \"Jasper and a sardine stone\"</blockquote>\n<p>Crystalline and purple in hue. Royal.cBeautifully bright, red, carnation color.Flashing light or Flames like fire.</p>\n<blockquote>I John 1:5 -- God is light&hellip;</blockquote>\n<blockquote>Hebrews 12:29 -- God is a consuming fire.</blockquote>\n<h3>The Throne is Encircled -</h3>\n<h4>By a rainbow -</h4>\n<blockquote>v. 3 \"There was a rainbow round about the throne\"</blockquote>\n<p>Token of God's covenant. Genesis 9:11,17</p>\n<p>An Emerald Rainbow</p>\n<blockquote>\"Insight like unto an emerald.\"</blockquote>\n<p>\"Emerald\" - \"light green\"</p>\n<p>The throne is a throne of judgment but not of destruction.</p>\n<p>Judgment mingled with grace and mercy.</p>\n<p>Life - Promise - Hope - \"Emerald\"</p>\n<p>Over-spanning the appearance of consuming fire.</p>\n<h4>By other thrones - v. 4</h4>\n<p>\"Seats\" same word as thrones.</p>\n<h3>By Elders -</h3>\n<blockquote>\"Four and twenty elders sitting\"</blockquote>\n<p>On the thrones - \"round about the throne\"</p>\n<h4>By Living Creatures - vv. 6-9</h4>\n\n<h3>The Throne is of Judgment</h3>\n<blockquote>v. 5 And out of the throne proceeded</blockquote>\n<h4>\"Lightnings\"</h4>\n<p>Exodus9:23,28 Exodus19:16</p>\n<h4>\"Thunderings\"</h4>\n<p>I Samuel 7:10</p>\n<h4>\"Voices\"</h4>\n<p>I Samuel 12:17,18</p>\n<h4>\"Lamps of Fire\"</h4>\n<p>It is a flaming indignation.</p>\n<p>Isaiah 4:4 Malachi 4:1 I Thessalonians 1:7,8</p>\n<p>Lamps of Fire - \"Light\"</p>\n<p>Not of revealing truth,But revealing judgment.</p>\n<p>Seven - Completeness - Tribulation\"Seven Spirits\" - The fullness of the Spirit of God.</p>\n<h3>The Throne Has A Pavement - v. 6</h3>\n<p>Exodus 24:10 Revelation21:21</p>\n\n<h2>The Four Living Creatures vv. 6-8</h2>\n<h3>Who They Are Not</h3>\n<h4>They are not angels. (5:8-10; 7:11; Hebrews 2:5)</h4>\n<h4>They are not Israel. Israel in History - Revelation 4:1. Also these are from all nations. Revelation 5:9</h4>\n<h4>They are not the Apostles, but tribes and people of all the earth.</h4>\n<h4>They are not disembodied spirits, but are glorified subjects of grace.</h4>\n<p>vv. 8,9 Enthroned - Crowned - Robed</p>\n<h3>Who They Are</h3>\n<p>Look at their characteristics revealed in the Scriptures</p>\n<h4>The first creature was like a lion v. 7</h4>\n<h4>The second creature was like a calf</h4>\n<h4>The third creature had a face as a man</h4>\n<h4>The fourth creature was like a flying eagle</h4>\n<p>Four is representative of a larger number.</p>\n<p>The Jewish writers tell us that the standard of each tribe of Israel took the color of the stone which represented it in the high priest's breastplate, and that there was wrought upon each a particular figure.</p>\n<li>A Lion for Judah</li>\n<li>A young ox for Ephraim</li>\n<li>A Man for Reuben</li>\n<li>An Eagle for Dan</li>\n<p>In the Four Gospels we have Christ portrayed in this same manner\"</p>\n<li>In Matthew the Lion - The King of Israel</li>\n<li>In Mark the Ox - The Servant and Sacrifice</li>\n<li> In Luke the Man - The Son of Man</li>\n<li> In John the Eagle - The Son of God</li>\n<p>This is not Christ, but someone like Him - Who do you find in Scripture like Christ?</p>\n<p>Christ is the head of the Church. This is His Body. This is His Church</p>\n<p>Lion nature - Ox nature - Man's nature - Eagle's nature</p>\n<p>This is the Church after it has been perfected in the first 3 -1/2 years of the tribulation.</p>\n<h3>They have eyes -</h3>\n<blockquote>v. 6 \"Before and behind\"</blockquote>\n<blockquote>v. 8 \"Full of eyes within\"</blockquote>\n<h4>The symbol of intense intelligence</h4>\n<p>Looking backward into the past.</p>\n<p>Forward into the future.</p>\n<p>Inward into the present.</p>\n<p>Nothing hid - secrets known.</p>\n<h4>Also symbol of unceasing activity.</h4>\n<h4>A symbol of continued vigilance.</h4>\n<h3>They have wings -v. 8</h3>\n<p>Isaiah 6: with twain covered his face</p>\n<p>with twain covered his feet</p>\n<p>with twain they did fly</p>\n<h4>Humility -</h4>\n<h4>Redemption - uncovered feet cannot Redeem</h4>\n<h4>Freedom -</h4>\n<p>Six is the number of man.</p>\n<p>Revelation 13:18</p>\n<p>Six is 4 -man's worldplus 2 -division or difference, and generally enmity.</p>\n<p>Genesis 1:1 - Genesis 1:2</p>\n<p>First - Perfection</p>\n<p>Second - Ruin and desolation</p>\n<p>Six is 5 - grace of God</p>\n<p>plus 1 - made of none effect by man's addition to it.</p>\n<p>Six is 7 - Completeness</p>\n<p>minus 1 - man's coming short of perfection.</p>\n<p>These are men redeemed - God's perfection.</p>\n<p>Man was created on the sixth day. Man has six days to labor. When twelve (the number of governmental perfection) is divided, it indicates imperfection in rule and administration.</p>\n<p>I Kings 10:19 Solomon's throne had six steps, and his kingdom was divided.</p>\n<p>The twelve loaves were divided into sixes -</p>\n<p>Also on the Breastplate of the High Priest -Twelve Tribes were divided tribes.</p>\n\n<h2>The Four And Twenty Elders - vv. 4,10,11</h2>\n<h3>Who They Are Not -</h3>\n<h4>They are not the Patriarchs</h4>\n<p>Revelation 5:9 From every tribe, tongue, people and nation.</p>\n<h4>They are not the Apostles. The Apostles were all Jews. They have their part in the foundation. Revelation 21:12-14</h4>\n<h4>They are not disembodies spirits. The dead praise not God.</h4>\n<p>These are praising God. vv. 10,11</p>\n<h3>Who They Are -</h3>\n<p>Notice - Where they are located and what they are doing.</p>\n<h4>They are located in the throne and sitting on thrones.</h4>\n<p>Revelation 4:2,4 Now turn to the 3rd chapter and vv. 20,21</p>\n<h4>They are Overcomers</h4>\n<blockquote>Sitting on thrones Ch. 3:21; 4:4</blockquote>\n<p>They have crowns - v. 10 Crowns promised -</p>\n<p>Incorruptible crown - I Corinthians 9:25</p>\n<p>Crown of Rejoicing - I Thessalonians 2:19</p>\n<p>Crown of Righteousness - II Timothy 4:8</p>\n<p>Crown of Life - James 1:12; Rev. 2:10</p>\n<p>Crown of Glory - I Peter 5:4</p>\n<p>Five in number - Grace and Faith</p>\n<p>So then this is a company of people that have heard His voice in the church and have overcome \"as He overcame\" and He has given them the right to sit with Him in His throne.</p>\n<h4>They occupy the closest position to Christ.</h4>\n<p>Chpt. 5:6 Reverse the order &mdash;</p>\n<h4>They are Twenty-Four in number</h4>\n<p>These were the representatives of many others.</p>\n<p>The priests and Levites \"were set to forward the work of the house of the Lord, was twenty and four thousand.\" I Chronicles 23:3,4</p>\n<p>But they were all arranged in courses of twenty-four.I Chronicles 24:3-5</p>\n<p>I Chronicles 25:8-31 There were not more than twenty-four on duty at a time.</p>\n<h4>They are Elders -</h4>\n<p>The expression is that of time - \"Elders\". The \"Elder\" was the ruling man in the original order. They are \"Elders\" because of their official place.</p>\n<p>\"Sitting on thrones.\" They are the first glorified of all the redeemed - the seniors of that celestial city.</p>\n\n{/*<!-- chapter 4 end -->*/}","lesson":4},{"type":"md","value":"---\ntitle: Seven Letters to Seven Churches\nsubject: Revelation | Bible Study\nlast_edited: January 10, 2021\n---\n\n<h1 id=\"C\">C. 7 Letters to 7 Churches [2-3]</h1>\n\n# Introduction to the Seven Letters to the Churches\n\n## Addressed To the Ministers\n\n> Revelation 2:1--Unto the angel of the church&hellip;\n\nAngel means messenger, Rev. 22:8-9\n\n> Revelation 22:8--And I John saw these things, and heard them. And when I had heard and seen, I fell down to worship before the feet of the angel which shewed me these things. 9 Then saith he unto me, See thou do it not: for I am thy fellowservant, and of thy brethren the prophets, and of them which keep the sayings of this book: worship God.\n\n### It is A Revelation of Ministerial Responsibility\n\n#### To hear from God, Eze. 3:17\n#### To receive from God, Gal. 1:11-12\n#### To speak for God, Isa. 58:1\n#### To answer to God, II Cor. 5:10\n### It Is A Revelation of Ministerial Distinction\n#### They are a part of the Church, I Cor. 12:28\n> I Cor. 12:28--And God hath set some in the church, first apostles, secondarily prophets, thirdly teachers, after that miracles, then gifts of healings, helps, governments, diversities of tongues.\n#### Yet a separate part of the Church, Phil. 2:25,29; I Thess. 5:12,13\n> Philippians 2:25,29--Yet I supposed it necessary to send to you Epaphroditus, my brother, and companion in labour, and fellowsoldier, but your messenger, and he that ministered to my wants. 29 Receive him therefore in the Lord with all gladness; and hold such in reputation: [dear; more honorable]\n> I Thessalonians 5:12-13-- And we beseech you, brethren, to know them which labour among you, and are over you in the Lord, and admonish you; 13 And to esteem them very highly in love for their work's sake. And be at peace among yourselves.\n\n### It Is A Revelation of Ministerial Protection\n> Revelation 2:1--&hellip;He that holdeth the seven stars&hellip;\n#### Keeps for Himself, John 10:27-28\n> John 10:27-28-- My sheep hear my voice, and I know them, and they follow me: 28 And I give unto them eternal life; and they shall never perish, neither shall any man pluck them out of my hand.\n#### Keeps from the Enemy, II Tim. 4:16-18\n> 2 Timothy 4:16-18--At my first answer no man stood with me, but all men forsook me: I pray God that it may not be laid to their charge. 17 Notwithstanding the Lord stood with me, and strengthened me; that by me the preaching might be fully known, and that all the Gentiles might hear: and I was delivered out of the mouth of the lion. 18 And the Lord shall deliver me from every evil work, and will preserve me unto his heavenly kingdom: to whom be glory for ever and ever. Amen.\n\n### It Is A Revelation of Ministerial Authority\n> Revelation 2:1--&hellip;In His right hand&hellip;\n#### The place of authority, Luke 22:69\n#### It is delegated authority, Luke 9:1\n#### They are His representatives, II Cor. 5:20\n## Directed To The Churches\n> Revelation 2:1--&hellip;Who walketh in the midst of the seven golden candlesticks&hellip;\n### Seven is the number of completeness\n#### To the whole Church\n#### To the whole Age\n### Seven Gentile churches\n#### No letter for the church at Jerusalem\n#### He will have a Gentile bride\n### Seven churches Paul wrote to\n#### Romans, Corinthians, Galatians, Ephesians, Philippians, Colossians, Thessalonians\n#### Personal letters to Timothy, Titus and Philemon\n#### Believe to have written Hebrews to the people\n### Seven letters John wrote to the Seven Churches\n#### Ephesus,Smyrna, Pergamos, Thyatira, Sardis, Philadelphia, Laodicea\n#### He wrote the Gospel of John, the three Epistles and Revelation, Not addressed to the churches as such\n### Seven distinct parts in each letter\n#### An address -- \"Unto the church in&hellip;\"\n#### A citation -- \"These things saith He&hellip;\"\n#### A statement of knowledge -- \"I Know thy works\"\n#### A description of moral status -- \"Thou art&hellip;\"\n#### A personal application to the individual -- \"he that hath an ear&hellip;\"\n#### A command -- \"Remember\", \"Repent\" etc.\n#### A promise -- \"To him that overcometh will I&hellip;\"\n### Out of the seven, Christ finds fault with five\n#### One of these He finds nothing to commend (Laodicea)\n#### Two alone pass inspection (Pergamos and Philadelphia)\n(2:13) Pergamos--thou holdest fast my name, and hast not denied my faith. (3:8) Philadelphia--hast kept my word, and hast not denied my name.\nYet they are in contact with elements which He condemns\n\n<table>\n<tr>\n<th colspan=\"6\">OVERVIEW OF THE SEVEN CHURCHES</th>\n</tr>\n<tr>\n<th>Church</th>\n<th>Time</th>\n<th>Commendation</th>\n<th>Condemnation</th>\n<th>Counsel</th>\n<th>Challenge</th>\n</tr>\n<tr>\n<td>Ephesus</td>\n<td>Apostolic</td>\n<td>Faithful in service; Hated deeds of Nicolaitanes</td>\n<td>Left First Love</td><td>Repent</td>\n<td>Eat of the Tree of Life</td>\n</tr>\n<tr>\n<td>Smyrna</td>\n<td>Persecution</td>\n<td>Faithful in persecution; poor, but rich.</td>\n<td>None</td><td>Fear not; be faithful</td>\n<td>Not hurt of the second death</td>\n</tr>\n<tr>\n<td>Pergamos</td>\n<td>Imperial Favor</td>\n<td>Did not deny the faith inspite of satan</td>\n<td>Doctrine of Nicolaitanes, Balaam</td><td>Repent</td>\n<td>Eat hidden mannah, white stone, new name</td>\n</tr>\n<tr>\n<td>Thyatira</td>\n<td>Papacy</td>\n<td>Good works, charity, service, faith, patience</td>\n<td>Wicked Woman Jezebel</td><td>Hold fast till I come</td>\n<td>Power over nations; Morning Star</td>\n</tr>\n<tr>\n<td>Sardis</td>\n<td>Reformation</td>\n<td>Faithful few are worthy</td>\n<td>Dead works; not perfect</td><td>Be watchful; hold fast; repent</td>\n<td>White raiment; Confessed before Father</td>\n</tr>\n<tr>\n<td>Philadelphia</td>\n<td>Present Day</td>\n<td>Kept His Word; Did not deny His name</td>\n<td>None</td><td>Hold fast which thou hast</td>\n<td>Pillar in the Temple; New name</td>\n</tr>\n<tr>\n<td>Laodicea</td>\n<td>Present Day</td>\n<td>None</td>\n<td>Lukewarm; blind, naked</td><td>Buy of me gold, raiment, eyesalve</td>\n<td>Sit with Christ on His throne</td>\n</tr>\n</table>","lesson":3},{"type":"md","value":"---\ntitle: People of Revelation\nsubject: Revelation | Bible Study\nlast_edited: January 10, 2021\n---\n# People of Revelation\n\n## List\n    - Paul (1)\n    - 7 Churches (2,3)\n    - Angels &amp; Ministers (1,8-11)\n    - Four Living Creatures (4)\n    - 24 Elders (4)\n    - Martyrs\n    - 144,000\n    - Palm Bearing Multitude\n    - 2 Witnesses\n    - Revelation 12 - Sun-clothed Woman, Manchild, Remnant\n    - Anti-Christ and False Prophet\n    - Mytery Babylon and Babylon the Great City (17,18)\n    - Those in Heaven: Much People, 24 Elders, Four Beasts (19)\n    - The Lamb's Wife (19)\n    - Overcomers\n    - They which are called unto the marriage Supper of the Lamb\n    - The Great War and its Actors\n    - Millenial Saints\n    - The Dead (and their judgment)\n    - Readers of Revelation ()\n\n## ","lesson":32},{"type":"md","value":"# Glimpses of Christ\n\n## List\n\n1. Revelation 1:5-8 **Savior and Coming Again** ('with clouds')\n2. Revelation 1:12-18 **The Glorified Christ**\n3. Revelation 2 & 3 **THE HEAD OF HIS CHURCH** Holding the 7 Stars in his Right Hand and Walking in the Midst of the Seven Golden Candlesticks\n4. Revelation 5-8 **THE LAMB IN THE MIDST OF THE THRONE** HE Begins the SEASON OF JUDGMENT - WITH WRATH\n5. Revelation 8:3-5 [**The Mystery Angel**](#5)\n6. Revelation 14:1-5 [**A Lamb Stood on Mount Sion**](#6)\n7. Revelation 19 [**Will Be Wed**](#7)\n8. Revelation 20:1-10 [**King of Righteousness**](#8)\n9. Revelation 22 [**Temple and Light**](#9)\n\n## <div id=\"1\"/>1. Savior and Coming Again (Revelation 1:5-8)\n\n- with clouds (judgment, people)\n\n## <div id=\"2\"/>2. The Glorified Christ (Revelation 1:9-20)\n\nTHE WITNESS: HOW did John Hear and See -- Received in the Spirit and to be understood only by the Spirit\n\n> 8 times in Revelation:  Re 13:9 If any man have an ear, let him hear what the Spirit saith ....\n\n- 1. His Voice (a great voice, as of a trumpet, his voice as the sound of many waters) It was clearly a VOICE that John heard but it was LIKE a TRUMPET--urgent, clear, strong, awakening, and startling.\n\n<p>God revealed Himself to Moses, on Mt.Sinai \"voice of a trumpet exceeding loud.\" (Exodus 19:16) The Temple opened its doors in the morning at the sound of the trumpet. The Year of Jubilee came with the sound of the trumpet. Lev. 25:9,10 The Silence of the Age will be broken by the sound of a trumpet.\n</p>\n\n<blockquote>I Thessalonians 4:16--The trumpet shall sound and the dead shall be raised.</blockquote>\n\n- 2. His Age (I am Alpha and Omega, the first and the last)\n- 3. His Vocation (His place is found <b>in the midst</b> of his church (PROPHET, PRIEST, KING)\n\n<p><b>\"Golden\"</b>\n<b>GREAT COST</b>. The candlesticks were composed of the costliest metal.\n\n<b>GREAT BEAUTY</b>. The tabernacle use filled with the use of gold. Gold is expressive of Godliness.\n\nPsalm 96:9-- O worship the LORD in the beauty of holiness: fear before him, all the earth.</p>\n\n- 4. His Divinity - the Christ (one like unto the Son of man, > I am he that liveth, and was dead; and, behold, I am alive for evermore, Amen; ,  and have the keys of hell and of death.\n\n- 5. His Clothing (clothed with a garment down to the foot,  and girt about the paps with a golden girdle. ( a golden belt Ephesisans 6 truth) - FULLY CLOTHED - Clothing Signified Status\n\n- 6. His Appearance\n\n<ul>\n<li>His head and his hairs were white like wool, as white as snow;</li>\n\n<p>His Wisdom and \"ELDER\"ness. Also a reminder of redemption  (sins red like crimson \"white as snow\")</p>\n<blockquote>Isa 1:18 Come now, and let us reason together, saith the LORD: though your sins be as scarlet, they shall be as white as snow; though they be red like crimson, they shall be as wool.</blockquote>\n\n<li>his eyes were as a flame of fire;</li>\n\n<blockquote>Re 2:23 And I will kill her children with death; and all the churches shall know that I am he which searcheth the reins and hearts: and I will give unto every one of you according to your works. (innermost parts)</blockquote>\n\n<li>his feet like unto fine brass, as if they burned in a furnace;</li>\n<li>his countenance was as the sun shineth in his strength.</li>\n<li><b>And when I saw him, I fell at his feet as dead.</b></li>\n\n## <div id=\"3\"/>3. The Head of His Church (Revelation 2 & 3)\n\n> Revelation 2:1 &mdash; Unto the angel of the church of Ephesus write; These things saith he that holdeth the seven stars in his right hand, who walketh in the midst of the seven golden candlesticks;\n\n## <div id=\"4\"/>4. The Lamb in the Midst of the Throne (Revelation 5-8)\n\n> Revelation 5:5,6 &mdash; 5 And one of the elders saith unto me, Weep not: behold, the Lion of the tribe of Juda, the Root of David, hath prevailed to open the book, and to loose the seven seals thereof. 6 And I beheld, and, lo, in the midst of the throne and of the four beasts, and in the midst of the elders, stood a Lamb as it had been slain, having seven horns and seven eyes, which are the seven Spirits of God sent forth into all the earth.\n\n<blockquote>Revelation 22:3&mdash;And there shall be no more curse: but the throne of God and of the Lamb shall be in it; and his servants shall serve him:</blockquote>\n\n> Revelation 7:17 &mdash;  For the Lamb which is in the midst of the throne shall feed them, and shall lead them unto living fountains of waters: and God shall wipe away all tears from their eyes. [innumberable number out of great tribulation]\n\n<h1>The Nature of the Victor, vs. 5-7</h1>\n<p>The Book's Opener is presented as a Victor!</p>\n<blockquote>Revelaton 5:5 - And one of the elders saith unto me, Weep not: behold, the Lion of the tribe of Juda, the Root of David, hath prevailed to open the book, and to loose the seven seals thereof.</blockquote>\n<h3>A lion</h3>\n<blockquote>v. 5 \"Lion of the tribe of Judah\"</blockquote>\n<blockquote>\"The Root of David\"</blockquote>\n<p>Being of the Root of David, his prowess is of no coincidence. It is by PROMISE and therefore Divine appointment.</p>\n\n> Revelation 22:16 - I Jesus have sent mine angel to testify unto you these things in the churches. I am the root and the offspring of David, and the bright and morning star.\n\n<p>He is both ROOT and OFFSPRING of David! By nature, Jesus is the ROOT of David and by divine incarnation he is the offspring of David. David, the greatly revered and legendary king of Israel, received his authority from this same Jesus!</p>\n\n<h3>A lamb</h3>\n<blockquote>v. 6 \"Stood a lamb\"</blockquote>\n<p>A lion in power, but a lamb in nature. Notice:</p>\n<h4>He is standing</h4>\n<p>Because He is not dead, but alive.</p>\n<p>Because He is accepted.</p>\n<p>Because of us, on our behalf.</p>\n<h4>He is a sacrificial lamb</h4>\n<blockquote>v. 6 \"A lamb as it had been slain\"</blockquote>\n<h4>His has perfect power and strength</h4>\n<blockquote>v. 6 \"Having seven horns\"</blockquote>\n<h4>He has perfect and universal intelligence</h4>\n<blockquote>\"And seven eyes\"</blockquote>\n<blockquote>\"Which are the seven spirits of God\"</blockquote>\n<h4>He has unlimited rights v. 7</h4>\n\nThe Lion Who will Return in Judgment Revelation 19:11-15\n\n## <div id=\"5\"/>5. The Mystery Angel (Revelation 8:3-5)\n\nJohn sees seven angels &quot;which stood before God&quot; and then he mentions &quot;another&quot; angel. Who is this &quot;mystery angel&quot;\n\n### The Nature of &quot;The Angel&quot;\n\n&quot;Another&quot; (allos) means different. This same phrase is used in Revelation 7:2; 10:14-17; 18:1; 20:1. The word \"angel\" means messenger of God.\n\n### The Office of &quot;The Angel&quot;\n\nThis &quot;angel&quot; is the Angel of the Lord. He offers the prayers of saints. You cannot give something unless you have it. He had to receive them to give them. Angels do not receive worship, but &quot;the Angel of the Lord&quot; does. (Gen. 16:7,13; Ex. 3:2-5; Joshua 5:13-15).\n\nThere are many passages in which the expression the &quot;angel of God&quot; or &quot;angel of the Lord&quot; is definitely for a manifestation of God Himself. Compare Genesis 22:11-12; 22:15-19; Exodus 3:2-6.\n\n### The Ministry of The Angel\n\nScripture itself presents us with details that tell us that this Angel is the Lord:\n\n<h4>The First Proof - He had &quot;a Golden censer&quot;</h4>\n\n<p>This instrument was used by the priests, in the ministry of the worship of God. However, it was used only by the high priest in the holy place. This indicating our great High Priest who is now entered into the heavens, Jesus the Son of God. We remember that that this is a scene in Heaven.</p>\n\n<h4>The Second Proof -He offers the Prayers of Saints before God.</h4>\n\n<p>vs. 3 &quot;All Saints&quot;. There is no record of such an office found in the scripture as being assigned to angels, however, there is record of this office being executed by the Lord Jesus. Eph. 2:18 I Tim. 2:5 Heb. 7:25; Heb. 13:15 I Peter 2:5 I John 2:1;</p>\n\n<h4>The Third Proof - He casts fire on the earth.</h4>\n\n<p>Verse 5 tells us the fire is taken from the altar.</p>\n<blockquote>Luke 12:49 -- I [Jesus] came to send fire upon the earth. </blockquote> \n<p>This fire is a symbol of the Divine Presence and Power. (Exodus 3:2 Deuteronomy 4:36 Psalm 50:3 97:3; Isaiah 66:15-16; Acts 2:3) </p>\n<p>This fire is an Instrument of Divine Judgment. The action indicated here by the casting into the earth speaks of judgment. (Genesis 19:24; Leviticus 10:2; Numbers 11:1; 16:35; Malachi 4:1; 2 Kings 1:10; 2 Thessalonians 1:8; 2 Peter 3:10)</p>\n\n<h4>The Fourth Proof - To offer incense with prayers. vs. 3-4</h4>\n\n<p>&quot;Given unto Him much Incense.&quot;It was given to Him through merit. For without His death and atoning work coupled with His pure and Holy life, there would be no force in prayer. God hears us because of Him. </p>\n\n<p>The Compounding of the incense is given with great precision in the Old Testament. It was to be made of specific ingredients in exact proportion (Exodus 30:34). Any compound that did not meet the exact specifications given by God was to be rejected as strange incense (Exodus 30:9). It was to be tempered with salt as it was holy and was never to be used for ordinary purposes. Any one who tried to duplicate this incense for themselves was to be cut off from his people (Exodus 30:38).</p>\n\n## <div id=\"6\"/>6. The Lamb Stand on Mount Sion (Revelation 14:1-5)\n\n### INTRODUCTION\n\nRevelation 13 concludes with a gloomy tale of a reign of darkness. In Chapter 13 we read of two terrible beasts and their great deception against those who would receive the Beast&apos;s mark. Chapter 14 opens with a glorious scene featuring firstly the Lamb and secondly 144,000 redeemed souls who were marked, but it was God the Father's name on their forehead! We find the details surrounding the Song of this 144,000 in Revelation 14:1-5.</p>\n\n### The Lamb on Mount Sion (vs. 1)\n\n<blockquote>And I looked, and, lo, a Lamb stood on the mount Sion,</blockquote>\n\n#### The Lamb\n<p>The &quot;Lamb&quot; appears in 27 verses throughout Revelation and His identity cannot be mistaken!</p>\n<blockquote>Revelation 5:6&mdash;And I beheld, and, lo, in the midst of the throne and of the four beasts, and in the midst of the elders, stood <strong>a Lamb</strong> as it had been slain, having seven horns and seven eyes, which are the seven Spirits of God sent forth into all the earth.</blockquote>\n<blockquote> John 1:29&mdash;The next day John seeth Jesus coming unto him, and saith, Behold the Lamb of God, which taketh away the sin of the world.</blockquote>\n\n- the Lamb that was slain\n- unto the Lamb for ever and ever.\n- the wrath of the Lamb:\n- made them white in the blood of the Lamb.\n- overcame him by the blood of the Lamb\n- the book of life of the Lamb slain from the foundation of the world.\n\n#### Standing in the midst of the Throne\n\n\n<h5>And the four beasts, and the elders (5:6)</h5>\n<h5>With the Sealed Book [WAS slain!] (5:8; 6:1)</h5>\n<h5>With Wrath (6:16)</h5>\n\n\n<h5>With an Innumerable Multitude worshipping before Him (7:9)</h5>\n<h5>Feeding and Leading the Innumerable Multitude (7:17)</h5>\n<h5>Overcoming those that Make War with Him (17:14)</h5>\n<h5>Marrying His Bride (19:7; 21:9)</h5>\n<h5>As the Temple (21:22)</h5>\n<h5>As the Light (21:23)</h5>\n<h5>Having a Book of Life (21:27)</h5>\n<h5>Having a Pure River of Water Proceeding out of His Throne (22:1)</h5>\n<h3>Standing on Mount Sion</h3>\n<blockquote>Psalm 87&mdash;His foundation is in the holy mountains. 2 The LORD loveth the gates of Zion more than all the dwellings of Jacob. 3 Glorious things are spoken of thee, O city of God. Selah. 4 I will make mention of Rahab and Babylon to them that know me: behold Philistia, and Tyre, with Ethiopia; this man was born there. 5 And of Zion it shall be said, This and that man was born in her: and the highest himself shall establish her. 6 The LORD shall count, when he writeth up the people, that this man was born there. Selah. 7 As well the singers as the players on instruments shall be there: all my springs are in thee.</blockquote>\n<p>Matthew 21:5 and John 12:15 say to Tell the daughter of Sion that her King is coming to her! Hebrews 12:22 says the Believer has not come to a smoking and burning physical mountain that cannot be touched but unto Mount Sion the City of the Living God.</p>\n<blockquote>Hebrews 12:22&mdash;But ye are come unto mount Sion, and unto the city of the living God, the heavenly Jerusalem, and to an innumerable company of angels,</blockquote>\n<p>The word &quot;zion&quot; expresses ideas of strength and permanence such as a fortress, monument, or landmark.</p>\n<p>Zion is called both the city of David (1 Kings 8:1; 1 Chronicles 11:5; 2 Chronicles 5:2) and the city of God. The fortress was considered so impenetrable they mocked David saying he would not be able to take fortress even with blind and lamb sentries on guard. David captured the Jebusite fortress in 2 Samuel 5:7:</p>\n<blockquote>Nevertheless David took the strong hold of Zion: the same is the city of David.</blockquote>\n<p>Mount Zion is also the highest and southernmost mount of Jerusalem, rising about twenty-five hundred feet above the Mediterranean, but Scripture emphasizes Mount Zion more as a Spiritual concept and less as a physical place. Mount Zion is most importantly understood as the people of God.</p>\n<blockquote>Psalm 48:2&mdash;Beautiful for situation, the joy of the whole earth, is mount Zion, on the sides of the north, the city of the great King. 12 Walk about Zion, and go round about her: tell the towers thereof. 13 Mark ye well her bulwarks, consider her palaces; that ye may tell it to the generation following. 14 For this God is our God for ever and ever: he will be our guide even unto death.</blockquote>\n<h2>The 144,000 (vs. 1-2)</h2>\n<p>and with him an hundred forty and four thousand, having his Father's name written in their foreheads.</p>\n<p>2 And I heard a voice from heaven, as the voice of many waters, and as the voice of a great thunder: and I heard the voice of harpers harping with their harps:</p>\n\n<h2>A New Song (vs. 3-5)</h2>\n<blockquote>3 And they sung as it were a new song before the throne, and before the four beasts, and the elders: and no man could learn that song but the hundred and forty and four thousand, which were redeemed from the earth. 4 These are they which were not defiled with women; for they are virgins. These are they which follow the Lamb whithersoever he goeth. These were redeemed from among men, being the firstfruits unto God and to the Lamb.5 And in their mouth was found no guile: for they are without fault before the throne of God.</blockquote>\n\n## <div id=\"7\"/>7. Will Be Wed (Revelation 19)\n\n\n- The Bridegroom Who Will be Wed (vs. 7-10)\n\n## <div id=\"8\"/>8. Revelation 20:1-10 [**King of Righteousness**](#8)\n\nSatan Sealed in a Bottomless Pit (vs. 1-3)\n\nRe 20:1 And I saw an angel come down from heaven, having the key of the bottomless pit and a great chain in his hand.\n2 And he laid hold on the dragon, that old serpent, which is the Devil, and Satan, and bound him a thousand years,\n3 And cast him into the bottomless pit, and shut him up, and set a seal upon him, that he should deceive the nations no more, till the thousand years should be fulfilled: and after that he must be loosed a little season.\n\n###Souls Living and Reigning with Christ 1000 Years (vs. 4-6)\n\n(covered in future lesson)\n\n###Following the 1000 Years (vs. 7-10)\n\nAfter the 1000 year reign, the devil be released, deceive the nations and finally face his doom.\n\n#### Satan will be released for a season (vs. 7)\n\nSatan is loose, will then be bound, but released again and then punished. It seems like a great pity after 1,000 year of peace for the devil to be released, but it will be necessary. Verse 3 says that he \"MUST BE LOOSED\". There are three perspectives to consider when tackling this mystery.\n\n##### The Perspective of the Devil\n\nIt will prove that no matter how much time goes by and opportunity given him, he will always be the devil. He doesn't improve. It will be righteous to judge him eternally.\n\n##### The Perspective of Humanity\n\nThe nations during this 1,000 years need the grace and help of God, just as much as anyone. The loosing of the devil will prove that man's hasn't changed. The devil will still be deceiving and humanity that does not lean hard on God will still be deceived.\n\n##### The Perspective of God\n\nGod will have exhausted every measure of grace throughout the dispensations of time. An eternal hell would not be justified for a loving God, unless He first extended every possible invitation. (He tried everything and gave His best.) There will be no regrets or \"what if God had done something differently\" in eternity.\n\n#### Satan will deceive the nations (vs. 8)\n\nHe deceives the nations and terrible disaster ensues. It is the devil who has opened \"Pandora's Box\".\n\n#### Satan will face his doom (vs. 9-10)\n\nHell was specially prepared for the devil. Mathew 25:41\n\n### Great White Throne Judgment (vs. 11-15)\n\n\n\n\n## <div id=\"9\"/>9. The Lamb and New Jerusalem Reveation 22:22,23\n\nThe Lamb is the Temple\n\n> 22 And I saw no temple therein: for the Lord God Almighty and the Lamb are the temple of it.\n\nThe Lamb is the Light\n\n> 23 And the city had no need of the sun, neither of the moon, to shine in it: for the glory of God did lighten it, and the Lamb is the light thereof. 24 And the nations of them which are saved shall walk in the light of it: and the kings of the earth do bring their glory and honour into it.\n","lesson":31},{"type":"md","value":"<h1 id=\"B\"></h1>\n\n<blockquote>Revelation 1:9-20 &mdash; I John, who also am your brother, and companion in tribulation, and in the kingdom and patience of Jesus Christ, was in the isle that is called Patmos, for the word of God, and for the testimony of Jesus Christ. 10 I was in the Spirit on the Lord's day, and heard behind me a great voice, as of a trumpet, 11 Saying, I am Alpha and Omega, the first and the last: and, What thou seest, write in a book, and send it unto the seven churches which are in Asia; unto Ephesus, and unto Smyrna, and unto Pergamos, and unto Thyatira, and unto Sardis, and unto Philadelphia, and unto Laodicea. 12 And I turned to see the voice that spake with me. And being turned, I saw seven golden candlesticks; 13 And in the midst of the seven candlesticks one like unto the Son of man, clothed with a garment down to the foot, and girt about the paps with a golden girdle. 14  His head and his hairs were white like wool, as white as snow; and his eyes were as a flame of fire; 15 And his feet like unto fine brass, as if they burned in a furnace; and his voice as the sound of many waters. 16 And he had in his right hand seven stars: and out of his mouth went a sharp twoedged sword: and his countenance was as the sun shineth in his strength. 17 And when I saw him, I fell at his feet as dead. And he laid his right hand upon me, saying unto me, Fear not; I am the first and the last: 18  I am he that liveth, and was dead; and, behold, I am alive for evermore, Amen; and have the keys of hell and of death. 19 Write the things which thou hast seen, and the things which are, and the things which shall be hereafter; 20 The mystery of the seven stars which thou sawest in my right hand, and the seven golden candlesticks. The seven stars are the angels of the seven churches: and the seven candlesticks which thou sawest are the seven churches.</blockquote>\n\n<h2>THE WITNESS: HOW did John Hear and See</h2>\n\n<ul>\n\t<li>Their Companion in Tribulation (on isle of Patmos 13sq miles area and 32 miles from the coast of Asia Minor, exiled there under emperor Domitian) It was in this unfriendly place the awesome revelation was written.</li>\n\t<p>According to Tertullian (in The Prescription of Heretics) John was banished after being plunged into boiling oil in Rome around AD 95.</p>\n\t<li>I was in the Spirit on the Lord's Day</li>\n\n\t<p>\"In the Spirit\" Ezekiel 37:1 (valley dry bones);  Re 1:10 (in the spirit on the Lord's day); Re 4:2 (And immediately I was in the spirit); Re 17:3 (carried me away in the spirit);\n Re 21:10 (he carried me away in the spirit )</p>\n\n <p>Received in the Spirit and to be understood only by the Spirit</p>\n\n<blockquote>1 Corinthians 2:14 &mdash; But the natural man receiveth not the things of the Spirit of God: for they are foolishness unto him: neither can he know them, because they are spiritually discerned.</blockquote>\n\n<p>This does not mean the book of Revelation cannot be understood, but that in order to fully understand it we must be in that same condition of communion with the Spirit of God as John.</p>\n\n<blockquote>8 times in Revelation:  Re 13:9 If any man have an ear, let him hear what the Spirit saith ....</blockquote>\n\n<blockquote>Isaiah 50:4-- The Lord GOD hath given me the tongue of the learned, that I should know how to speak a word in season to him that is weary: he wakeneth morning by morning, <b>he wakeneth mine ear to hear as the learned</b>.</blockquote>\n\n</ul>\n\n<h2>WHAT did John Hear and See (Revelation 1:9-20)</h2>\n\n<h3> 1. His Voice</h3>\n\n<ul>\n\t<li>a great voice</li>\n\t<li>as of a trumpet</li>\n\t<li>his voice as the sound of many waters</li>\n</ul>\n\n<p>It was clearly a VOICE that John heard but it was LIKE a TRUMPET--urgent, clear, strong, awakening, and startling.</p>\n\n<p>God revealed Himself to Moses, on Mt.Sinai \"voice of a trumpet exceeding loud.\" (Exodus 19:16) The Temple opened its doors in the morning at the sound of the trumpet. The Year of Jubilee came with the sound of the trumpet. Lev. 25:9,10 The Silence of the Age will be broken by the sound of a trumpet.\n</p>\n\n<blockquote>I Thessalonians 4:16--The trumpet shall sound and the dead shall be raised.</blockquote>\n\n<h3> 2. His Age</h3>\n\n<ul>\n\t<li>I am Alpha and Omega, the first and the last</li>\n</ul>\n\n<h3> 3. His Vocation</h3>\n\n<ul>\n\t<li> I saw seven golden candlesticks; And in the midst of the seven candlesticks (v.20)</li>\n\t<li> he had in his right hand seven stars: (v.20)</li>\n\t<li> and out of his mouth went a sharp twoedged sword:</li>\n</ul>\n\n<p> His place is found <b>in the midst</b> of his church (PROPHET, PRIEST, KING)</p>\n\n\n<img src=\"/img/lampstand.png\" style={{float:\"right\", margin:\"15px\"}}/>\n\n<p><b>The candlesticks</b> give light, illumination, and revelation which guide us, warn us and make us aware. The Truth of the Gospel of Jesus Christ is a light! (Zechariah 4:2-6; Numbers 8:1-4)</p>\n\n<blockquote>John 8:12 Then spake Jesus again unto them, saying, I am the light of the world: he that followeth me shall not walk in darkness, but shall have the light of life.\nMatthew 5:14 Ye are the light of the world. A city that is set on an hill cannot be hid.\n\nMatthew 4:16-- The people which sat in darkness saw great light; and to them which sat in the region and shadow of death light is sprung up.\nLuke 1:79-- To give light to them that sit in darkness and in the shadow of death, to guide our feet into the way of peace.\nJohn 11:9-- Jesus answered, Are there not twelve hours in the day? If any man walk in the day, he stumbleth not, because he seeth the light of this world.\n2 Corinthians 4:6-- For God, who commanded the light to shine out of darkness, hath shined in our hearts, to give the light of the knowledge of the glory of God in the face of Jesus Christ.</blockquote>\n\n<p><b>\"Golden\"</b>\n<b>GREAT COST</b>. The candlesticks were composed of the costliest metal.\n\n<b>GREAT BEAUTY</b>. The tabernacle use filled with the use of gold. Gold is expressive of Godliness.\n\nPsalm 96:9-- O worship the LORD in the beauty of holiness: fear before him, all the earth.</p>\n\n<p><b>7</b> Churches = Entire Church Age. Completeness</p>\n\n<p>God has His ministers in His hand. He holds, controls, owns and will reward them</p>\n\n<h3> 4. His Divinity - the Christ</h3>\n\n<ul>\n<li> one like unto the Son of man</li>\n<li> I am he that liveth, and was dead; and, behold, I am alive for evermore, Amen; </li>\n<li> and have the keys of hell and of death.</li>\n</ul>\n\n<h3> 5. His Clothing</h3>\n\n<ul>\n<li> clothed with a garment down to the foot,</li>\n<li> and girt about the paps with a golden girdle. ( a golden belt Ephesisans 6 truth)</li>\n</ul>\n\n<p>FULLY CLOTHED</p>\n\n<p>Clothing Signified Status</p>\n\n<h3> 6. His Appearance</h3>\n\n<ul>\n<li>His head and his hairs were white like wool, as white as snow;</li>\n\n<p>His Wisdom and \"ELDER\"ness. Also a reminder of redemption  (sins red like crimson \"white as snow\")</p>\n<blockquote>Isa 1:18 Come now, and let us reason together, saith the LORD: though your sins be as scarlet, they shall be as white as snow; though they be red like crimson, they shall be as wool.</blockquote>\n\n<li>his eyes were as a flame of fire;</li>\n\n<blockquote>Re 2:23 And I will kill her children with death; and all the churches shall know that I am he which searcheth the reins and hearts: and I will give unto every one of you according to your works. (innermost parts)</blockquote>\n\n<li>his feet like unto fine brass, as if they burned in a furnace;</li>\n<li>his countenance was as the sun shineth in his strength.</li>\n<li><b>And when I saw him, I fell at his feet as dead.</b></li>\n</ul>","lesson":2}]