{"id":101,"courseId":"book-of-revelation","tasks":[],"title":"REV 036 THE DRAGON","fileType":"md","value":{"path":"C:\\sites\\github\\courses\\book-of-revelation/rev-036-the-dragon.md","raw":"# The Great Red Dragon - 12:3,4\r\n> Rev. 12: 3, 4 &quot;And there appeared another wonder in heaven; and behold a great red dragon, having seven heads and ten horns, and seven crowns upon his heads. And his tail drew the third part of the stars of heaven, and did cast them to the earth: and the dragon stood before the woman which was ready to be delivered, for to devour her child as soon as it was born.&quot;\r\n![](/assets/revelation/devil-word-cloud.png)\r\nIn our text is given &quot;another wonder&quot; (sign) that is to be interpreted after the same manner as the preceding &apos;sign.&apos; It is not a &apos;literal&apos; representation of the devil as he actually looks to the eye, but is &apos;figurative&apos; of the devil&apos;s characteristics. The great red dragon is symbolic of the devil&apos;s destructive and murderous character.\r\nThis wonder is a symbol of a fierce, hostile, evil power (satan) with which the Church has, and is, and must yet contend. This evil force is determined to hinder the progress of the Church and destroy her hopes.\r\n## The Dragon\r\n### The Image or &quot;Sign&quot; is that of a &quot;Dragon&quot;\r\nDragon means &apos;huge serpent&rsquot. Dragons have often been the embodiment of the fear of the unknown. In Greek mythology, these giant serpents often guarded the far and unexplored parts of the earth.\r\n> DRAGON &mdash; &quot;The dragon, figured prominently in ancient and medieval mythologies as an embodiment of evil principle. It has been superstitiously dreaded and even worshipped, as in China, where it is the imperial emblem. It is commonly represented as a large winged serpent, with a crested head and powerful claws. In classical mythology, a dangerous, often a supernatural serpent.&quot; &mdash;Standard Dictionary\r\nThe word _dragon_ is derived from the Greek word _drakōn_. This Greek word means &apos;to see&apos;. Ancient Greeks believe the _drakōn_ had incredible sight and could spot hiding prey no matter how well hid.\r\nThere is no doubt as to the significance of the dragon symbolizing the devil as the dragon is a symbol of a power that is harmful, wicked, evil, tyrannous and murderous. The devil is a hideous blood-thirsty monster, always &quot;seeking whom he may devour&quot; (1 Peter 5:8).\r\nUnderstand, this dragon is a terrible creature that delights in attacking, terrifying and devouring. It is especially determined to attack and destroy the truth of God&apos;s Word.\r\n> Matthew 13:19&mdash;&quot;When any one heareth the Word of the kingdom, and understandeth it not, then cometh the wicked one, and catcheth away that which was sown in his heart. This is he which received seed by the way side.&quot;\r\n> Luke 8:12&mdash;&quot;Those by the way side are they that hear; then cometh the devil, and taketh away the Word out of their hearts, lest they should believe and be saved.&quot;\r\n> 1 Peter 5:8&mdash;&quot;Be sober, be vigilant; because your adversary the devil, as a roaring lion, walketh about, seeking whom he may devour:&quot;\r\n### It is &quot;A Great Dragon&quot;\r\nWhile the picture in general is that of a dragon, it is altogether peculiar and different from the common dragon. It exceeds the ordinary idea in size and bulk, and every dragon feature is greatly magnified. The dragon is &quot;great&quot; in its evil accomplishment and great in its power to kill. It is &quot;a great&hellip; dragon.&quot;\r\n&quot;Megas&quot; &mdash; &quot;Great&quot;means mighty of external form, mighty in degree and intensity, mighty of rank (whether of persons or angels) of all those who have positions of authority and power\r\nHere is a being that has dared to set himself against the Almighty God. This &quot;dragon&quot; is trying to overcome Him and take over the universe by taking from the Creator His own creation.\r\n#### The devil has the power of death.\r\nHe has the power to put to death.\r\n> Heb. 2: 14 - Forasmuch then as the children are partakers of flesh and blood, He also Himself likewise took part of the same; that through death He might destroy him that had the power of death, that is, the devil;\r\nThe devil&apos;s ability to cause and create terrible afflictions is seen throughout the Bible, but the devil&apos; power to kill was greatly limited by Christ's sacrifice on the cross. The Law of God itself demanded death of EVERY soul that sinned. Now, because Christ paid the debt of death for the Believer, the devil has lost any legal claim to lives of the repentant. There is no such security for the unrepentant sinner.\r\n> Although the devil had the power of death, it was through death that Christ defeated him! &mdash;James Reynolds Sr.\r\n#### The devil has the ability to deceive.\r\nHe is great in his ability to deceive and destroy. The devil has the ability to deceive the whole world.\r\n> Revelation 12:9&mdash;And the great dragon was cast out, that old serpent, called the devil, and satan, which deceiveth the whole world: he was cast out into the earth, and his angels were cast out with him.\r\nWhat a power of deception must lie in him who deceives angels to follow him!\r\n### It is &quot;A Great Red Dragon&quot;\r\n![](/assets/revelation/red-hexagons.png)\r\nIt is &quot;red,&quot; seemingly for two reasons. The first is to enhance his terrible appearance. The second is suggestive of his murderous, destructive character. It is a peculiar color.&quot;Purrhos&quot; &mdash; &quot;Red&quot; &mdash; fiery &mdash; bloody &mdash; the color of blood &mdash; murder. This was the color of the horse whose rider was to take peace out of the world, and bring about terrible war and bloodshed.\r\n> Revelation 6:4&mdash;&quot;And there went out another horse that was red: and power was given to him that sat thereon to take peace from the earth, and that they should kill one another: and there was given unto him a great sword.&quot;\r\nJesus said the devil was a murderer from the beginning, and could not tell the truth.\r\n> Jn. 8:44 &quot;Ye are of your father the devil, and the lusts of your father ye will do. He was a murderer from the beginning, and abode not in the truth, because there is no truth in him. When he speaketh a lie, he speaketh of his own: for he is a liar, and the father of it.&quot;\r\n> &quot;There has never been a murder, but he (the devil) caused it.&quot;&mdash;Dr. J. A. Seiss\r\nFiery red also indicates the destructive and cruel nature of the dragon. The dragon is burning like fire with rage and out of control with malignant hatred against that which is righteous and godly.\r\n### It has &quot;Seven Heads&quot;\r\nSeven is a number of completeness, or fullness. This indicates the fullness of evil and wickedness. Dragons ordinarily were given one head, but this dragon possesses &quot;seven heads.&quot; Two heads would indicate confusion. Here there are seven heads. &quot;Seven heads&quot; also reveal a total and complete state of confusion. The head is the seat of governing power and it implies rule and control. The fact there are seven heads should be understood in the same sense that we read of &quot;the seven Spirits of God&quot; &mdash; a manifold unity. We have here in these heads the symbol of the entire imperial reign and rule of this world from the beginning of time to the end of this present age.\r\nThree times the Lord calls the devil &quot;&hellip;the prince of this world.&quot;\r\n> Jn. 12:31 &quot;&hellip;Now shall the prince of this world be cast out.&quot;\r\n> Jn. 14:30 &quot;&hellip;For the prince of this world cometh&hellip;&quot;\r\n> Jn. 16:11 &quot;&hellip;Because the prince of this world is judged.&quot;\r\nThe Apostle Paul called him the &quot;god of this world.&quot;\r\n> II Cor. 4:4 &quot;&hellip;The god of this world hath blinded the minds&hellip;&quot;\r\n> 1 John 5:19 &quot;&hellip;The whole world lieth in wickedness.&quot;\r\n> 1 John 5:19&mdash;&quot;The whole world (around us) is under the power of the evil one.&quot; (The Amplified Bible)\r\nThe image before us presents the dragon having dominion over the governments of this world. Therefore, through these world powers, he sets himself against the kingdom of God and all that is good and right.\r\n### It has &quot;Seven Crowns upon his Heads&quot;\r\nThe &quot;heads&quot; being &quot;crowned&quot; would indicate at least to some degree, that he has been successful in his diabolical attacks.\r\n#### Successful in Deceiving &mdash; A Crown\r\n> Rev. 12:9 &quot;And the great dragon&hellip; called the devil, and satan, which deceiveth the whole world&hellip;&quot;\r\n#### Successful in Dividing &mdash; A Crown\r\n> I Cor. 11: 18 &quot;&hellip;There be divisions among you&hellip;&quot;\r\n#### Successful in Defeating &mdash; A Crown\r\n> Matt. 24:12 &quot;And because iniquity shall abound, the love of many shall wax cold.&quot;\r\n#### Successful in Denying &mdash; A Crown\r\n> Jude 4 &quot;&hellip;Denying the only Lord God, and our Lord Jesus Christ.&quot;\r\n#### Successful in Devouring &mdash; A Crown\r\n> I Pet. 5:8 &quot;&hellip;Your adversary the devil, as a roaring lion, walketh about, seeking whom he may devour:&quot;\r\n#### Successful in Delaying &mdash; A Crown\r\n> Dan. 10:13 &quot;But the prince of the kingdom of Persia withstood me one and twenty days: but, lo, Michael, one of the chief princes, came to help me&hellip;&quot;\r\n#### Successful in Deforming &mdash; A Crown\r\n> Lk. 13:11 &quot;&hellip;A woman which had a spirit of infirmity eighteen years,and was bowed together, and could in no wise lift up herself.&quot;\r\nLk. 13:18 &quot;&hellip;Whom satan hath bound&hellip;&quot;\r\nHe is the destroyer of both body and soul. He seduceth and misleads the whole world, promising everything including peace and prosperity, so that he can more effectively enslave and destroy.\r\n### It has &quot;Ten Horns&quot;\r\n&quot;Ten&quot; signifies the perfection of Divine Order. This is in contrast to that of an evil, wicked being, so this would be in reverse of the Divine Order; complete and total disorder.\r\n&quot;Keras&quot; &mdash; &quot;Horns&quot; are symbolic of strength, power, dominion and kingly rule &mdash; kings and their kingdoms.\r\n> Dan.7: 24 - And the ten horns out of this kingdom are ten kings&hellip;;\r\nDan. 8:20 - The ram which thou sawest having two horns are the kings&hellip;\r\nThese &quot;horns&quot; are not symbols of good rule but of evil power to hurt, wound, afflict and destroy. The forces which destroyedPalestinewere referred to as &quot;four horns&quot; in Zech. 1: 18&mdash;21 They scattered, oppressed, injured and destroyed the people of God. Likewise, the &quot;horns&quot; of the dragon scatter, divide, oppress, torment, injure, afflict, destroy and kill the believers in Christ.\r\n### It has A Tail\r\n> Rev. 4: 12 &quot;&hellip;His tail drew the third part of the stars of heaven, and did cast them to the earth:&hellip;\r\nHis tail is certainly one of the most striking features of the dragon. It swings through heaven drawing a third part of the stars and casts them to the ground. These &quot;stars of heaven&quot; are very particular stars. They are not literal stars, for the whole scene is a &quot;sign.&quot; These were the angelic hosts, fitly called stars by reason of their brightness, shinning beauty and glory.\r\n> Job 38: 4&mdash;7 &quot;Where wast thou when I laid the foundations of the earth? declare, if thou hast understanding. Who hath laid the measures thereof, if thou knowest? or who hath stretched the line upon it? Whereupon are the foundations thereof fastened? or who laid the corner stone thereof; When the morning stars sang together, and all the sons of God shouted for joy?\r\nWhen Lucifer fell and became the devil, he was able to deceive and draw away a third part of the angels with him.\r\n> Jude 6 &quot;&hellip;Angels which kept not their first estate, but left their own habitation&hellip;\r\n> 2 Peter 2: 4 &mdash; &hellip; God spared not the angels that sinned&hellip;\r\nHis tail is symbolic of his ability to deceive not only angels, but also humanity (including Believers). The devil has been successful in deceiving or &apos;drawing away&apos; many saints of God. Many who secured a home in Heaven through Christ's atonement and their faith in His blood will let go of that faith and follow after the devil.\r\n> Matthew 24:24&mdash;For there shall arise false Christs, and false prophets, and shall shew great signs and wonders; insomuch that, if it were possible, they shall deceive the very elect.\r\n> Revelation 19:20&mdash;And the beast was taken, and with him the false prophet that wrought miracles before him, with which he deceived them that had received the mark of the beast, and them that worshipped his image. These both were cast alive into a lake of fire burning with brimstone.\r\n## The Mystery of the Dragon\r\nThe dragon is not altogether that great a mystery because of:\r\n> Rev. 12: 9 &quot;And the great dragon was cast out, that old serpent, called the devil, and satan, which deceiveth the whole world: he was cast out into the earth, and his angels were cast out with him.\r\nThe devil is not literally a dragon, as the Church is not literally a woman, but these are divinely given images or symbols. There is a devil. John recorded here that the dragon was the devil.\r\n> &hellip;The great dragon was cast out, that old serpent, called the devil, and satan, which deceiveth the whole world&hellip;\r\nThis is a great contrast from his original state.\r\n> Isa. 14: 12 &quot;How art thou fallen from heaven, O Lucifer, son of the morning! how art thou cut down to the ground&hellip;&quot;\r\n> Eze. 28: 14 &quot;Thou art the anointed cherub that covereth&hellip;&quot; He was the highest order of all God&apos;s creation.\r\n> Eze. 28: 15 &quot;Thou wast perfect in thy ways from the day that thou wast created&hellip;&quot;\r\n> Eze. 28: 17 &quot;Thine heart was lifted up because of thy beauty, thou hast corrupted thy wisdom by reason of thy brightness&hellip;&quot;\r\nPerfect in &quot;Beauty&quot; &mdash; Full of &quot;Wisdom&quot; &mdash; Clothed in &quot;Brightness&quot; (Light &mdash; Truth &mdash; Righteousness)\r\nLucifer fell from the anointed cherub that covereth, to a murderous dragon. What happened? What caused this terrible change? God did not make a dragon (devil); He created Lucifer &mdash; &quot;The light bearer.&quot; God created him with a free will to choose to do good or evil. He was not the devil, but he became the devil through the desire to be like God, or to be God.\r\nThe dragon has great power.\r\n* Power over the nations Lk. 4: 6* Power of the air Eph. 2: 2* Power and signs II Thes. 2: 9* Power of death Heb. 2: 14\r\n> Jude 9 - Yet Michael the archangel, when contending with the devil he disputed about the body of Moses, durst not bring against him a railing accusation, but said, the Lord rebuke thee.\r\nLucifer is of the highest order of angelic beings, but is subordinate to God. Some compare the dragon in Rev. 12 to the Beast coming up out of the sea in Rev. 13\\. In Rev. 12, the seven heads wear the crowns. In Rev. 13, it is the horns that are crowned. The dragon is the head of a spiritual empire while the Beast is the head of a physical empire. This portrays a concentration of, and the exercise of, the devil&apos;s diabolical power in and through the world powers.\r\nThere is a likeness between the Dragon and the Beast because they are both the workings of the devil. There is also the distinction between them because one works in the spiritual realm and the other works in the physical realm.\r\n## The Objects of The Dragon&apos;s Malignity\r\nRev. 12:4 &quot;&hellip;And the dragon stood before the woman which was ready to be delivered, for to devour her child as soon as it was born.&quot;\r\n### The First Objective is to Devour the &apos;Man-Child'\r\nTo destroy and devour the &quot;Man-Child,&quot; the devil would have to destroy the message (the Truth of the Word) that produces the &quot;Man-Child.&quot; If there ever was a message that the devil hates, it is this message of the &quot;Man-Child&quot; &mdash; the message ofovercoming&mdash; the message ofperfection. Jesus said:\r\n> Matt.13:19 &quot;Then cometh the wicked one, and catcheth away that which was sown&hellip;\r\nThe power of the Word is &quot;&hellip;made of none effect&hellip;&quot; (Rom.4: 14) in the lives of those that &quot;&hellip;understandeth it not.&quot; (Matt. 13:19)\r\nWhen the Word is received and understood, it will produce the characteristics of Christ in the life of the believer. The Word produces to the extent that it is believed and obeyed. Jesus said by the same &quot;Word&quot; some would produce &quot;&hellip;thirty, and some sixty, and some an hundred&hellip;&quot;\r\n> Mk. 4:20 &quot;&hellip;Such as hear the Word, and receive it, and bring forth fruit, some thirtyfold, some sixty, and some an hundred.&quot;\r\nThe Scripture speaks of some as babes, some as children and some of mature age.\r\n> Heb. 5:12&mdash;14 &quot;For when for the time ye ought to be teachers, ye have need that one teach you again which be the first principles of the oracles of God; and are become such as have need of milk, and not of strong meat. For every one that useth milk is unskilful in the Word of righteousness: for he is a babe. But strong meat belongeth to them that are of full age, even those who by reason of use have their senses exercised to discern both good and evil.&quot;\r\nThe &quot;Man-Child&quot; will be a ruling body of Overcomers that will be given power to rule the nations.\r\n> Rev. 2:26, 27 &quot;And he that overcometh, and keepeth My works unto the end,tohim will I give powerover the nations: Andhe shall rule them with a rod of iron; as the vessels of a potter shall they be broken to shivers:even as I received of My Father.&quot;\r\nPsa. 2:9 &quot;Thou shalt break them with a rod of iron; thou shalt dash them in pieces like a potter&apos;s vessel.&quot;\r\nHere we see Christ ruling with the rod of iron. It is said that Rev. 12 has to be Christ because they believe He is the only one that is ruling with the rod of iron. The Overcomer has this promise of being given this power to rule the nations with a rod of iron.\r\nThe devil will try to devour the &quot;Man-Child&quot; as soon as he is born, but the &quot;Man-Child&quot; will be &quot;&hellip;caught up unto God, and to His throne.&quot; This is the promise to the Overcomer.\r\n> Rev. 3:21 &quot;To him that overcometh will I grant to sit with Me in My throne, even as I also overcame, and am set down with My Father in His throne.&quot;\r\nThe dragon&apos;s desire is to devour the &quot;Man-Child&quot; who is destined to &quot;&hellip;rule all the nations with a rod of iron&hellip;&quot; that the dragon has ruled over. All satanic activities are carried out under the ambitious motive to rule and to be worshipped. Does the devil know he will lose this place?\r\nWhen this objective failed, he attacked the Woman.\r\n### The Second Objective is to Devour the &quot;Woman&quot;\r\n> Rev. 12:13 &quot;And when the dragon saw that he was cast unto the earth, he persecuted the woman which brought forth the man child.&quot;\r\nIn the Gospel according to St. Luke, Jesus spoke of the great and awful signs of the last three-and-a-half years of the Tribulation Hour.\r\n> Lk. 21:12 &quot;But before all these, they shall lay their hands on you, and persecute you, delivering you up to the synagogues, and into prisons, being brought before kings and rulers for My name&apos;s sake.&quot;\r\n&quot;Basileus&quot; &mdash; &quot;King&quot; &mdash; a sovereign &mdash; ruler &mdash; dictator (kings are not presidents)\r\nSeveral years ago the Lord showed me in a dream that the Church was going to go through &quot;Great Persecution.&quot; The Church is persecuted for three-and-a-half years to bring her to a place of separation from the world and complete dedication to the Lord.\r\n> Rev. 12:6 &quot;And the woman fled into the wilderness, where she hath a place prepared of God, that they should feed her there a thousand two hundred and threescore days.&quot; (Three-and-a-half years)\r\nRev. 12:15 &quot;And the serpent cast out of his mouth water as a flood (false doctrine) after the woman, that he might cause her to be carried away of the flood (false doctrine).&quot;\r\nWhen this failed, he attacked the &quot;remnant of her seed.&quot;\r\n### The Third Objective is to Destroy the Seed\r\n> Rev. 12:17 &quot;And the dragon was wroth with the woman, and went to make war with the remnant of her seed&hellip;&quot;\r\nThe &quot;remnant of her seed&quot; is the saints that are left after the Rapture of the Church, which takes place in the middle of the Tribulation Hour. These saints find themselves facing the last three-and-a-half years of the Tribulation. They are represented by the foolish virgins that neglected their experience. They will have to wash their robes in the blood of the Lamb, and will come out of Great Tribulation.\r\n> Rev. 7:9 &quot;After this (the sealing of the 144,000 Jews) I beheld, and, lo, a great multitude, which no man could number, of all nations, and kindreds, and people, and tongues, stood before the throne, and before the Lamb, clothed with white robes, and palms in their hands;&quot;\r\nRev. 7:13, 14 &quot;And one of the elders answered, saying unto me, What are these which are arrayed in white robes? and whence came they? And I said unto him, Sir, thou knowest. And he said to me, These are they which came out of Great Tribulation, and have washed their robes, and made them white in the blood of the Lamb.&quot;\r\n## The Destiny of the Dragon\r\n### Cast out of Heaven\r\n> Rev. 12:8 &quot;&hellip;Neither was their place found any more in heaven.&quot;\r\nRev. 12:9 &quot;And the great dragon was cast out, that old serpent, called the devil, and satan, which deceiveth the whole world: he was cast out into the earth, and his angels were cast out with him.&quot;\r\nThe devil&apos;s place was not left empty, but was found no more. The &quot;Man-Child&quot; now occupies that place.\r\n### Bound in the Bottomless Pit\r\n> Rev. 20:1&mdash;3 &quot;And I saw an angel come down from heaven, having the key of the bottomless pit and a great chain in his hand. And he laid hold on the dragon, that old serpent, which is the devil, and satan, and bound him a thousand years, And cast him into the bottomless pit, and shut him up, and set a seal upon him, that he should deceive the nations no more, till the thousand years should be fulfilled: and after that he must be loosed a little season.&quot;\r\n### Loosed a Little Season\r\nThe dragon will be loosed for a short season. He goes forth and deceives many nations.\r\n> Rev. 20:3 &quot;&hellip;And after that he must be loosed a little season.&quot;\r\nRev. 20:7, 8 &quot;And when the thousand years are expired, satan shall be loosed out of his prison, And shall go out to deceive the nations which are in the four quarters of the earth, Gog and Magog, to gather them together to battle: the number of whom is as the sand of the sea.&quot;\r\n### Cast Ultimately into the Lake of Fire\r\nThe dragon will eventually be cast into the lake of fire, where he shall be tormented forever, and forever.\r\n> Rev. 20:10 &quot;And the devil that deceived them was cast into the lake of fire and brimstone, where the beast and the false prophet are, and shall be tormented day and night for ever and ever.&quot;\r\n"},"type":"READ_MD_FILE"}