{"id":1049,"courseId":"stephen-reynolds-jr-sermon-outlines","tasks":[],"title":"000 BECAUSE IT IS GOOD","fileType":"md","value":{"path":"C:\\sites\\github\\courses\\stephen-reynolds-jr-sermon-outlines/000_because-it-is-good.md","raw":"# Doing Good Because It is Good\r\n\r\nTEXT: Mark 10:17-27\r\n\r\n\r\nDoing not because it feels good, but because it is Good. Striving for a consistent Godly life.\r\n\r\nOur lives often are like a roller coaster. We get attached to the feel good parts of our faith. \"My sins are gone.\" \"I'm forgiven.\" But, forget how to behave when we don't 'feel so good.'\r\n\r\n## 1. Being Good Enough\r\n\r\n A Matter of Acceptance.\r\n\r\nMt 5:48 Be ye therefore perfect, even as your Father which is in heaven is perfect.\r\n-----\r\n CS LEWIS: MERE CHRISTIANITY: \"Unless you are perfect, I will not help you\"; and as we cannot be perfect, then, if He meant that, our position is hopeless. But I do not think He did mean that. I think He meant \"The only help I will give is help to become perfect.\r\n------\r\n### The Meaning of Goodness\r\n\r\n- What does it mean for a person to be good?\r\n- Is there goodness in all of us?\r\n\r\n> Genesis 1:31&mdash;And God saw every thing that he had made, and, behold, it was very good. And the evening and the morning were the sixth day.\r\n\r\nIsaiah 5:20&mdash; Woe unto them that call evil good, and good evil; that put darkness for light, and light for darkness; that put bitter for sweet, and sweet for bitter!\r\n\r\nPs 119:68 Thou art good, and doest good; teach me thy statutes.\r\n\r\nNO GOODNESS APART FROM GOD. Goodness is God's fingerprint.\r\n\r\nYou are accepted through Christ, not because of works you have done.\r\n\r\n## 2. Doing Good\r\n\r\nA Matter of Obedience. (Discipline of a godly life.)\r\n\r\n### The Desire: Goodness\r\n\r\nPs 34:14 Depart from evil, and do good; seek peace, and pursue it.\r\n\r\nRomans 12:21 overcome evil with good\r\n\r\n### The Problem: What Gets in the Way\r\n\r\nWaiting until I feel like it.\r\n\r\n### Remedy\r\n\r\nEmpowered to do good because it is good not necessarily because it feels good.\r\n\r\n> Ephesians 2:10 For we are his workmanship, created in Christ Jesus unto good works, which God hath before ordained that we should walk in them. \r\n\r\n#### Knowing The Standard for Good\r\n\r\n#### Understanding the Standard\r\n\r\n#### Applying the Standard\r\n\r\n"},"type":"READ_MD_FILE"}