{"id":1051,"courseId":"stephen-reynolds-jr-sermon-outlines","tasks":[],"title":"000 BY HIS OWN BLOOD","fileType":"md","value":{"path":"C:\\sites\\github\\courses\\stephen-reynolds-jr-sermon-outlines/000_by-his-own-blood.md","raw":"<!-- 20150531 -->\r\n\r\n# By His Own Blood\r\n\r\nTEXT: Leviticus 17:10-11; Hebrews 9:12-14\r\n\r\n> Leviticus 17:10-11&mdsash;And whatsoever man there be of the house of Israel, or of the strangers that sojourn among you, that eateth any manner of blood; I will even set my face against that soul that eateth blood, and will cut him off from among his people. 11 **For the life of the flesh is in the blood**: and I have given it to you upon the altar to make an atonement for your souls: for it is the blood that maketh an atonement for the soul.\r\n\r\nHeb 9:12 Neither by the blood of goats and calves, but **by his own blood** he entered in once into the holy place, having obtained eternal redemption for us. 13 For if the blood of bulls and of goats, and the ashes of an heifer sprinkling the unclean, sanctifieth to the purifying of the flesh: 14 How much more shall the blood of Christ, who through the eternal Spirit offered himself without spot to God, purge your conscience from dead works to serve the living God?\r\n\r\n## INTRODUCTION: The Bible is a Bloody Book\r\n\r\nThe word \"blood\" is found in 378 verses in the Bible (285 OT; 93 NT).\r\n\r\n1Jo 5:8 And there are three that bear witness in earth, the Spirit, and the water, and the blood: and these three agree in one.\r\n\r\nWhy does the Bible Emphasize the Blood? Why is it so Important?\r\n\r\n## I. The Lesson in the Blood\r\n\r\n### The Secret to the Favor of God is in the Blood\r\n\r\n&hellip;*I will even set my face against that soul that eateth blood*&hellip;\r\n\r\nGod is making a strong and serious point. As the the master teacher, he is giving Israel a shadow of a fuller revelation to come.\r\n\r\n### The Life is in the Blood (Leviticus 17:10-11)\r\n\r\n*For the life of the flesh is in the blood*&hellip;\r\n\r\nWithout the Blood, there can be no life. When the blood fails to reach the cells in the body, even in that partial way, those cells begin to die.\r\n\r\nEvery cell in the body, is dependent on the continual flow of the blood.\r\n\r\n### The Atonement is in the Blood\r\n\r\n&hellip; *it is the blood that maketh an atonement for the soul*.\r\n\r\nATONEMENT: to cover; to purge; to cleanse; to pardon; to reconcile;\r\n\r\nIf Israel would perform the sacrifice as commanded by God, that blood (through faith) would serve as COVERING for their sin.\r\n\r\n## II. The Power in the Blood\r\n\r\nThe last part of text spans over the realm of instruction and shadows and introduces us to God's POWERFUL plan of redemption.\r\n\r\nBY HIS OWN BLOOD\r\n\r\n### By His Own Blood, Alone\r\n\r\n> Matthew 26:28&mdash;For this is my blood of the new testament, which is shed for many for the remission of sins.\r\n\r\n> Heb 10:4 For it is not possible that the blood of bulls and of goats should take away sins.\r\n\r\nWithout the Blood of Jesus, the blood of the bulls and goats mean nothing.\r\n\r\n### By His Own Blood, He hath Purchased His Church\r\n\r\n> Acts 20:28 Take heed therefore unto yourselves, and to all the flock, over the which the Holy Ghost hath made you overseers, to feed the church of God, which he hath purchased with his own blood.\r\n\r\nHe created us but it was through His shed blood that he restored himself as the head of the body. The blood of Jesus was the price paid.\r\n\r\nNot the miracles, the teachings, the personal self-sacrifice of our lord throughout his ministry, not even the rising from the dead in itself, but it is upon His shed blood the plan of God is founded.\r\n\r\n### By His Own Blood, The Word of God is Life Giving\r\n\r\n> Hebrews 4:12 For the word of God is quick, and powerful, and sharper than any two-edged sword, piercing even to the dividing asunder of soul and spirit, and of the joints and marrow, and is a discerner of the thoughts and intents of the heart.\r\n\r\n> Philippians 2:6 Who, being in the form of God, thought it not robbery to be equal with God: 7 But made himself of no reputation, and took upon him the form of a servant, and was made in the likeness of men: 8 And being found in fashion as a man, he humbled himself, and became obedient unto death, even **the death of the cross**.\r\n\r\nDo We Want a Bloodless Bible?\r\n\r\nWithout the Blood of Jesus, the Bible would be just like any other book. \r\n\r\n### By His Own Blood, We Experience Christ's Death and Life\r\n\r\n> 1Co 10:16 The cup of blessing which we bless, is it not *the communion of the blood of Christ*? The bread which we break, is it not the communion of the body of Christ?\r\n\r\n>Romans 3:25 Whom God hath set forth to be a propitiation *through faith in his blood*, to declare his righteousness for the remission of sins that are past, through the forbearance of God; \r\n\r\n### By His Own Blood, God Brings Us Close\r\n\r\n> Ephesians 2:13 But now in Christ Jesus ye who sometimes were far off are *made nigh by the blood of Christ*.\r\n\r\nFAR: to be far off signifies to be under his displeasure.\r\n\r\nNEAR: To be in the favour of God. "},"type":"READ_MD_FILE"}