{"id":1053,"courseId":"stephen-reynolds-jr-sermon-outlines","tasks":[],"title":"000 DOES MAN HAVE A CHOICE","fileType":"md","value":{"path":"C:\\sites\\github\\courses\\stephen-reynolds-jr-sermon-outlines/000_does-man-have-a-choice.md","raw":"# Does God Give Men a Genuine Choice?\r\n\r\n## Related Questions\r\n\r\n- Is God's Grace resistable?\r\n- When God Tells Us to Choose, Do We Really Have a Choice?\r\n- Are our spiritual choices meaningful and decisive to our eternal outcome?\r\n\r\n## Other Side\r\n\r\n> Romans 9:19&mdash;Thou wilt say then unto me, Why doth he yet find fault? For who hath resisted his will? 20 Nay but, O man, who art thou that repliest against God? Shall the thing formed say to him that formed it, Why hast thou made me thus? 21 Hath not the potter power over the clay, of the same lump to make one vessel unto honour, and another unto dishonour?\r\n\r\n## General\r\n\r\n> Deuteronomy 30:19&mdash;I call heaven and earth to record this day against you, that I have set before you life and death, blessing and cursing: therefore choose life, that both thou and thy seed may live:\r\n<!-- -->\r\n> Joshua 24:15&mdash;And if it seem evil unto you to serve the LORD, choose you this day whom ye will serve; whether the gods which your fathers served that were on the other side of the flood, or the gods of the Amorites, in whose land ye dwell: but as for me and my house, we will serve the LORD.\r\n<!-- -->\r\n> 1 Chronicles 21:10&mdash;Go and tell David, saying, Thus saith the LORD, I offer thee three things: choose thee one of them, that I may do it unto thee. 11 So Gad came to David, and said unto him, Thus saith the LORD, Choose thee 12 Either three years' famine; or three months to be destroyed before thy foes, while that the sword of thine enemies overtaketh thee; or else three days the sword of the LORD, even the pestilence, in the land, and the angel of the LORD destroying throughout all the coasts of Israel. Now therefore advise thyself what word I shall bring again to him that sent me.\r\n<!-- -->\r\n> Psalm 25:12&mdash;What man is he that feareth the LORD? him shall he teach in the way that he shall choose.\r\n<!-- -->\r\n> Psalm 84:10&mdash;For a day in thy courts is better than a thousand. I had rather be a doorkeeper in the house of my God, than to dwell in the tents of wickedness.\r\n<!-- -->\r\n> Proverbs 1:29&mdash;For that they hated knowledge, and did not choose the fear of the LORD:\r\n<!-- -->\r\n> Proverbs 3:31&mdash;Envy thou not the oppressor, and choose none of his ways.\r\n<!-- -->\r\n> Isaiah 7:15&mdash;Butter and honey shall he eat, that he may know to refuse the evil, and choose the good.\r\n<!-- -->\r\n> Hebrews 5:8&mdash;Though he were a Son, yet learned he obedience by the things which he suffered; [obedience was something He LEARNED.]\r\n<!-- -->\r\n> Isaiah 7:16&mdash;For before the child shall know to refuse the evil, and choose the good, the land that thou abhorrest shall be forsaken of both her kings.\r\n<!-- -->\r\n> Isaiah 56:4&mdash;For thus saith the LORD unto the eunuchs that keep my sabbaths, and choose the things that please me, and take hold of my covenant;\r\n<!-- -->\r\n> Isaiah 65:12&mdash;Therefore will I number you to the sword, and ye shall all bow down to the slaughter: because when I called, ye did not answer; when I spake, ye did not hear; but did evil before mine eyes, and did choose that wherein I delighted not.\r\n<!-- -->\r\n> Isaiah 66:4&mdash;I also will choose their delusions, and will bring their fears upon them; because when I called, none did answer; when I spake, they did not hear: but they did evil before mine eyes, and chose that in which I delighted not.\r\n<!-- -->\r\n> Philippians 1:22&mdash;But if I live in the flesh, this is the fruit of my labour: yet what I shall choose I wot not.\r\n<!-- -->\r\n> 2 Thessalonians 2:13&mdash;But we are bound to give thanks alway to God for you, brethren beloved of the Lord, because God hath from the beginning chosen you to salvation through sanctification of the Spirit and belief of the truth:\r\n<!-- -->\r\n> Hebrews 11:25&mdash;Choosing rather to suffer affliction with the people of God, than to enjoy the pleasures of sin for a season;\r\n<!-- -->\r\n> Ezekiel 18:23&mdash;Have I any pleasure at all that the wicked should die? saith the Lord GOD: and not that he should return from his ways, and live?\r\n<!-- -->\r\n> Ezekiel 18:32&mdash;Eze 18:32 For I have no pleasure in the death of him that dieth, saith the Lord GOD: wherefore turn yourselves, and live ye.\r\n<!-- -->\r\n> Ezekiel 33:11&mdash;Say unto them, As I live, saith the Lord GOD, I have no pleasure in the death of the wicked; but that the wicked turn from his way and live: turn ye, turn ye from your evil ways; for why will ye die, O house of Israel?\r\n<!-- -->\r\n<!-- -->\r\n<!-- -->\r\n## Invitations/Opportunity to Make a Choice (the invitation is genuine)\r\n\r\n> Ex 32:26 Then Moses stood in the gate of the camp, and said, Who is on the LORD'S side? let him come unto me. And all the sons of Levi gathered themselves together unto him.\r\n<!-- -->\r\n> John 1:11 He came unto his own, and his own received him not.\r\n<!-- -->\r\n> Genesis 2:16-17&mdash;And the LORD God commanded the man, saying, Of every tree of the garden thou mayest freely eat: {thou&hellip;: Heb. eating thou shalt eat} 17 But of the tree of the knowledge of good and evil, thou shalt not eat of it: for in the day that thou eatest thereof thou shalt surely die. \r\n<!-- -->\r\n> Isaiah 1:18&mdash;Come now, and let us reason together, saith the LORD: though your sins be as scarlet, they shall be as white as snow; though they be red like crimson, they shall be as wool.\r\n<!-- -->\r\n>\r\n<!-- -->\r\n>\r\n<!-- -->\r\n>\r\n<!-- -->\r\n>\r\n<!-- -->\r\n>\r\n<!-- -->\r\n\r\n\r\n## Invitation to Repent (repentance is meaningful)\r\n\r\n> Ezekiel 18:30-32&mdash;Therefore I will judge you, O house of Israel, every one according to his ways, saith the Lord GOD. Repent, and turn yourselves from all your transgressions; so iniquity shall not be your ruin. 31 Cast away from you all your transgressions, whereby ye have transgressed; and make you a new heart and a new spirit: for why will ye die, O house of Israel? 32 For I have no pleasure in the death of him that dieth, saith the Lord GOD: wherefore turn yourselves, and live ye.\r\n<!-- -->\r\n> Matthew 4:17&mdash;From that time Jesus began to preach, and to say, Repent: for the kingdom of heaven is at hand.\r\n<!-- -->\r\n> Mark 1:15&mdash;And saying, The time is fulfilled, and the kingdom of God is at hand: repent ye, and believe the gospel.\r\n<!-- -->\r\n> Mark 6:12&mdash;And they went out, and preached that men should repent.\r\n<!-- -->\r\n> Luke 13:3,5&mdash;I tell you, Nay: but, except ye repent, ye shall all likewise perish.\r\n<!-- -->\r\n> Acts 2:38&mdash;Then Peter said unto them, Repent, and be baptized every one of you in the name of Jesus Christ for the remission of sins, and ye shall receive the gift of the Holy Ghost.\r\n<!-- -->\r\n> Acts 17:30&mdash;And the times of this ignorance God winked at; but now commandeth all men every where to repent:\r\n<!-- -->\r\n> Mark 16:15&mdash;And he said unto them, Go ye into all the world, and preach the gospel to every creature.\r\n<!-- -->\r\n> Revelation 14:6&mdash;And I saw another angel fly in the midst of heaven, having the everlasting gospel to preach unto them that dwell on the earth, and to every nation, and kindred, and tongue, and people,\r\n<!-- -->\r\n>\r\n<!-- -->\r\n>\r\n<!-- -->\r\n\r\n## It is God's Will that All Would be Saved\r\n\r\n> 1 Timothy 2:3-6&mdash;For this is good and acceptable in the sight of God our Saviour; 4 Who will have all men to be saved, and to come unto the knowledge of the truth. 5 For there is one God, and one mediator between God and men, the man Christ Jesus; 6 Who gave himself a ransom for all, to be testified in due time.\r\n<!-- -->\r\n>\r\n<!-- -->\r\n>\r\n\r\n"},"type":"READ_MD_FILE"}