{"id":1058,"courseId":"stephen-reynolds-jr-sermon-outlines","tasks":[],"title":"000 FULLNESS OF THE LORD","fileType":"md","value":{"path":"C:\\sites\\github\\courses\\stephen-reynolds-jr-sermon-outlines/000_fullness-of-the-lord.md","raw":"# The Full Reward of the Righteous\r\n\r\nPsalm 16 & \r\n> Psalm 58:11 So that a man shall say, Verily **there is a reward for the righteous**: verily he is a God that judgeth in the earth. *<<reward: fruit>>*\r\n\r\nA minister in England was preaching to a crowd of people in a street meeting. A rough man, driving past, shouted, \"Well, governor, you'll be getting a half crown for that job.\" Instantly, the minister replied, \"No, my man, you are wrong. The Lord Jesus Christ, my Master, never gives half crowns. He gives whole crowns to those who serve Him.\"\r\n\r\n--FULNESS, REPLETE, COVERED OVER\r\n\r\n## Fullness of Preservation\r\n\r\nDavid, sojourning among idolaters, and being obliged to leave his own country through Saul's persecution, cries to God for help; expresses his abhorrence of idolatry, and his desire to be again united to God's people,\r\n\r\n> **Psalm 16:1-4** Preserve me, O God: for in thee do I put my trust. 2 O my soul, thou hast said unto the LORD, Thou art my Lord: my goodness extendeth not to thee; 3 But to the saints that are in the earth, and to the excellent, in whom is all my delight. 4 Their sorrows shall be multiplied that hasten after another god: their drink offerings of blood will I not offer, nor take up their names into my lips.\r\n\r\n>**ILLUSTRATION**: Henry J. Westermeyer --- Have you become discouraged? Have you allowed something to keep you from being what you know you should be? Have you allowed depression or disaster to make you lose heart and to slacken your effort? If so, remember the Word of the Lord: \"That no man take thy crown.\" Be diligent; in season and out of season. Be faithful in the face of storm, as well as in times of sunshine, for if there is \"no battle, there will be no victory; no cross, no crown.\"\r\n\r\n> Re 3:11 Behold, I come quickly: hold that fast which thou hast, that no man take thy crown.\r\n\r\n- Fully Preserved -- **nothing lost**\r\n- David found himself in an holy place, but he was born of a holy seed!\r\n- prayer, intercession\r\n- A Request to kept separate\r\n- Is it worth it? How? increasingly complicated?\r\n\r\n## Fullness of Provision\r\n\r\n> **Psalm 16:5-7** &mdash; The LORD is the portion of mine inheritance and of my cup: thou maintainest my lot. 6 The lines are fallen unto me in pleasant places; yea, I have a goodly heritage. 7 I will bless the LORD, who hath given me counsel: my reins also instruct me in the night seasons.\r\n\r\n- Praise, thankfulness\r\n- Necessaary to keep an ETERNAL PERSPECTIVE\r\n\r\n## Fullness of Power\r\n\r\nProphecy of the Resurrection of Christ\r\n\r\n> **Psalm 16:8-11*** &mdash; I have set the LORD always before me: because he is at my right hand, I shall not be moved. 9 Therefore my heart is glad, and my glory rejoiceth: my flesh also shall rest in hope. 10 For thou wilt not leave my soul in hell; neither wilt thou suffer thine Holy One to see corruption. 11 Thou wilt shew me the path of life: in thy presence is fulness of joy; at thy right hand there are pleasures for evermore.\r\n\r\n\r\n- Where does this come from? IN a HEATHEN LAND, DAVID RECEIVED REVELATION OF Christ's Resurrection\r\n- Fulness of Joy : glee, exceeding gladness IN HIS PRESENCE\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n==================================\r\n\r\n\r\n> Lu 4:1 And Jesus being full of the Holy Ghost returned from Jordan, and was led by the Spirit into the wilderness,\r\n\r\n- \"replete\" : filled or well-supplied with something.\r\n- \"covered over\"\r\n\r\n> Joh 15:11 These things have I spoken unto you, that my joy might remain in you, and that your joy might be full.\r\n\r\n> Ac 2:28 Thou hast made known to me the ways of life; thou shalt make me full of joy with thy countenance.\r\n\r\n>Ac 6:3 Wherefore, brethren, look ye out among you seven men of honest report, full of the Holy Ghost and wisdom, whom we may appoint over this business.\r\n \r\n> Ac 6:5 And the saying pleased the whole multitude: and they chose Stephen, a man full of faith and of the Holy Ghost, and Philip, and Prochorus, and Nicanor, and Timon, and Parmenas, and Nicolas a proselyte of Antioch:\r\n \r\n> Ac 6:8 And Stephen, full of faith and power, did great wonders and miracles among the people.\r\n \r\n> Ac 7:23 And when he was full forty years old, it came into his heart to visit his brethren the children of Israel.\r\n\r\n> Ac 7:55 But he, being full of the Holy Ghost, looked up stedfastly into heaven, and saw the glory of God, and Jesus standing on the right hand of God,\r\n\r\n> Ac 9:36 Now there was at Joppa a certain disciple named Tabitha, which by interpretation is called Dorcas: this woman was full of good works and almsdeeds which she did\r\n\r\n> Ac 11:24 For he was a good man, and full of the Holy Ghost and of faith: and much people was added unto the Lord.\r\n\r\n> Ro 15:14 And I myself also am persuaded of you, my brethren, that ye also are full of goodness, filled with all knowledge, able also to admonish one another.\r\n\r\n> Php 2:26 For he longed after you all, and was full of heaviness, because that ye had heard that he had been sick.\r\n\r\n> Php 4:12 I know both how to be abased, and I know how to abound: every where and in all things I am instructed both to be full and to be hungry, both to abound and to suffer need.\r\n\r\n> Heb 5:14 But strong meat belongeth to them that are of full age, even those who by reason of use have their senses exercised to discern both good and evil. \r\n\r\n> Jas 3:17 But the wisdom that is from above is first pure, then peaceable, gentle, and easy to be intreated, full of mercy and good fruits, without partiality, and without hypocrisy. \r\n\r\n> 1Pe 1:8 Whom having not seen, ye love; in whom, though now ye see him not, yet believing, ye rejoice with joy unspeakable and full of glory:\r\n\r\n> 1Jo 1:4 And these things write we unto you, that your joy may be full.\r\n\r\n> 2 John 1:8 Look to yourselves, that we lose not those things which we have wrought, but that we receive a full reward. \r\n\r\n\r\n=========================="},"type":"READ_MD_FILE"}