{"id":1059,"courseId":"stephen-reynolds-jr-sermon-outlines","tasks":[],"title":"000 GODS LOVE AND MANS LOVE","fileType":"md","value":{"path":"C:\\sites\\github\\courses\\stephen-reynolds-jr-sermon-outlines/000_gods-love-and-mans-love.md","raw":"# God's Love Poured Out\r\n\r\n> Romans 5:5 And hope maketh not ashamed; because the love of God is shed abroad in our hearts by the Holy Ghost which is given unto us. 6 For when we were yet without strength, in due time Christ died for the ungodly. 7 For scarcely for a righteous man will one die: yet peradventure for a good man some would even dare to die. 8 But God commendeth his love toward us, in that, while we were yet sinners, Christ died for us.\r\n\r\n## I. The Pouring Out of God's Love By the Holy Ghost **v.5**\r\n> 5 &hellip;the love of God is shed abroad in our hearts by the Holy Ghost which is given unto us. \r\n\r\n### \"LOVE\" of God -- AGAPE \r\n\r\naffection or benevolence; a love-feast:--(feast of) charity(-ably), dear, love. \r\n\r\n### \"SHED ABROAD\" \r\n \r\n(to pour); to pour forth; to bestow:--gush (pour) out, run greedily (out), shed (abroad, forth), spill. \r\n\r\n\"Filling and quickening and invigorating all our powers and faculties!\" -- Adam Clarke\r\n\r\n#### 1. THE REASON & POWER of this Love: This is How we can Love God\r\n\r\n> 1 John 4:19&mdash;We love him, because he first loved us.\r\n\r\n#### 2. THE SECRET of this Love: This is a Love Worthy of God (it springs from Him)\r\n\r\n*How can we love God perfectly?*\r\n> Mark 12:30 And thou shalt love the Lord thy God with all thy heart, and with all thy soul, and with all thy mind, and with all thy strength: this is the first commandment.\r\n\r\nAs human love is sensual and earthly it is questionable at best. But this love which comes from God himself who is an eternal flame. YOU CAN LOVE GOD!\r\n\r\n#### 3. THE INFLUENCE of this Love: This Love is the Motive our Obedience\r\n\r\n### \"BY THE HOLY GHOST which is given unto <u>**us**</u>\"\r\n\r\nHow is God's love communicated to us by the Holy Ghost?\r\n\r\n**The Message of the Spirit**\r\n\r\n> God is love. God loves the individual. \r\n\r\nIt is nice when people say it, but the most convincing testimony is when the Holy Ghost says it directly to the heart.\r\n\r\nIt is an important part of the ministry of the Holy Ghost, to communicate God's love to the heart.\r\n\r\n- When the Word of God is Preached\r\n- When the Songs of Zion are Sung\r\n- When a Heart Cry is Made to God\r\n\r\n===================================================================\r\n## II. The Receivers of God's Love **vs. 6-8**\r\n\r\n### 2 Logical Reasons to Die for Someone\r\n \r\n#### Principled but Cold Reason -- Does he deserve my substitution? (MERIT OF MORAL CHARACTER but nothing endearing)\r\n7 For scarcely for a righteous man will one die: \r\n\r\n> ILLUSTRATION: \r\n\r\n#### Personal and Warm reason -- I really like this person, \"He's a good man. He has been good to others. ENDEARING.\"\r\nyet peradventure for a good man some would even dare to die. \r\n\r\n> ILLUSTRATION: \r\n\r\n### God's Love DEMONSTRATED to those neither RIGHTEOUS nor GOOD.\r\n8 But God commendeth his love toward us, in that, while we were yet sinners, Christ died for us.\r\n\r\n**The Condition of those for Whom Christ Died**\r\n6 For when we were yet without strength, in due time Christ died for the ungodly. \r\n\r\n#### 1. Without Strength - dying\r\n\r\n#### 2. Ungodly - no God in them\r\n\r\n#### 3. Sinners - always aiming, but missing the mark\r\n\r\n#### 4. Enemies - Hostile Toward God and His Holiness\r\n\r\n## CONCLUSION -- in Due Time\r\n\r\nThe Love of God is the source of our Love for Him and \r\nthe very motivation for our obedience. \r\nGod's Love was poured out on the cross for those neither righteous nor good.\r\nIt is the Holy Ghost that Pours God's Love Out to our Heart.\r\n\r\n"},"type":"READ_MD_FILE"}