{"id":1062,"courseId":"stephen-reynolds-jr-sermon-outlines","tasks":[],"title":"000 HOW TO BEGIN","fileType":"md","value":{"path":"C:\\sites\\github\\courses\\stephen-reynolds-jr-sermon-outlines/000_how-to-begin.md","raw":"# An Excellent Beginning\r\n\r\n>Matthew 11:25-30&mdash;At that time Jesus answered and said, I thank thee, O Father, Lord of heaven and earth, because thou hast hid these things from the wise and prudent, and hast revealed them unto babes. 26 Even so, Father: for so it seemed good in thy sight. 27 All things are delivered unto me of my Father: and no man knoweth the Son, but the Father; neither knoweth any man the Father, save the Son, and he to whomsoever the Son will reveal him. 28 Come unto me, all ye that labour and are heavy laden, and I will give you rest. 29 Take my yoke upon you, and learn of me; for I am meek and lowly in heart: and ye shall find rest unto your souls. 30 For my yoke is easy, and my burden is light.\r\n\r\n## Introduction\r\n\r\n### Context\r\n\r\n#### vs. 1-6\tJohn's Two Disciples \"Are you the Christ\"\r\n#### vs. 7-15 Speaking to the Multitude About John\r\n#### vs. 16-24 Comparing His Generation\r\n\r\n#### vs. 25-30 Revelation for the Infant Believer\r\n\r\n### Who were these 'babes' Christ mentioned?\r\n\r\nnepos a baby, (not speaking yet), immature Christian\r\n\r\n#### In Matthew, John and His Disciples\r\n\r\n#### In Luke, The 70\r\n\r\n\r\nIn Luke 10 (vs 21 prayed the same prayer Matthew 11:25) Christ's prayer is preceded by:\r\n\r\n- Christ sent out the 70 (lambs among wolves) with power and authority\r\n\r\n>Luke 10:17&mdash;And the seventy returned again with joy, saying, Lord, even the devils are subject unto us through thy name.\r\n\r\n<!---->\r\n\r\n> rejoice, because your names are written in heaven.\r\n\r\n#### Remember Peter (didn't really know what he was doing \"Thou art the Christ\")\r\n\r\n>Mt 16:17 And Jesus answered and said unto him, Blessed art thou, Simon Barjona: for flesh and blood hath not revealed it unto thee, but my Father which is in heaven.\r\n\r\n### What does the Bible say about Spiritual Babes?\r\n\r\n>Psalm 8:2&mdash;Out of the mouth of babes and sucklings hast thou ordained strength because of thine enemies, that thou mightest still the enemy and the avenger.\r\n\r\n**READ** 1 Corinthians 1:19-31\r\n\r\n<blockquote class=\"quote\">Understanding is the reward of faith. Therefore seek not to understand that thou mayest believe, but believe that thou mayest understand. --Augustine</blockquote>\r\n\r\n## A Peculiar Choice: Hide it from the Wise, Reveal it to the Babe (25)\r\n\r\nRevelation comes from God. It is God's to hide or manifest. He Chooses in mercy and wisdom to reveal truth even to spiritually immature.\r\n\r\nWise - sophos - wise, (in a bad sense: conceited), -->ALREADY know\r\nPrudent - sunetos - mentally put together, able to comprehend -->have it all figured out\r\n\r\n<blockquote class=\"quote\">Faith in God makes great optimists. Over in Burma, Judson was lying in a foul jail with 32 lbs. of chains on his ankles, his feet bound to a bamboo pole. A fellow prisoner said, \"Dr. Judson, what about the prospect of the conversion of the heathen?\", with a sneer on his face. His instant reply was, \"The prospects are just as bright as the promises of God.\" </blockquote>\r\n\r\n## A Simple Reason - The Babe is Hungry - Stay Hungry! (26-27)\r\n\r\nGod Has seen it as good.\r\n\r\n>vs. 26 Even so, Father: for so it seemed good in thy sight.\r\n\r\nThey are not hid from the other BECAUSE they are prudent and wise, so much as they are hungry.\r\n\r\nJohn was searching while the established religious were full.\r\n\r\n## An Engraved Invitation - Rest and Learn (28-29)\r\n\r\n>Matthew 11:28 Come unto me, all ye that labour and are heavy laden, and I will give you rest. 29 Take my yoke upon you, and learn of me; for I am meek and lowly in heart: and ye shall find rest unto your souls. 30 For my yoke is easy, and my burden is light.\r\n\r\n## Conclusion\r\n\r\nNot Having it all Figured Out is an opportunity for God to do what He does best!\r\n\r\n2Co 3:12 Seeing then that we have such hope, we use **great plainness of speech***:\r\n 13 And not as Moses, which put a vail over his face, that the children of Israel could not stedfastly look to the end of that which is abolished:\r\n 14 But their minds were blinded: for until this day remaineth the same vail untaken away in the reading of the old testament; which vail is done away in Christ.\r\n 15 But even unto this day, when Moses is read, the vail is upon their heart.\r\n 16 Nevertheless when it shall turn to the Lord, the vail shall be taken away.\r\n 17 Now the Lord is that Spirit: and where the Spirit of the Lord is, there is liberty.\r\n 18 But we all, with open face beholding as in a glass the glory of the Lord, are changed into the same image from glory to glory, even as by the Spirit of the Lord.\r\n\r\nYou have such an excellent beginning, when you begin to cry to God as Father!"},"type":"READ_MD_FILE"}