{"id":1064,"courseId":"stephen-reynolds-jr-sermon-outlines","tasks":[],"title":"000 LAST DOCTRINE","fileType":"html","value":{"path":"C:\\sites\\github\\courses\\stephen-reynolds-jr-sermon-outlines/000_last-doctrine.html","raw":"<h1>The Thing about a Last Doctrine - John 21:18,19; 2 Peter 1:1-11</h1>\r\n \r\n <h2>INTRODUCTION</h2>\r\n \r\n <p>Eschatology is \"the doctrine of last things\". It is a system of what the Bible tells us concerning the End times. Today: \"The Thing of a Last Doctrine\".</p>\r\n \r\n <p>Everybody has a point to make. An argue to present and promote. At the start, everyone is entitled to their own opinion because in the GENESIS my guess is just as good as yours on how things will pan out. Our guesses aren't settled science, but are like water. </p>\r\n\r\n <p>Difficulty, Trials, Tests, and the TIME of LIFE are God's way of simplifying and sharpening us.</p>\r\n \r\n <p>&quot;When the time comes to die, make sure that all you have to do is die!\" ~Jim Elliot&quot; </p>\r\n \r\n <p>It is the END that is most important. There is a pattern to the life of the flesh and another pattern of the life of the spirit. The life of the flesh is progressively worse. The life of the spirit is progressively better.</p>\r\n \r\n <h2>I appreciate the Preparation of a Man like Norman Lepage. In preparing a man, God is chiseling a conduit for HIS MESSAGE. \r\n \r\n <p>Any teaching I can give on PERFECTION, THE BRIDE, or the OVERCOMING life will be because of its messenger debated or shelved just as likely as RECEIVED. Experience gives weight and the testimony that comes from the hoary head means something.</p>\r\n \r\n <p>George Washington before the new Congress addressing unpaid officers of the army.</p>\r\n \r\n <p>His gray hair. I have a few, but am in need of borrowing even more from 3 of God's Generals.</p>\r\n \r\n <h2>Clayton Alward (God Save US!)</h2>\r\n \r\n <p>Last service with us, didn't preach, but prayed&hellip;</p>\r\n <p>LEGACY -- Brother Alward's prayer: \"Weld it together Lord, so the enemy can't tear it apart. God, We give ourselves Lord, in prayer today because of the need of our soul. God save our families. Save our children. God save our neighbors. Lord God, we have a big job and we need you to help us to accomplish it&hellip;\".</p>\r\n -- NOt just me, but US\r\n -- Bring Us Together, Keep Us Together\r\n -- Together with God's Help --\r\n \r\n ------------------------------------------\r\n <h2>James Reynolds, Sr. (Don't Lose Out on Something Better!)</h2>\r\n \r\n <p>I've been really burdened in spirit. There is a need today. There is a need in the social world, but the great need is in the church. Be very careful of things you here and adhere to. Not everything that is preached under the guise of Christianity is the Gospel. (\"Once you get into this thing, you can't get out.\") November 4, 2001 AM</p>\r\n \r\n\t 2Ti 2:19 Nevertheless the foundation of God standeth sure, having this seal, The Lord knoweth them that are his. And, Let every one that nameth the name of Christ depart from iniquity. [You should be pressing toward higher living.]\r\n\t Eph 2:10 For we are his workmanship, created in Christ Jesus unto good works, which God hath before ordained that we should walk in them. [ordained, or prepared]\r\n \r\n <p>Never get the message mixed up. God has a part and man has a part. God's part is to give as a gift eternal life. Man's part is to take care of that gift that has been given him. And if you don't take care of it, you lose it. It is going to be a terrible, terrible awakening for people when they realize they are still here and somebody left.</p>\r\n \r\n Last Eleven Sermons 2011(May 21, 2012 passed):\r\n \r\n<ol>\r\n\t<li>June 26A, God's Eternal Purpose</li>\r\n\t<li>July 10, The Love of God Revealed</li>\r\n\t<li>Aug 7A, The Faith of God</li>\r\n\t<li>Sept 4a, Believing to be Established</li>\r\n\t<li>Sept 25, Obedience Required for the Fulfillment of the Promise</li>\r\n\t<li>OCT 2A, The Fight of Faith</li>\r\n\t<li>OCT 23A, First Love</li>\r\n\t<li>NOV 6A, You Haven't Seen the End Yet</li>\r\n\t<li>NOV 20A, The Shield of Faith</li>\r\n\t<li>DEC 4A, God's Love for Man</li>\r\n\t<li>DEC 11A, Man's Love for God</li>\r\n</ol>\r\n\r\n--FAITH &amp; LOVE--\r\n\r\n<h2>Peter - (Remember the Call!)</h2>\r\n<p>vs. 12-15 Peter is near the end of his journey.</p>\r\n\r\n<p><b>\"3rd Epistle of Peter\"</b> ----- Now you who are called and chosen to go forth to all the nations and among all people, in time present and time to come, to preach the word, see you take to yourselves marks, nay, many outward marks, whereby you shall be known by all men.Be you not called as men are called; but be you called Pope, Archbishop, Archdeacon, or Divine, or Reverend, and Right Reverend, or some like holy name; so may you show forth your honor and your calling.And let your dwelling places be houses of splendor and edifices of cost; and let your doors be decked with plates of brass, and let your names, even your reverend titles, be graven thereon; so shall it be as a sign.Let your garments in which you minister be garments not as the garments of men, neither let them be \"seamless garments woven throughout;\" but let them be robes of richest silk and robes of fine linen, of curious device and of costly workmanship; and have you robes of black and robes of white, that you may change the one for the other; so shall you show forth your wisdom and humility.Let your fare be sumptuous, not plain and frugal as the fare of the husbandman who tills the ground; but live you on the fat of the land, taking \"good heed for the morrow and wherewithal you shall be fed.\"And drink you of the vines of the vintage brought from afar, and wines of great price; then shall the light of your spirits be the light of your countenances, and your faces shall be bright, even as the morning sun shall your faces glow in brightness; thus shall you show forth your moderation and temperance in all things. Let the houses in which you preach be, called churches, and let them be built in manner of great ornaments without, and adorned with much cost within; with rich pillars and paints, and with fine altars and pedestals, and urns of precious stones, and cloths and velvet of scarlet, and vessels of silver. And let there be rooms for the changing of robes, and places for the precious metals and mitres. And let the houses be divided into seats for the congregation, and let every man know his own seat; and let the first seats in front of the altar be for the rich that pay thousands; and the next for the poorer that pay by hundreds; and the last for those that pay tens. And let the poor man sit behind the door. And let the seats be garnished with cushions and crimson cloth, and with fine velvet; for if the houses of players and vain people who deal in idle sayings and shows of mockery, be rich and gorgeous, how much more so should be the houses that are dedicated to him \"that is meek and lowly of spirit\".\r\n</p>\r\n\r\n<p>vs. 3 \"He has called us to GLORY and VIRTUE.\" Beauty and Substance. (An EXPRESSION and NATURE.) vs. 4 WHEREBY (for the purpose of fulfilling this call HE has given unto us&hellip;.!</p>\r\n\r\n<li>partakers of the divine nature, having escaped the corruption that is in the world through lust.</li> \r\n5 And beside this, \r\n\r\n<li>giving all diligence, add to your faith virtue; </li> \r\n<li>and to virtue knowledge; </li>\r\n<li>6 And to knowledge temperance; </li>\r\n<li>and to temperance patience; </li>\r\n<li>and to patience godliness; </li>\r\n<li>7 And to godliness brotherly kindness;</li>\r\n<li>and to brotherly kindness charity.</li> \r\n\r\n<blockquote>8 For if these things be in you, and abound, they make you that ye shall neither be barren nor unfruitful in the knowledge of our Lord Jesus Christ. 9 But he that lacketh these things is blind, and cannot see afar off, and hath forgotten that he was purged from his old sins. 10 Wherefore the rather, brethren, give diligence to make your calling and election sure: for if ye do these things, ye shall never fall: 11 For so an entrance shall be ministered unto you abundantly into the everlasting kingdom of our Lord and Saviour Jesus Christ.</blockquote>\r\n\r\n<h2>Conclusion</h2>\r\n\r\n<p>Last things are a capstone. They either limit or catapult all that comes before it. Peter said, in the end, produce both beauty and substance. -- GLORY & virtue.</p>\r\n\r\n<p>Let us prepare ourselves and allow God to prepare our hearts daily so that the graph of our life is an incline in EXPRESSIONS and DEMONSTRATIONS of the GLORY and VIRTUE of God.</p>\r\n\r\n<p>The thing of a last doctrine is this, With God, the END is always just a beginning!</p>\r\n<ol>\r\n\t<li>Ruth was BETTER to Naomi than 10 sons.</li>\r\n\t<li>The New Covenant is founded on BETTER promises.</li>\r\n\t<li>Resurrection is the Seal of the Gospel</li>\r\n</ol>\r\n\r\n-------------------------------------------\r\n \r\nWhat makes the hour so dark?\r\n \r\nv.8 barren: idle\r\n\r\n1. Called Us to Glory and Virtue\r\n\r\nGLORY: 1391. doxa from the base of 1380; glory (as very apparent), in a wide application (literal or figurative, objective or subjective):--dignity, glory(-ious), honour, praise, worship. (151 x's in bible)\r\n\r\n\tMatt 4:8 devil showed jesus the GLORY of the kingdoms of the world\r\n\tMatt 6:13 God's is the kingdom, power and glory\r\n\t\r\n\r\n\r\nVIRTUE: 703. areth from the same as 730; properly, manliness (valor), i.e. excellence (intrinsic or attributed):--praise, virtue. (4 x's in bible: Phil. 4:8; 1 Peter 2:9; 2 Peter 1:3,5)\r\n\r\n Php 4:8 Finally, brethren, whatsoever things are true, whatsoever things [are] honest, whatsoever things [are] just, whatsoever things [are] pure, whatsoever things [are] lovely, whatsoever things [are] of good report; if [there be] any virtue, and if [there be] any praise, think on these things. {honest: or, venerable}\r\n 1Pe 2:9 But ye [are] a chosen generation, a royal priesthood, an holy nation, a peculiar people; that ye should shew forth the praises of him who hath called you out of darkness into his marvellous light: {peculiar: or, purchased} {praises: or, virtues}\r\n 2Pe 1:3 According as his divine power hath given unto us all things that [pertain] unto life and godliness, through the knowledge of him that hath called us to glory and virtue: {to: or, by}\r\n 2Pe 1:5 And beside this, giving all diligence, add to your faith virtue; and to virtue knowledge;\r\n\r\n\r\nState of Affairs\r\n\r\nMembers:\r\nArthur, Elva, Jerry Wing\r\nRobert, Aurora, Rosemary, Elizabeth Geraghty\r\nJacob Landry\r\nBruce Babbidge\r\nScott Henderson\r\nAlbert, Yvonne Johnson\r\n2 Africans\r\nBen, Jess, Ben, Bia, Ellyanna, Abby Carle\r\nRobert, Judith Carle\r\nPhilip Carle\r\nShiela Sanborn\r\nJulie, Avery Reynolds\r\nMarsha, Sophia Mann\r\nGreg Weidemann\r\nTerry Gieger\r\nSteven Mason\r\nGuadalupe Perez\r\nBilly, Priscilla, Ashley, Willy Webber\r\nJoseph Henderson\r\n\r\n\r\nWhat makes effective, will make successful?\r\n\r\nThe Spirit:\r\n\r\nStreet Ministry\r\nTent Revival\r\nBible Preaching in Church\r\nBible Teaching in Church\r\nDiscipleship, Counsel, Leaders and Followers\r\nChild Focused Ministry\r\nPersonal Relationship with Christ\r\nPrayer - Private and Corporate\r\nBible Reading & Study - private & corporate\r\nTestimony Given from All\r\nDeliverance from Devils\r\nHealing from God is for All\r\nGet the People to Believe\r\nHoly Living\r\nThe Bride of Christ \r\nThe Ministry of the Holy Ghost - baptisms, demonstrations, expressions, anointing\r\nWorship - in Spirit, in Truth, in Holiness\r\n\r\n"},"type":"READ_HTML_FILE"}