{"id":1065,"courseId":"stephen-reynolds-jr-sermon-outlines","tasks":[],"title":"000 LIFE OF FAITH 2","fileType":"md","value":{"path":"C:\\sites\\github\\courses\\stephen-reynolds-jr-sermon-outlines/000_life-of-faith-2.md","raw":"# Living By Your Faith Part 2\r\n\r\n> \"&hellip; just shall live by his faith &hellip;\" [H0530] Habakkuk 2:4\r\n\r\n> Romans 1:17 For therein is the righteousness of God revealed from faith to faith: as it is written, The just shall live by faith.\r\n\r\n## REVIEW:\r\n\r\n### What Does a Life Without Faith Look Like?\r\n\r\nLoren Eiseley:&hellip; when **he threw off the shackles of religion**, man has tried to answer these questions without reference to God. But **the answers that came back were not exhilarating, but dark and terrible**. \r\n\r\n- \"You are the accidental by-product of nature, a result of matter plus time plus chance. \r\n- There is no reason for your existence. \r\n- All you face is death.\"\r\n\r\nLife without God, that is Faith in God, leads only to a grave. (wicked and good alike)\r\n\r\n> DEFINITION \"absurd\": wildly unreasonable, illogical, or inappropriate, preposterous.\r\n\r\nLife without Faith in God, concludes with death. No matter what happens in the mean time, eventually you will cease to exist.\r\n\r\nWe are prisoners who await our execution. \r\nHaving no higher purpose, significance or value.\r\n\r\n### What Does the Life of Faith Look Like? Part 1\r\n\r\nBiblical Christianity therefore provides the two conditions necessary for a meaningful, valuable, and purposeful life for man: God and immortality. Because of this, we can live consistently and happily.\r\n\r\nHebrews 11:\r\n\r\n1. v.4 Abel offered a more excellent sacrifice\r\n\r\n**The favor of God is what gives any WORK permanent value.**\r\n\r\n2. v.5 Enoch was translated\r\n\r\n**How horrible the world is&hellip; Enoch escaped it even bypassing the grave by faith.**\r\n\r\n3. v.7 Noah Prepared an Ark and Became heir of Righteousness\r\n\r\n**In the face of bad NEWS, there's always a PLAN and therefor a DESIGNER.**\r\n\r\n> **Romans 8:28** And we know that all things work together for good to them that love God, to them who are the called according to his purpose.\r\n\r\n4. v.8 Abraham journeyed not knowing where to\r\n\r\nBy faith we access to an eternal strength to move forward even into the unknown with CONFIDENCE.\r\n\r\n--------------------------------\r\n\r\n> \"&hellip; just shall live by his faith &hellip;\" [H0530] Habakkuk 2:4\r\n\r\n## What does \"Living by Faith\" mean?\r\n\r\n### Living with Assurance\r\n\r\nOne of many benefits of FAITH is having ASSURANCE. **ASSURANCE**: safety, confidence, security, conviction, a promise that gives confidence\r\n\r\nHabakkuk contrasts the UPRIGHT with the TRANSGRESSOR. \r\n\r\nThe transgressors life is filled with false security because he ASSUMES his safety but has no such guarantee from God (PROUD). Habakkuk is prophesying the Chaldean Captivity is near and those who are 'fill with such arrogance' are not even \"thinking right\" (his mind isn't upright in him).** \"All is fine\" for no other reason than they have PRESUMED it** and the truth is ALL IS NOT FINE.\r\n\r\nThe UPRIGHT or RIGHTEOUS life is preserved because he is motivated by HIS FAITH. He that is **just/safe/righteous/\"fine\" by FAITH** shall live. Because He has heard and believed God's warning of the impending judgment will put action to that faith by **FLEEING**.\r\n\r\nHe that believes the promises of God, and has found life through believing, shall live by his faith. **ALIVE because of his faith.**\r\n\r\n#### \"Living By Faith\" is a **Genuine Life**.\r\n\r\nThe life of Faith, is not empty or misguided optimism, its a firm reliance for guidance and help from the Lord God of Heaven and Earth who cannot fail. We are safe and secure because He is holding our hand.\r\n\r\n**OSWALD CHAMBERS** - Faith for my deliverance is not faith in God. Faith means, whether I am visibly delivered or not, I will stick to my belief that God is love. There are some things only learned in a fiery furnace.\r\n\r\nFaith enables us to genuinely LIVE.\r\n\r\n#### \"Living by Faith\" is a **Privileged Life**\r\n\r\n**By this faith, we LIVE now and for eternity.** Faith in God affords us special privileges in this life and the one to come. Instead of self-delusion those we live by Faith have the assurance of God's Guarantees.\r\n\r\n> **ILLUSTRATION**: During the terrible days of the Blitz (A WW2 intense German assault on the UK) , a father, holding his small son by the hand, ran from a building that had been struck by a bomb. In the front yard was a shell hole. Seeking shelter as quickly as possible, the father jumped into the hole and held up his arms for his son to follow. Terrified, yet hearing his father's voice telling him to jump, the boy replied, \"I can't see you!\"\r\n\r\n> The father, looking up against the sky tinted red by the burning buildings, called to the silhouette of his son, **\"But I can see you. Jump!\"** The boy jumped, because he trusted his father. \r\n\r\n> The Christian faith enables us to face life or meet death, not because we can see, but with the **privilege of assurance that we are seen**.\r\n\r\nThere is no knowledge like that of a man who knows he is saved\r\n\r\n#### \"Living by Faith\" is an **Ordered Life**\r\n\r\nFaith (4102/pistis) is always received from God, and never generated by us.\r\n\r\n> **Romans 12:3** \"For through the grace given to me I say to everyone among you not to think more highly of himself than he ought to think; but to think so as to have sound judgment, as God has allotted to each a measure of faith (4102/pistis)\r\n\r\n> ILLUSTRATION: young man saved napoleon's life&hellip;captian of the guard&hellip;\"HE SAID it.\"\r\n\r\nThe life of Faith in God has in its actions the very **AUTHORITY** of God. \"HE SAID IT\" and that is enough.\r\n\r\n## What the Life of Faith Looks like, Hebrews 11 Continued\r\n\r\n5. v.9 Abraham sojourned in the Land of Promise\r\n\r\n\"living in tents\" -- remaining a stranger -- not at HOME IN THIS WORLD\r\n\r\n> Hebrews 11:10 For he looked for a city which hath foundations, whose builder and maker is God.\r\n\r\nWe cannot hold a genuine Biblical faith, and at the same time look be **AT HOME** in this world.\r\n\r\n6. v.17 Abraham offered Isaac\r\n\r\n> ILLUSTRATION: Missionary to Sahel, South of the Sahara savana that stretches 4,000 miles, all the moisture of the years comes between May to August, after that not a drop of rain falls for 8 months\r\n\r\n**October and November**&hellip;these are beautiful months. The granaries are full\r\n**December** comes, and the granaries start to recede. omit the morning meal.\r\n**January** not one family in fifty is still eating two meals a day.\r\n**February**, the evening meal diminishes.\r\n**March** meals shrink and children succumb to sickness.\r\n**April** is the month that haunts my memory. Most of the days are passed with only an evening cup of gruel.\r\n\r\nThen, inevitably, it happens. A six-or seven-year-old boy comes running to his father one day with sudden excitement. \"Daddy! Daddy! We've got grain!\" he shouts. \"\r\nThe father stands motionless. \"Son, we can't do that,\"\r\n\r\n**May** rains finally come, and when they do the young boy watches as his father takes the sack from the wall and does the most unreasonable thing imaginable. Instead of feeding his desperately weakened family, he goes to the field and with tears streaming down his face, he takes the precious seed and throws it away. He scatters it in the dirt! Why?\r\n\r\n -- **BECAUSE he believes in the harvest**\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n--------------\r\nContinue Later\r\n\r\n\r\n\r\n\r\n7. v.20 Isaac Blessed Jacob and Isaac Prophetically\r\n\r\n8. v.21 Jacob Blessed both sons of Joseph\r\n9. v.22 Joseph gave commandment concerning his bones (God will bring us out someday)\r\n10. v.23 Moses was hid three months\r\n11. v.24 Moses refused to be called the son of Pharaoh's daughter\r\n12. v.27 Moses forsook Egypt\r\n13. v.29 Israel passed through the Red Sea\r\n14. v.30 Walls of Jericho Fell\r\n15. v.31 Rahab perished not\r\n\r\n## What Does the Life of Faith Look Like?\r\n\r\nActs 15:9 \"purifying their hearts by faith\"\r\nActs 26:18 \"sanctified by faith\"\r\nRomans 1:17 \"live by faith\" (Gal. 3:11; Heb. 10:38)\r\nRomans 3:22 \"the righteousness of God which is by faith\" (Phil. 3:9)\r\nRomans 3:28 \"justified by faith\" (Romans 3:30; 5:1; Gal. 3:24)\r\nRomans 5:2 \"access (to God) by faith\"\r\nRomans 11:20 \"thou standest by faith\" (2 Cor. 1:24)\r\n2 Corinthians 5:7 \"we walk by faith\"\r\nGalatians 3:26 \"are the children of God by faith\"\r\nGalatians 5:5 \"wait for the hope of righteousness by faith\"\r\nEphesians 3:17 \"christ may dwell in your hearts by faith\"\r\nHebrews 4:2 united by faith"},"type":"READ_MD_FILE"}