{"id":1067,"courseId":"stephen-reynolds-jr-sermon-outlines","tasks":[],"title":"000 MAGINIFY THE LORD","fileType":"md","value":{"path":"C:\\sites\\github\\courses\\stephen-reynolds-jr-sermon-outlines/000_maginify-the-lord.md","raw":"# Magnify the Lord with Me (TEXT: Psalm 34:1-4)\r\n\r\n## Psalm 34\r\n\r\n1 {A Psalm of David, when he changed his behaviour before Abimelech; who drove him away, and he departed.} I will bless the LORD at all times: his praise shall continually be in my mouth. 2 My soul shall make her boast in the LORD: the humble shall hear thereof, and be glad. 3 O magnify the LORD with me, and let us exalt his name together. 4 I sought the LORD, and he heard me, and delivered me from all my fears. 5 They looked unto him, and were lightened:and their faces were not ashamed. 6 This poor man cried, and the LORD heard him, and saved him out of all his troubles. 7 The angel of the LORD encampeth round about them that fear him, and delivereth them. 8 O taste and see that the LORD is good: blessed is the man that trusteth in him. 9 O fear the LORD, ye his saints: for there is no want to them that fear him. 10 The young lions do lack, and suffer hunger: but they that seek the LORD shall not want any good thing. 11 Come, ye children, hearken unto me: I will teach you the fear of the LORD. 12 What man is he that desireth life, and loveth many days, that he may see good? 13 Keep thy tongue from evil, and thy lips from speaking guile. 14 Depart from evil, and do good; seek peace, and pursue it. 15 The eyes of the LORD are upon the righteous, and his ears are open unto their cry. 16 The face of the LORD is against them that do evil, to cut off the remembrance of them from the earth. 17 The righteous cry, and the LORD heareth, and delivereth them out of all their troubles. 18 The LORD is nigh unto them that are of a broken heart; and saveth such as be of a contrite spirit. 19 Many are the afflictions of the righteous: but the LORD delivereth him out of them all. 20 He keepeth all his bones: not one of them is broken. 21 Evil shall slay the wicked: and they that hate the righteous shall be desolate. 22 The LORD redeemeth the soul of his servants: and none of them that trust in him shall be desolate.\r\n\r\n- The Spirit of Magnifying God, v.1\r\n- The Invitation to Magnify God, v.2\r\n- The Power of Magnifying God, v.3\r\n- The Courage of Magnifying God, v.4\r\n\r\n<!-- ---------------------------------- -->\r\n<!-- ---------------------------------- -->\r\n## The Spirit of Magnifying God, v.1\r\n\r\n> Psalm 34:1&mdash; I will bless the LORD at all times: his praise shall continually be in my mouth.\r\n\r\n### The Meaning of Magnifying God\r\n\r\nThe word \"magnify' means literally \"to make great,\" and then, to make great in the view of the mind, or to regard and treat as great. \"To Make Large\" \"Boast\" \"Promote\"\r\n\r\nTo magnify, or exalt, &quot;do not mean that we can add any thing to the glory of the name or nature of God; but that \r\n- we should show forth, and publicly celebrate his majesty and greatness.\"\r\n- bring attention to His goodness!\r\n\r\n> Psalm 30:1&mdash;I will extol thee, O LORD; for thou hast lifted me up, and hast not made my foes to rejoice over me.\r\n\r\n1 Samuel 2:7 &mdash;The LORD makes poor and makes rich; he brings low and he exalts. \r\n\r\nGOD's PEOPLE ARE BLESSED. ------ Take care of ourself, Recognize God and Share with others. ----- God exalts the humble by delivering them out of danger and into safety, While man's response is to exalt God by proclaiming God's supreme exaltedness.\r\n\r\n\"He is High and lifted up!\" \r\n\r\n> Isaiah 6:1&mdash;In the year that king Uzziah died I saw also the Lord sitting upon a throne, high and lifted up, and his train filled the temple.\r\n\r\nProclaim God's supreme exaltedness. Ascribe Greatness\r\n\r\nTo Whom do we Give the Credit? \r\n\r\n### Somebody TESTIFY\r\n\r\nv.4 \"he Heard me and delivered &hellip;\"\r\nv. 6 THIS POOR MAN CRIED\r\nv.8 \"taste and see that the Lord is good\"\r\nv.17 \"delivereth them out of all their troubles\"\r\n\r\n### Song\r\n\r\n#### David\r\n\r\n> Psalm 69:30&mdash;I will praise the name of God with a song, and will magnify him with thanksgiving.\r\n\r\n#### Chorus\r\n\r\nO magnify the Lord, For He is worthy To be praised\r\nO magnify the Lord, For He is worthy To be praised\r\n\r\nHosanna Blessed be the Rock, \r\nBlessed be the Rock, Of my Salvation\r\n\r\n#### Moses' Song\r\n\r\n> Exodus 15:1 Then sang Moses and the children of Israel this song unto the LORD, and spake, saying, I will sing unto the LORD, for he hath triumphed gloriously: the horse and his rider hath he thrown into the sea. 2 The LORD is my strength and song, and he is become my salvation: he is my God, and I will prepare him an habitation; my father's God, and I will exalt him.\r\n\r\n#### Bro. McLain \"America, Make God Great Again!\"\r\n\r\n#### Mary\r\n\r\n> Luke 1:46&mdash;And Mary said, My soul doth magnify the Lord,\r\n\r\n#### Gentile Believers were Filled with the Holy Ghost\r\n\r\n> Ac 10:46-47&mdash;For they heard them speak with tongues, and magnify God. Then answered Peter, Ac 10:47 Can any man forbid water, that these should not be baptized, which have received the Holy Ghost as well as we?\r\n\r\n## The Invitation to Magnify God, v. 2\r\n\r\n> Psalm 34:2&mdash;My soul shall make her boast in the LORD: the humble shall hear thereof, and be glad.\r\n\r\nDavid makes his plea to the HUMBLE! v.2 \"humble shall hear thereof and be glad\"\r\n\r\nThe Humble Will Hear and Be Glad (Others might to perceive it as an invitation, but the HUMBLE DO!\r\n\r\nDavid has been HUMBLED. As only they can truly appreciate David's request. The Humble share a common experiences of trial, loss and through that the Goodness of God. So they also should share in PRAISE of God!\r\n\r\n===========================================================================\r\n\r\nTESTIMONIES:\r\n\r\n- Horatio Spafford \"It is Well\"\r\n\r\nThis hymn was written after traumatic events in Spafford's life. The first was the death of his son at the age of 2 and the Great Chicago Fire of 1871, which ruined him financially. he sent the family ahead to Europe while he was delayed on business. While crossing the Atlantic, the ship sank rapidly after a collision with a sea vessel, the Loch Earn, and all four of Spafford's daughters died. His wife Anna survived and sent him the now famous telegram, \"Saved alone &hellip;\". \r\n\r\nThe Spaffords later had three more children. On February 11, 1880, their son, Horatio Goertner Spafford, died at the age of four, of scarlet fever. Their Presbyterian church regarded their tragedy as DIVINE PUNISHMENT. \"What had the Spaffords done that God could visit such misfortunes upon them?\" In response, the Spaffords left the church Horatio has help start and started a new fellowship, dubbed \"the Overcomers\" by American press. Who ultimoately mooved to Jerusalem, the fellowhsip there grew to a couple hundred and they worked with the poor and needy.\r\n\r\nSpafford Childrens Hospital in Old Jeruselam\r\n\r\n\r\n===========================================================================\r\n\r\n## The Power of Magnifying God, v.3\r\n\r\n> Psalm 34:3&mdash;3 O magnify the LORD with me, and let us exalt his name together.\r\n\r\n\"Join Your Praises with Mine\"\r\nALIKE -- All without exception\r\nTOGETHER -- \"Maybe not all in the same place, but with the same heart let our praise reach the ear of God as one!\"\r\n\r\nDavid had fled from King Saul and was not safe to return to Jerusalem.\r\n\r\n> 1 Samuel 21:10-15&mdash; And David arose and fled that day for fear of Saul, and went to Achish the king of Gath. 11 And the servants of Achish said unto him, Is not this David the king of the land? did they not sing one to another of him in dances, saying, Saul hath slain his thousands, and David his ten thousands? 12 And David laid up these words in his heart, and was sore afraid of Achish the king of Gath. 13 And he changed his behavior before them, and feigned himself mad in their hands, and scrabbled on the doors of the gate, and let his spittle fall down upon his beard. \r\n\r\nDavid could not just got to the place of worship in Jerusalem and yet he could still call for the WORSHIPERS OF GOD TO COME MAGNIFY GOD TOGETHER.\r\n\r\n\r\n## The Courage of Magnifying God, v. 4\r\n\r\n> 4 I sought the LORD, and he heard me, and delivered me from all my fears.\r\n\r\nDavid appears faultless when you read his psalms of praise. But he was not without his weakness. \r\n\r\nHis key to greatness was that his prayers silenced his fears.\r\n\r\nDavid did not wait till the threat was passed to pray, but sought the Lord in his trouble and God delivered from his fear.\r\n"},"type":"READ_MD_FILE"}