{"id":1068,"courseId":"stephen-reynolds-jr-sermon-outlines","tasks":[],"title":"000 MANS NEED FOR GOD AND GODS NEED FOR MAN","fileType":"html","value":{"path":"C:\\sites\\github\\courses\\stephen-reynolds-jr-sermon-outlines/000_mans-need-for-god-and-gods-need-for-man.html","raw":"<!DOCTYPE html><html><head><meta charset=\"utf-8\"><style></style><title>000_mans-need-for-god-and-gods-need-for-man</title></head><body><article class=\"markdown-body\"><!-- 20150301P -->\r\n\r\n<h1>Man's Need for God and God's Need for Man</h1>\r\n<p>text: James 4:1-10, vs. 7</p>\r\n<p>With more frequent violence in militant Islam and battle lines drawn over doctrinal differences, religion is increasingly being blamed as </p>\r\n<ul>\r\n<li>\"the main source of hatred in the world\". </li>\r\n<li>\"taking us back to middle ages\"</li>\r\n<li>humanist chaplain at Harvard University wrote \"Good without God\"</li>\r\n<li>Neruroscientist Sam Harris in his \"The End of Faith\" it is not merely religious extremism that is the greatest problem confronting civilization, but it is rather faith itself.</li>\r\n</ul>\r\n<p>I won't try to defend religion so much tonight as combat the most dangerous inference of these statement&hellip;.that, for whatever reasons, man does not NEED God.</p>\r\n<p>But not only does man severly need God, but God also in another sense needs man.</p>\r\n<h2>2. Man's Need for God</h2>\r\n<h3>Man is Needy (In Time of Need)</h3>\r\n<blockquote>\r\n<p>Heb 4:16 Let us therefore come boldly unto the throne of grace, that we may obtain mercy, and find grace to help in time of need.</p>\r\n</blockquote>\r\n<p>How often do we face circumstances too much for us? Where can you run to?</p>\r\n<h3>Man Needs a Physician</h3>\r\n<blockquote>\r\n<p>Matthew 9:12 But when Jesus heard that, he said unto them, They that be whole need not a physician, but they that are sick.</p>\r\n</blockquote>\r\n<ul>\r\n<li>Mental Illness</li>\r\n<li>Youth Criminality</li>\r\n<li>Militant Religions</li>\r\n<li>The World is Sick and Humanism can't fix it</li>\r\n</ul>\r\n<h3>God is the Supplier</h3>\r\n<blockquote>\r\n<p>Philippians 4:19 But my God shall supply all your need according to his riches in glory by Christ Jesus.</p>\r\n</blockquote>\r\n<h2>3. God's Need for Man</h2>\r\n<p>Why would an eternal God need anybody?</p>\r\n<blockquote>\r\n<p>Matthew 5:16 Let your light so shine before men, that they may see your good works, and <strong>glorify your Father</strong> which is in heaven.</p>\r\n</blockquote>\r\n<p>God's need is born not out of a shortcoming in the Divine God, but out of His LOVE for His creation. </p>\r\n<h3>God willingly yokes up with the repentant.</h3>\r\n<blockquote>\r\n<p>Mt 11:29 Take my yoke upon you, and learn of me; for I am meek and lowly in heart: and ye shall find rest unto your souls.</p>\r\n</blockquote>\r\n<h3>He Has Born Our Need</h3>\r\n<blockquote>\r\n<p>John 4:4 And he must needs go through Samaria.</p>\r\n</blockquote>\r\n<h3>The Donkey</h3>\r\n<blockquote>\r\n<p>Matthew 21:3 And if any man say ought unto you, ye shall say, The Lord hath need of them; and straightway he will send them.</p>\r\n</blockquote>\r\n<h3>Daily Prepare to be Useful to God</h3>\r\n<blockquote>\r\n<p>Isa 43:10 <strong>Ye are my witnesses</strong>, saith the LORD, and my servant whom I have chosen: that ye may know and believe me, and understand that I am he: before me there was no God formed, neither shall there be after me.</p>\r\n</blockquote>\r\n<p>illustrations in Scripture:</p>\r\n<ol>\r\n<li>Clay in the Potters Hand</li>\r\n</ol>\r\n<blockquote>\r\n<p>Isa 64:8 But now, O LORD, thou art our father; we are the clay, and thou our potter; and we all are the work of thy hand.</p>\r\n</blockquote>\r\n<ol>\r\n<li>A Trumpet to Sound Forth a Certain Sound</li>\r\n</ol>\r\n<blockquote>\r\n<p>1Co 14:8,9 For if the trumpet give an uncertain sound, who shall prepare himself to the battle? 9 So likewise ye, except ye utter by the tongue words easy to be understood, how shall it be known what is spoken? for ye shall speak into the air.</p>\r\n</blockquote>\r\n<ol>\r\n<li>A Nail in a Sure Place</li>\r\n</ol>\r\n<blockquote>\r\n<p>Isa 22:23 And I will fasten him as a nail in a sure place; and he shall be for a glorious throne to his father's house.</p>\r\n</blockquote>\r\n<ol>\r\n<li>A Light in a Dark Place</li>\r\n</ol>\r\n<blockquote>\r\n<p>Mt 5:14 Ye are the light of the world. A city that is set on an hill cannot be hid.</p>\r\n</blockquote></article></body></html>"},"type":"READ_HTML_FILE"}