{"id":1073,"courseId":"stephen-reynolds-jr-sermon-outlines","tasks":[],"title":"000 PRIDE AND PERSEVERANCE","fileType":"md","value":{"path":"C:\\sites\\github\\courses\\stephen-reynolds-jr-sermon-outlines/000_pride and perseverance.md","raw":"# Nimrod & Jesus (Stubbornness and Persistence)\r\n\r\n> Mt 24:13 But he that shall endure unto the end, the same shall be saved.\r\n\r\n## Stubbornness Leads Away from God (Nimrod)\r\nGenesis 10:8-11:9; \r\n\r\nNimrod was his own man but his life was **broke**.\r\n\r\n### The name Nimrod means firm\r\n\r\nStubborn and rebellious against divine authority&#44; Nimrod was a common specimen of his generation. The rebellion of this age culminated with the Tower of Babel.\r\n\r\n### He claimed to be a &quot;mighty one in the earth.&quot; I Chr. 1:10 \r\n\r\nBabel was the beginning of his kingdom&#44; which he gradually enlarged (10:8-10). The &quot;land of Nimrod&quot;(Micah 5:6) is a designation of Assyria or of Shinar.\r\n\r\n### The Cult that Formed around the legendary Nimrod. \r\n\r\nNimrod was married to his own mother&#44; Semiramis&#44; the Queen of Babylon. Satan used them to create a cultso powerful that it spread around the world and multitudes look to Semiramis astheir goddess mother. Nimrod was known by many names including &quot;Moloch.&quot; Babies were sacrificed in his honor. (Lev. 18:21; Acts 7:43) At this time&#44; we find thebeginning of confessions&#44; celibacy for priests&#44; &amp; motherinfantworship as we see in Roman Catholicism. \r\n\r\nWhen Nimrod was put to death&#44; the people wept. Semiramis moved quickly and took advantage of the situation. Supposedly a virgin&#44; Semiramis gave birth to another child and claimed that Nimrod had been reincarnated. The child was called Tammuz. He became the sun god&#44; Baal.(Halos)\r\n\r\nSemiramis became a goddess with many names. Her names include:Baalti (the Madonna)&#44; the GreatGoddess Mother&#44; Queen of Heaven&#44; The Mediatrix&#44; The Mother of Mankind&#44; Astarte&#44;etc. As time went on&#44; monuments of the goddess mother and her child appeared inmany nations. When the people of Babylon were scattered to various parts of theearth&#44; they took with them the worship of the divine mother and child. uTheearth was in darkness.\r\n\r\nAround 300 A.D.&#44; when Roman Catholicism came into existence&#44; Constantine knew if he would adopt the worship of the goddess mother into their religious system then countless pagans would convert to Roman Catholicism. (Catholic means universal.) </span></p>\r\n\r\nMother-Infant Worship (Rebellion Against God's Order)\r\n\r\n## From a Broken Life to a Life of Brokenness\r\n\r\nNever was there a greater leader than Jesus: had his priorities right, had vision, was selfless to his own hurt, and took the blame when it went wrong and shared the credit when it went right. Yet amidst alll his stregths we see prominent his brokenness toward the Father.\r\n\r\n### Disciples wanted to site-see. Jesus had something else on his mind--the will of God the Father.\r\n\r\n> Mt 24:13 But he that shall endure unto the end, the same shall be saved.\r\n\r\n### perseverance: persistance\r\n\r\n> Pr 3:6 In all thy ways acknowledge him, and he shall direct thy paths.\r\n\r\nPersist by Getting rooted\r\n\r\n> Mr 4:17 And have no root in themselves, and so endure but for a time: afterward, when affliction or persecution ariseth for the word's sake, immediately they are offended. \r\n\r\n### Persevering Through Hatred\r\n\r\n> Mr 13:13 And ye shall be hated of all men for my name's sake: but he that shall endure unto the end, the same shall be saved.\r\n\r\n> 2Ti 2:3 Thou therefore endure hardness, as a good soldier of Jesus Christ.\r\n\r\n### Others depend on You\r\n\r\n> 2Ti 2:10 Therefore I endure all things for the elect's sakes, that they may also obtain the salvation which is in Christ Jesus with eternal glory.\r\n\r\n### Persistent brokenness toward God.\r\n\r\n> Isa 57:15 For thus saith the high and lofty One that inhabiteth eternity, whose name is Holy; I dwell in the high and holy place, with him also that is of a contrite and humble spirit, to revive the spirit of the humble, and to revive the heart of the contrite ones."},"type":"READ_MD_FILE"}