{"id":1078,"courseId":"stephen-reynolds-jr-sermon-outlines","tasks":[],"title":"000 THE DEMANDS AND DISTINCTION OF DISCIPLEHSIP","fileType":"md","value":{"path":"C:\\sites\\github\\courses\\stephen-reynolds-jr-sermon-outlines/000_the-demands-and-distinction-of-disciplehsip.md","raw":"# The Demands and Distinction of Discipleship\r\n\r\nTEXT: Matthew 16:24-27\r\n\r\n>(Matthew 16:24-27) Then said Jesus unto his disciples, If any man will come after me, let him deny himself, and take up his cross, and follow me. For whosoever will save his life shall lose it: and whosoever will lose his life for my sake shall find it. For what is a man profited, if he shall gain the whole world, and lose his own soul? or what shall a man give in exchange for his soul? For the Son of man shall come in the glory of his Father with his angels; and then he shall reward every man according to his works.\r\n\r\n----------\r\n\r\n## INTRODUCTION\r\n\r\nThere are no shortcuts to God's favor. God's will must be done God's way. Any modification we make to modernize, improve or otherwise change the pattern will result in disaster.\r\n\r\nOur neighborhoods are full of confused ex-Believers. They were mislead and even in the church pews are many being mislead to believe that the \"adjustments\" we make to our faith to fit society won't hurt us.\r\n\r\nWe tell the sinner to get him in the door, all he has to do is BELIEVE, so when they are introduced with the Gospel of the cross it is foreign to them--disillusioned as to what the Cross means to the carnal man. We are called to be His disciples. This is a difficult but an honorable distinction.\r\n\r\n----------\r\n\r\n## 1. The Demands of Discipleship\r\n\r\nGod has a way of making us USEFUL!\r\n-Joseph in Prison\r\n-Moses in the Desert\r\n-Elisha Waiting on Elijah\r\n-Timothy and Titus Under Paul\r\n\r\n### Imitation \r\n\r\n>(John 13:15) For I have given you an example, that ye should do as I have done to you.\r\n\r\n### Obedience\r\n\r\n>(Mt 7:21) Not every one that saith unto me, Lord, Lord, shall enter into the kingdom of heaven; but he that doeth the will of my Father which is in heaven.\r\n\r\n### Self-Denial (The Cross)\r\n\r\n- Nothing between my soul and my Savior.\r\n\r\nOur self-indulgence shows we lack genuine interest in God and His Word. (Lovers of pleasure more than lovers of God.)\r\n----------\r\n----------\r\n## 2. The Distinction of Discipleship\r\n\r\n### Having a Teacher is a Covering\r\n\r\n> (1 Thessalonians 5:12) And we beseech you, brethren, to know them which labour among you, and are over you in the Lord, and admonish you;\r\n\r\n- The Disciple does not choose his Teacher.\r\n\r\n> (Hebrews 13:17) Obey them that have the rule over you, and submit yourselves: for they watch for your souls, as they that must give account, that they may do it with joy, and not with grief: for that is unprofitable for you\r\n\r\n- Willingness to be Instructed is a Virtue. (Never asking for directions is a weakness.)\r\n\r\n### Allow God to teach us His Way.\r\n\r\nMeans a willingness to receive and respond to rebuke.\r\n\r\n> (2 Timothy 4:2) Preach the word; be instant in season, out of season; reprove, rebuke, exhort with all longsuffering and doctrine.\r\n\r\nNever loose the ability to receive and make corrections.\r\n\r\nILLUSTRATION: We always called him tv.\r\n\r\n### Having God's Favor (It makes a difference who you follow.)\r\n\r\n> (John 9:24-30)&hellip; 28 Then they reviled him, and said, Thou art his disciple; but we are Moses' disciples. &hellip; 30 The man answered and said unto them, Why herein is a marvellous thing, that ye know not from whence he is, and yet he hath opened mine eyes.\r\n"},"type":"READ_MD_FILE"}