{"id":1080,"courseId":"stephen-reynolds-jr-sermon-outlines","tasks":[],"title":"000 THE GOSPEL AND THE EVANGELIST","fileType":"html","value":{"path":"C:\\sites\\github\\courses\\stephen-reynolds-jr-sermon-outlines/000_the-gospel-and-the-evangelist.html","raw":"<!DOCTYPE html>\r\n<!-- saved from url=(0071)file:///C:/Users/Deliverance/AppData/Local/Temp/MarkdownPadPreview.html -->\r\n<html><head>\r\n<meta http-equiv=\"Content-Type\" content=\"text/html; charset=UTF-8\">\r\n<title>The Gospel and the Evangelist</title>\r\n<!--20160516 -->\r\n<!--<base href=\"file:\\\\\\D:\\www\\courses\\sermon-outlines-by-stephen-reynolds-jr\\\">--><base href=\".\">\r\n</head>\r\n<body>\r\n<h1>The Gospel &amp; the Evangelist</h1>\r\n<blockquote>\r\n<p>Mark 1:4 John did baptize in the wilderness, and preach the baptism of repentance for the remission of sins.</p>\r\n<p>Mark 1:14 Now after that John was put in prison, Jesus came into Galilee, preaching the gospel of the kingdom of God, 15 And saying, The time is fulfilled, and the kingdom of God is at hand: repent ye, and believe the gospel.</p>\r\n<p>Mark 16:15 And he said unto them, Go ye into all the world, and preach the gospel to every creature.</p>\r\n</blockquote>\r\n<hr>\r\n<h2>Word Study</h2>\r\n<h3>English Language: \"Evangelist\" &amp; \"Gospel\" MIRIAM WEBSTER:</h3>\r\n<p>\"The Gospel\"/ \"The Evangel\"</p>\r\n<ul>\r\n<li>EVANGELIST - used first 13th century (Acts 21:8; Eph. 4:11; 2 Tim. 4:5)</li>\r\n<li>\r\n<p>EVANGEL - used first in 1614 (after the KJV translated).</p>\r\n</li>\r\n<li>\r\n<p>Gospel - used first before 12th century</p>\r\n</li>\r\n<li>Gospelist - \"does not exist\"</li>\r\n</ul>\r\n<p>Middle English evangile, from Anglo-French evangeile, from Late Latin evangelium, from Greek euangelion good news, gospel, from euangelos <em>bringing good news</em>, from eu- + angelos messenger</p>\r\n<h3>Greek Language: \"Euaggelion [yoo-ang-ghel'-ee-on]\" &amp; \"Euaggelistes [yoo-ang-ghel-is-tace]\"</h3>\r\n<p>BOTH FROM THE SAME ROOTS: 2095 &amp; 32\r\n- 2095. eu good, well.\r\n- 32. aggelos, from aggello (to bring tidings); a messenger; especially an \"angel\"; by implication, a pastor:--angel, messenger</p>\r\n<blockquote>\r\n<p>a primary verb; properly, to lead; by implication, to bring, drive, (reflexively) go, (specially) pass (time), or (figuratively) induce:--be, bring (forth), carry, (let) go, keep, lead away, be open</p>\r\n</blockquote>\r\n<hr>\r\n<h2>How Can We Describe the Function of the Evangelist</h2>\r\n<p>((OFFICE &amp; FUNCTION: Mother, Motherly -- Prophet, Prophesy -- Leader, Lead))</p>\r\n<ul>\r\n<li>to lead; to bring, drive, induce:--be, bring (forth), carry, (let) go, keep, lead away, be open.</li>\r\n</ul>\r\n<h3>The Gospel and its Effects is Illustrated in the life of the Believer</h3>\r\n<blockquote>\r\n<p>Mt 26:13 Verily I say unto you, Wheresoever this gospel shall be preached in the whole world, there shall also this, that this woman hath done, be told for a memorial of her.</p>\r\n</blockquote>\r\n<p>The Gospel is not that this woman washed the feet of Jesus, but her story will be told (and is told!) as it illustrates (manifests) the meaning and influence of the Gospel.</p>\r\n<ul>\r\n<li>What has this woman done?</li>\r\n<li>What a waste?</li>\r\n<li>Why? This doesn't make sense! Its not practical!</li>\r\n</ul>\r\n<p>We make clear distinction between the Gospel and the life of the Evangelist. The sum of the story of this woman's life is not \"the Gospel\", but because the Gospel has moved her, everywhere the gospel will be told, so also will her story.</p>\r\n<blockquote>\r\n<p>HOUSE CAUGHT ON FIRE == HOME BIBLE STUDY THAT NIGHT &amp; MEAL == \"That night we experienced the Gospel\" As the Body of Christ, they brought His presence and His family into our home when we needed His presence and His people the most.</p>\r\n</blockquote>\r\n<p>BECAUSE &hellip;</p>\r\n<h3>The Gospel is first to be Believed (Experienced)</h3>\r\n<blockquote>\r\n<p>Psalm 34:8 O taste and see that the LORD is good: blessed is the man that trusteth in him.\r\n2 Timothy 2:6 The husbandman that laboureth must be first partaker of the fruits. </p>\r\n</blockquote>\r\n<h3>The Gospel is first to be Believed then Shared</h3>\r\n<blockquote>\r\n<p>Charles Spurgeon (mid-1800&apos;s) was known for his bold evangelistic style of preaching. In fact, he is credited (along with George Whitfield, Charles Finney, and others) with the &quot;altar call&quot; or &quot;invitation&quot; moment that became popular in many churches. On one occasion a woman challenged him, saying she didn&apos;t like his way of evangelism. As he talked to her, he asked <strong>how she shared with Christ others</strong> and over the course of the conversation she had to admit that <strong>she really didn&apos;t</strong>. To that, Spurgeon answered, <strong>&quot;Well, I like my way better than yours.&quot;</strong></p>\r\n</blockquote>\r\n<p>How is the Believer to Share?</p>\r\n<h4>\"I have responded to a Divine call to action and you can as well.\"</h4>\r\n<blockquote>\r\n<p>John 3:11 Verily, verily, I say unto thee, We speak that we do know, and testify that we have seen; and ye receive not our witness.</p>\r\n</blockquote>\r\n<ul>\r\n<li>Is it merely an Academic debate for you that Jesus died to save sinners? </li>\r\n<li>Or, is the Gospel a <strong>CALL to ACTION</strong> to you?</li>\r\n</ul>\r\n<h4>Speak the Truth In Love</h4>\r\n<blockquote>\r\n<p>Ephesians 4:15 But speaking the truth in love, may grow up into him in all things, which is the head, even Christ: </p>\r\n</blockquote>\r\n<h5>Truth is the Word, Doctrine \"simply what the Bible says\"</h5>\r\n<h5>TRUTH is Alive</h5>\r\n<p>Speak a Vitalized and \"Fossilized\" Theology</p>\r\n<p>NOT A SERMON ??? \"Preaching Not Sermonizing\"</p>\r\n<ul>\r\n<li><strong>SIDE ONE</strong>: Intensely Personal - From my heart - \"Unrehearsed\", \"not calculated\" \"not fancy but useful\" \"not for style but practical\" \"not dry\" \"not dull\" </li>\r\n<li><strong>CONCLUSION</strong>: \"I believe every word I say and hope that everyone who hears will be able to receive it as a personal message for them.\"</li>\r\n<li><strong>FLIP SIDE</strong>: Diligent Preparation, On purpose, Thoughtful, Prayerful Prepared with the congregation in mind </li>\r\n<li><strong>CONCLUSION</strong>: \"I believe every word I say and I hope that everyone who hears will be able to receive it as a personal message for them.\"</li>\r\n</ul>\r\n<p>\"The greatest enemy of preaching is the sermon. Of study, mediation and preparation of the minister there can never be too much, but the actual turning of phrases and rounding sentences--the less, the better.--\"</p>\r\n<!-- from: https://books.google.com/books?id=4Yc5AQAAMAAJ&pg=PA120&lpg=PA120&dq=is+sermonizing+bad&source=bl&ots=tHIyjg-9AR&sig=CjAHNwnKZNQtp8ji-21UoUsvX8Q&hl=en&sa=X&ved=0ahUKEwjE8oG0hdzMAhVDdj4KHf8CDc4Q6AEIQjAJ#v=onepage&q=is%20sermonizing%20bad&f=false-->\r\n<h5>LOVE</h5>\r\n<p>AT LEAST 6 <em>STYLES</em> OF EVANGELIZING:\r\n1. Direct Style Peter- Acts 2\r\n2. Intellectual Style Paul- Acts 17\r\n3. Testimonial Style Blind man- John 9\r\n4. Interpersonal Style Matthew - Luke 5:29 (Generally a warm personality, conversational, friendship-oriented)\r\n5. Invitational Style Woman at the Well- John 4 \"Come and See\"\r\n6. Serving Style Dorcas- Acts 9:36 </p>\r\n<ul>\r\n<li>Speak Cordially, Warmth, Respect</li>\r\n</ul>\r\n<p>Who would not at least entertain? A VITAL MESSAGE, CORDIALLY DELIVERED--\"WARM &amp; FRIENDLY\"</p>\r\n<ul>\r\n<li>God's Love</li>\r\n</ul>\r\n<p>Ephesians 4:15 -- AGAPE -- Same as John 15:9 \"As the Father hath loved me, so have I loved you: continue ye in my love.\"</p>\r\n<hr>\r\n<h2>How Can we Describe the Gospel?</h2>\r\n<h3>When Preached, Often Accompanied by Signs</h3>\r\n<blockquote>\r\n<p>Mt 4:23 And Jesus went about all Galilee, teaching in their synagogues, and preaching the gospel of the kingdom, and healing all manner of sickness and all manner of disease among the people.</p>\r\n<p>Mt 9:35 And Jesus went about all the cities and villages, teaching in their synagogues, and preaching the gospel of the kingdom, and healing every sickness and every disease among the people.</p>\r\n<p>Mt 11:5 The blind receive their sight, and the lame walk, the lepers are cleansed, and the deaf hear, the dead are raised up, and the poor have the gospel preached to them.</p>\r\n</blockquote>\r\n<h3>The Preaching of the Gospel is Also a Sign Itself</h3>\r\n<blockquote>\r\n<p>Mt 24:14 And this gospel of the kingdom shall be preached in all the world for a witness unto all nations; and then shall the end come.</p>\r\n</blockquote>\r\n<h3>A Message</h3>\r\n<p>The Gospel Christ preached was accompanied by miracles and healings, but the miracles and healings were not themselves the EVANGEL/GOSPEL/GOOD MESSAGE/GOOD NEWS. The WORD -- THE LIVING WORD!</p>\r\n<p>What is the Believer sharing? </p>\r\n<ul>\r\n<li>\"Technology Evangelist\"</li>\r\n<li>\"Apple Evangelist\"</li>\r\n<li>\"human resources evangelist\"</li>\r\n<li>\"I'm an Evangelist for animal rights\"</li>\r\n</ul>\r\n<p>Before we can even get our \"style\" right. Whose message am I spreading?</p>\r\n<h3>\"Of the Kingdom\"</h3>\r\n<ul>\r\n<li>Not just any \"good news\" is \"gospel\" in the Christian and Biblical sense. In the Biblical sense, the \"Gospel\" relates to the Kingdom of God.</li>\r\n</ul>\r\n<blockquote>\r\n<p>Mark 1:14 Just preached \"gospel of the kingdom of God\"</p>\r\n</blockquote>\r\n<h3>Good and is For All</h3>\r\n<ul>\r\n<li>Is it Really Good for the sinner?</li>\r\n<li>The Good News is not that you are going to hell, but that Christ has secured the way to Heaven for you! Christ is the door!</li>\r\n<li>Knowledge of God's wrath is necessary for an appreciation of the Gospel (Why do I need it?), but sharing the knowledge of God's anger against sin and the sinner is not \"GOOD NEWS\".</li>\r\n<li>To the Homosexual who believes \"This who I am. I cannot help and do not apologize for who I am.\" How would you receive \"Homosexuality is a sin!\" The Remedy must always accompany the cure. THIS IS GOOD.</li>\r\n</ul>\r\n<h3>It has an Intended Response: \"Repent ye, and believe\"</h3>\r\n<p>God's desired response to the Gospel is that all men would \"repent\" and \"believe\".</p>\r\n<blockquote>\r\n<p>Matthew 3:2 &hellip;And [John the Baptist] saying, Repent ye: for the kingdom of heaven is at hand.</p>\r\n</blockquote>\r\n<p>Now after that John was put in prison&hellip;</p>\r\n<blockquote>\r\n<p>Mark 1:15 Christ presented the \"gospel of the kingdom\" as \"&hellip; The time is fulfilled, and the kingdom of God is at hand: repent ye, and believe the gospel.\"</p>\r\n</blockquote>\r\n<h3>Timeless, Everlasting</h3>\r\n<blockquote>\r\n<p>Re 13:8 And all that dwell upon the earth shall worship him, whose names are not written in the book of life of the Lamb slain from the foundation of the world.</p>\r\n<p>Lu 24:44 And he said unto them, These are the words which I spake unto you, while I was yet with you, that all things must be fulfilled, which were written in the law of Moses, and in the prophets, and in the psalms, concerning me.</p>\r\n<p>Mark 1:4 John did baptize in the wilderness, and preach the baptism of repentance for the remission of sins.</p>\r\n<p>Mark 1:14 Now after that John was put in prison, Jesus came into Galilee, preaching the gospel of the kingdom of God, 15 And saying, The time is fulfilled, and the kingdom of God is at hand: repent ye, and believe the gospel.</p>\r\n<p>Mark 16:15 And he said unto them, Go ye into all the world, and preach the gospel to every creature.</p>\r\n</blockquote>\r\n\r\n\r\n\r\n<!-- This document was created with MarkdownPad, the Markdown editor for Windows (http://markdownpad.com) -->\r\n</body></html>\r\n"},"type":"READ_HTML_FILE"}