{"id":1081,"courseId":"stephen-reynolds-jr-sermon-outlines","tasks":[],"title":"000 THE KINGS RECORD 20140103","fileType":"md","value":{"path":"C:\\sites\\github\\courses\\stephen-reynolds-jr-sermon-outlines/000_the-kings-record-20140103.md","raw":"# The King's Record\r\n\r\n## TEXT: Ezra 5:17\r\n\r\n> Ezr 5:17 Now therefore, if it seem good to the king, **let there be search made in the king's treasure house**, which is there at Babylon, whether it be so, that a decree was made of Cyrus the king to build this house of God at Jerusalem, and let the king send his pleasure to us concerning this matter.\r\n\r\n## INTRODUCTION: A LETTER TO THE KING \r\n\r\nAfter 70 Years of Captivity in Babylon, A group of the Jews were allowed to Return back to their Home Land. Ezra is a scribe leading this group to Jerusalem and in rebuilding the temple. While they are working the neighboring nations constantly harass the Jews. Eventually they send a letter to King Darius.\r\n\r\n## I. God's Word is with Authority (God's Word is His Will)\r\n\r\nNO MATTER WHAT MEN MAY SAY:\r\n\r\n> 2 Timothy 2:19 Nevertheless the foundation of God standeth sure,&hellip;\r\n\r\n> Matthew 24:35 Heaven and earth shall pass away, but my words shall not pass away.\r\n\r\n## II. Your Commitment to God's Word Will Be Tested\r\n\r\n### A. The Devil Will Challenge Your Commitment to God's Word\r\n\r\n#### He is a master at inserting question marks where God has placed a period. \r\n\r\n- **Is that What He said?** -- Hath God said? (to Eve in Genesis 3:1). Are you sure you heard him right?\r\n- **Is that What He Meant?** -- Israel offered their sacrifices in the temple and then went to the groves and sacrificed to false gods.\r\n- **Its been awhile**, surely He has changed his mind? -- In Numbers, the command was given and 435 years later Uzzah touched the ark and died.\r\n\r\n### B. It's Important to Get Your Facts Straight\r\n\r\nThey repeated exactly what the Jews told them. You need a WORD from God and KNOW what He said. (Bro. Correy's Testimony)\r\n\r\nThe Devil won't be able to tell you any different. Ezra didn't have to check the Record, He told his enemies to check for themselves.\r\n\r\n### C. Doing Something For God Has ALWAYS Been a Battle., we must get distracted by the NOISE of the ENEMY.\r\n\r\n> Ezra 5:5 But the eye of their God was upon the elders of the Jews, that they could not cause them to cease, till the matter came to Darius: and then they returned answer by letter concerning this matter.\r\n\r\nCome down from that Wall Nehemiah and Discuss this with us!\r\n\r\n> Nehemiah 6:3 And I sent messengers unto them, saying, I am doing a great work, so that I cannot come down: why should the work cease, whilst I leave it, and come down to you?\r\n\r\n## III. The King's Record Defends the Innocent\r\n\r\nGod Keeps Good Books\r\n\r\nThe Only Record that Counts is God's\r\n\r\n> Ezra 6:1-3a, 7 Then Darius the king made a decree, and search was made in the house of the rolls, where the treasures were laid up in Babylon. 2 And there was found at Achmetha, in the palace that is in the province of the Medes, a roll, and therein was a record thus written: 3 In the first year of Cyrus the king the same Cyrus the king made a decree concerning the house of God at Jerusalem, **Let the house be builded**,..\r\n\r\nGod Always Has the Last Word\r\n\r\nDARIUS' DECREE\r\n> Ezra 6:7 Let the work of this house of God alone;&hellip;\r\n"},"type":"READ_MD_FILE"}