{"id":1082,"courseId":"stephen-reynolds-jr-sermon-outlines","tasks":[],"title":"000 THE LIGHT OF LIFE","fileType":"md","value":{"path":"C:\\sites\\github\\courses\\stephen-reynolds-jr-sermon-outlines/000_the-light-of-life.md","raw":"<!-- 20150510P -->\r\n\r\n# Light that Produces Life\r\n\r\n> John 8:12 &mdash;Then spake Jesus again unto them, saying, I am the light of the world: he that followeth me shall not walk in darkness, but shall have the **light of life**.\r\n\r\n## Introduction\r\n\r\n**THEME**: There is all kinds of news that we get some good, some bad, some not particularly good or bad so that taking it or leaving has no impact. But especially that GOOD or BAD kind of news impacts us in powerful ways.\r\n\r\n### Good News\r\n- When the Gospel was Made Personal to Me (included)\r\n- When Dad and Mom handed me keys to my first car. ( I didn't know what to say, didn't say much, overwhelmed)\r\n- When My Wife said yes (I was on cloud nine)\r\n\r\n### Bad News\r\n\r\n- That My Beagle, wilbur, wasn't going to make it. (alone)\r\n- 9/11 (angry/scared)\r\n- My Grandmother had passed away (empty)\r\n\r\nOur lives can often be dramatically changed with the arrival of a single piece of information. **The knowledge that Christ imparts results in LIFE for those Who FOLLOW Him**.\r\n\r\n## **WHAT IS IT?**: The Meaning of \"Light of Life\" Jesus Promised\r\n\r\n### Light\r\n\r\n**DICTIONARY**: to shine or make manifest, especially by rays; luminous:--fire, light. \r\n\r\nLight reveals or makes known.\r\n\r\nThroughout human history LIGHT (and its antithesis DARKNESS) has been used symbolically:\r\n- good and evil\r\n- knowledge and ignorance\r\n- love and hate\r\n- happiness and despair.\r\n\r\n> **Daniel 2:22** He revealeth the deep and secret things: he knoweth what is in the darkness, and the light dwelleth with him.\r\n\r\n### Life\r\n\r\n**DICTIONARY**: *zoe* life; the very breath; even soul\r\n\r\nAt least 38 verses in John, where he mentions \"LIFE\"\r\n\r\n### Together \"Light of Life\" == The Context\r\n\r\nThis woman was taken in adultery, Jesus silences all the noise with LIGHT of TRUTH.\r\n\r\n------------------------------------------------\r\n**Light that Produces Life**. Christ's actions and words that day meant LIFE for that woman taken in adultery and means LIFE FOR US TODAY.\r\n------------------------------------------------\r\n\r\nThis is the intent of the GOSPEL: \r\n\r\n> **John 10:10** The thief cometh not, but for to steal, and to kill, and to destroy: I am come that they might have life, and that they might have it more abundantly.\r\n\r\n## **WHERE DOES IT COME FROM?**: The Source of Light and Life is God\r\n\r\n> **Psalm 36:9** For with thee is the fountain of life: in thy light shall we see light.\r\n\r\n> **ILLUSTRATION:** Romeo and Juliet (LOVE, the very source of life) In the famous balcony scene of Act 2, Romeo first sees Juliet as the sun itself, as the ultimate source of life: &quot;But soft, what light through yonder window breaks? / It is the east and **Juliet is the sun**!\" \r\n\r\nNo Man Can illuminate his own soul; all understanding must come from above.\r\n\r\n- **As the Sun gives light to the moon**, The moon has no light of its own. It reflects the sun's light. At any time, half of the Earth and half of the moon are lit by the sun. The other half is in shadow!\r\n- Without the sun, the earth would be in complete darkness. (On Earth we get about 1,200 watts per square meter)\r\n \r\n> **John 1:1-4** In the beginning was the Word, and the Word was with God, and the Word was God. 2 The same was in the beginning with God. 3 All things were made by him; and without him was not any thing made that was made. 4 In him was life; and the life was the light of men.\r\n\r\nBy the LOGOS/Jesus the world was created.\r\n\r\n\"Jesus is the fountain from which an intellectual light and spiritual understanding proceed: **without me all is darkness, misery, and death**.\r\n\r\n> It is impossible to account for the creation of the universe without the agency of a Supreme Being. It is impossible to govern the universe without the aid of a Supreme Being. -- George Washington\r\n\r\n**It is through HIS LIGHT we SEE LIGHT!**\r\n\r\nHis light is PERFECT:\r\n\r\n> 1Jo 1:5 This then is the message which we have heard of him, and declare unto you, that God is light, and in him is **no darkness at all**.\r\n\r\n## **HOW DO I GET IT**?: Having the Light of Life\r\n\r\n&hellip; He that **FOLLOWETH** Me shall &hellip;\r\n\r\n### **Stop** Following the OLD and Follow Me\r\n\r\nThe light that Christ brings greatly contrasts the darkness. And greatly contrasts the LIGHT OR UNDERSTANDING OF MEN.\r\n\r\nHis WILL means life to those who FOLLOW, but often times we are foolish in supplementing the light.\r\n\r\n> The Greek philosopher Diogenes used to stroll about in full daylight carrying a lamp; If asked about it, his response was he was looking for a human being.\r\n\r\n### **Give Proper Place** the Word of God which is the Revelation of His Will\r\n\r\nOn the first day of the feast tabernacles, there was a celebratory lighting of lamps, but since the feast of tabernacles has now been concluded the day before, Jesus might be alluding to the Jews instituting an additional day to the feast called \"**The feast of joy for the law**\". \r\n\r\nIn observance of this celebration to the Lord they would take all the sacred books out of the chests where they were kept and place a lighted candle in their place.\r\n\r\n### Walk with Master\r\n\r\n- What Would Jesus Do? Charles Sheldon in His book \"In His Steps\"\r\n\r\nMost problems and confusion in life is the result of **partial application of the will of God**.\r\n\r\nJohn Wesley preached a sanctification and holiness where the grace of God worked so that the believer could be motivated entirely by a \"perfect love\" and not by sin or any ulterior motive.\r\n\r\n"},"type":"READ_MD_FILE"}