{"id":1084,"courseId":"stephen-reynolds-jr-sermon-outlines","tasks":[],"title":"000 THIS DAY","fileType":"md","value":{"path":"C:\\sites\\github\\courses\\stephen-reynolds-jr-sermon-outlines/000_this-day.md","raw":"# What Prayer Says\r\n\r\n> Matthew 6:9-13\r\n\r\n## Introduction - The Closet\r\n\r\n### vs. 5 Don't Be Like the Hypocrites\r\n\r\n### vs.6 Pray in Secret to Your Father\r\n\r\n### vs.7 Vain Repetition (heard for their much speaking)\r\n\r\n### vs. 8 Your Father Knows what we need BEFORE we ask\r\n\r\nIf it isn't to inform God what I need, why do I pray?\r\n\r\n- Daniel made his petition known to God 3 times a day (Daniel 6:13)\r\n- God told Ahaz to ask him a sign, Ahaz refused to ASK, the prophet responded that not asking is to refuse, God gave the sign anyways vs. 14 (Isaiah 7:11)\r\n- We are not bargaining with God or demanding in prayer, we are testifying\r\n \r\n<!---\r\n/////////////////////////////////////////////////////////////\r\n-->\r\n## Prayer is Submission to the Master - SUBMISSION & THE PATTERN\r\n\r\n>Matthew 6:9 After this manner therefore pray ye: \r\n\r\nMany live their lives with no confession of their NEED from God for guidance. In prayer and especially praying according to the PATTERN given is a testimony of submission.\r\n\r\n<!---\r\n/////////////////////////////////////////////////////////////\r\n-->\r\n## God is Our Father and His name is to be Revered - CONFIDENCE & REVERENCE\r\n> Our Father which art in heaven, Hallowed be thy name.\r\n\r\nHow do we make our approach to God? As confidently and yet more reverently than we would approach our earthly father. \r\n\r\nHow I USE His name is a testimony of what He means to me. Some may carelessly address him, \"Dear Dad..\". But, He is more than a DAD to me!\r\n\r\n\"HIS NAME\" - Jehovah (self-existent), Jehovah-M&apos;Kaddesh (Sanctifier), Jehovah-jireh (Provider), Jehovah (Rophe), Jesus (Jehovah Saves).\r\n\r\n<!---\r\n/////////////////////////////////////////////////////////////\r\n-->\r\n## God's Will is the Best Way - BREAK THROUGH THE RESISTANCE (IN ALL HEARTS)\r\n\r\n>10 Thy kingdom come. Thy will be done in earth, as it is in heaven.\r\n\r\nIntercession for the needs (even if they are blinded to it) of others.\r\n\r\n<!---\r\n/////////////////////////////////////////////////////////////\r\n-->\r\n## Gratefulness and Moderation\r\n>11 Give us this day our daily bread.\r\n\r\n>Php 4:5 Let your moderation be known unto all men. The Lord is at hand.\r\n\r\nKnowledge of the nearness of the end and the closeness of the Lord, ought lead us to moderation in our desire for earthly things.\r\n\r\n- 1 more paycheck\r\n- 1 more coat\r\n- 1 more new phone\r\n- 1 more new computer\r\n- 1 more advantage someone else doesn't have\r\n\r\nThere is a profound and powerful truth in this request: *Give us this day our daily bread*.\r\n\r\n<!---\r\n/////////////////////////////////////////////////////////////\r\n-->\r\n## The Debt of Sin and the Need for Forgiveness (God doesn't just forget) - CONFESSION & FORGIVENESS\r\n>12 And forgive us our debts, as we forgive our debtors.\r\n\r\nSomething owed, a due, morally: a fault [1 John 1:9 - if we confess&hellip;]\r\n\r\nvs. 14,15 God wont' forgive and unforgiving person\r\n\r\n<!---\r\n/////////////////////////////////////////////////////////////\r\n-->\r\n## The Lord is Our Defense - RELIANCE & LOYALTY\r\n>13 And lead us not into temptation, but deliver us from evil: \r\n\r\nIt is not a well planned life, it is not a well-calculation of the risks and our best judgment. It is the all powerful arm of God on which our success rests.\r\n\r\nI'M YOURS LORD!!!\r\n\r\n<!---\r\n/////////////////////////////////////////////////////////////\r\n-->\r\n## Glorify Yourself in My Need - SACRIFICE & COMMITMENT\r\n> For thine is the kingdom, and the power, and the glory, for ever. Amen.\r\n\r\nMatthew 26:42 Not my will, but your will be done [the cross]\r\n\r\n>ILLUSTRATION: During his reign, King Frederick William III of Prussia found himself in trouble. Wars had been costly, and in trying to build the nation, he was seriously short of finances. He couldn't disappoint his people, and to capitulate to the enemy was unthinkable. After careful reflection, he decided to ask the women of Prussia to bring their jewelry of gold and silver to be melted down for their country. For each ornament received, he determined to exchange a decoration of bronze or iron as a symbol of his gratitude. Each decoration would be inscribed, \"I gave gold for iron, 18l3.\" The response was overwhelming. Even more important, these women prized their gifts from the king more highly than their former jewelry. The reason, of course, is clear. The decorations were proof that they had sacrificed for their king. Indeed, it became unfashionable to wear jewelry, and thus was established the Order of the Iron Cross. Members wore no ornaments except a cross of iron for all to see. When Christians come to their King, they too exchange the flourishes of their former life for a cross.\r\n\r\n## Conclusion\r\nPrayer is a testimony that says, When it comes down to the meat of the matter, my life and its course is in God's hands and I'm so glad it is!"},"type":"READ_MD_FILE"}