{"id":1089,"courseId":"stephen-reynolds-jr-sermon-outlines","tasks":[],"title":"20150607 THE CURSE OF SIN","fileType":"md","value":{"path":"C:\\sites\\github\\courses\\stephen-reynolds-jr-sermon-outlines/20150607_the-curse-of-sin.md","raw":"# God's Standards\r\n\r\nThe Curse of Sin\r\n\r\nShall Be Cut Off\r\n\r\nNo. 6 of 8 visions\r\n\r\n1. \r\n2. \r\n3. \r\n4. \r\n5. \r\n6. 5:1-4 The Flying Roll\r\n7. 5:5-11 The Woman in the Ephah\r\n8. 6:1-8 The Four Chariots\r\n\r\nThis prophecy was to guide Israel after the captivity in Babylon and to a restoration of fellowship with God. Everything had been brought down to a smoldering ember. God's word by His prophets was given to REVIVE the flame.\r\n\r\nZechariah 5:1 Then I turned, and lifted up mine eyes, and looked, and behold a flying roll. 2 And he said unto me, What seest thou? And I answered, I see a flying roll; the length thereof is twenty cubits, and the breadth thereof ten cubits. 3 Then said he unto me, This is the curse that goeth forth over the face of the whole earth: for every one that stealeth shall be cut off as on this side according to it; and every one that sweareth shall be cut off as on that side according to it. 4 I will bring it forth, saith the LORD of hosts, and it shall enter into the house of the thief, and into the house of him that sweareth falsely by my name: and it shall remain in the midst of his house, and shall consume it with the timber thereof and the stones thereof.\r\n\r\nWhat Do You See?\r\n- A Flying Roll\r\n- 20 Cubits (60 ft.) Long and 10 Cubits (30 ft.) wide\r\n- A message in writing (permanent) from God (important)\r\n- Flying over the wholeearth --- universally applicable\r\n\r\nThis is&hellip;\r\n- The Curse that Goeth forth over the face of the WHOLE EARTH\r\n- for every one that stealeth shall be cut off as on this side according to it;\r\n- And every one that sweareth shall be cut off as on that side according to it.\r\n- **I will bring it forth**, saith the LORD of hosts, and it shall enter into the house of the thief, and into the house of him that sweareth falsely by my name: and it shall remain in the midst of his house, and shall consume it with the timber thereof and the stones thereof.\r\n\r\nDimensions like:\r\n- Porch of Solomon's Temple - 1 Kings 6:3\r\n- Holy Place (sanctuary) of the Tabernacle - \r\n- Solomon's Brazen Altar - 2 Chronicles 4:1\r\n\r\nPossession of the temple did not secure safety, but being PURE and OBEDIENT. The whole duty of man.\r\n\r\n **THIEF**: Having gotten caught up in the commerce of Babylon, the developed bad habits that did make them profitable in that economy but in the land of promise things are different. FALSE TO MAN. (Mal.3:8 robbed God)\r\n\r\n**SWEAR FALSELY**: Loose with God's name and his holy witness. FALSE TO GOD. Sacrilegious:\r\n\r\n## Sin In Others\r\n\r\n## Sin In Me "},"type":"READ_MD_FILE"}