{"id":1090,"courseId":"stephen-reynolds-jr-sermon-outlines","tasks":[],"title":"20150804 GODS VOICE","fileType":"md","value":{"path":"C:\\sites\\github\\courses\\stephen-reynolds-jr-sermon-outlines/20150804_gods-voice.md","raw":"<!-- Prepared to be preached at Camp Connexion 2015 -->\r\n# Jesus, I Hear You!\r\n\r\nTEXT: 1 Samuel 3:1-10\r\n\r\nvs. 10 And the LORD came, and stood, and called as at other times, Samuel, Samuel. Then Samuel answered, Speak; for thy servant heareth.\r\n\r\n## Spiritual Sleep (vs. 1-3)\r\n\r\n1 Samuel 3:1 And the child Samuel ministered unto the LORD before Eli. And the word of the LORD was precious in those days; there was no open vision. 2 And it came to pass at that time, when Eli was laid down in his place, and his eyes began to wax dim, that he could not see; 3 And ere the lamp of God went out in the temple of the LORD, where the ark of God was, and Samuel was laid down to sleep;\r\n\r\n> vs. 7 Now Samuel did not yet know the LORD, neither was the word of the LORD yet revealed unto him.\r\n\r\nEli is going blind. There's no open vision from God. A Prophecy from God in those days was scarce. The lamp of God ( a symbol of God's presence and revealing of truth) is about to go out. \r\n\r\nThis gives a sense of urgency, but for Samuel this was normal. It was all he ever new. It was night time, and it was only natural to have been asleep. The light going out was usual as it was light every morning and though they were suppose to burn till morning, it just was common sense that as you neared morning some of the flames might go out ALTHOUGH he did notice there seem to be one that **NEVER WENT OUT**.\r\n\r\nWhat was happening around him: [FLICKER]\r\n* **Inconsistencies**: Eli held a standard for himself, but was loose with his boys\r\n* Eli had many memories of SPIRIT OF GOD, he could tell\r\n\r\nSamuel ministered unto the Lord BUT DIDN'T YET KNOW GOD'S VOICE FOR HIMSELF. Somewhat FAMILIAR with the things of God.\r\n* Played the drums\r\n* Sang the songs\r\n\r\nPay attention to Samuel for something AWESOME is about to happen to him.\r\n\r\n## Spiritual Awakening -- God's Voice\r\n\r\nEli was on his way out, but Samuel is about to be BORN AFRESH!\r\n\r\nHe's not dead, he only sleeps! -- Jesus about lazareth\r\n\r\n1Sa 3:4 That the LORD called Samuel: and he answered, Here am I. 5 And he ran unto Eli, and said, Here am I; for thou calledst me. And he said, I called not; lie down again. And he went and lay down. 6 And the LORD called yet again, Samuel. And Samuel arose and went to Eli, and said, Here am I; for thou didst call me. And he answered, I called not, my son; lie down again. 7 Now Samuel did not yet know the LORD, neither was the word of the LORD yet revealed unto him. 8 And the LORD called Samuel again the third time. And he arose and went to Eli, and said, Here am I; for thou didst call me. And Eli perceived that the LORD had called the child.\r\n\r\nHere is a PROCESS to LEARNING what to do and to recognize God's voice.\r\n\r\n\r\n## Spiritual Response -- Our Response\r\n\r\n1Sa 3:9 Therefore Eli said unto Samuel, Go, lie down: and it shall be, if he call thee, that thou shalt say, Speak, LORD; for thy servant heareth. So Samuel went and lay down in his place. 10 And the LORD came, and stood, and called as at other times, Samuel, Samuel. Then Samuel answered, Speak; for thy servant heareth.\r\n\r\nBe Sensitive and guard that sensitivity to the Spirit of God.\r\n\r\nRespond Immediately, Pray NOW.\r\n\r\n"},"type":"READ_MD_FILE"}