{"id":1092,"courseId":"stephen-reynolds-jr-sermon-outlines","tasks":[],"title":"20160429 THIS TREASURE","fileType":"md","value":{"path":"C:\\sites\\github\\courses\\stephen-reynolds-jr-sermon-outlines/20160429_this-treasure.md","raw":"# This Treasure in Earthen Vessels\r\nTEXT: 2 Corinthians 4:1-7 \r\n\r\n## Introduction - Explaining the TEXT (2 Corinthians 4:1-7)\r\n\r\n### Paul has this AMAZING ministry (sharing the gospel) but it is only due to God's mercy and grace that he does not FAINT -- \"to be bad or weak\".\r\n\r\n> v. 1 Therefore seeing we have this ministry, as we have received mercy, we faint not; v. 2 But have renounced the hidden things of dishonesty, not walking in craftiness, nor handling the word of God deceitfully; but by manifestation of the truth commending ourselves to every man's conscience in the sight of God. \r\n\r\n### A Veiled Gospel: Paul is suggesting that to many the **BEAUTY and GLORY of the gospel** was not seen. They are lost in their sin as the devil has blinded their minds and so how important is it that lives do not veil the BEAUTY of our gospel.\r\n3 But if our gospel be hid, it is hid to them that are lost: 4 In whom the god of this world hath blinded the minds of them which believe not, lest the **light of the GLORIOUS gospel of Christ**, who is the image of God, should shine unto them. \r\n\r\n### The LIGHT and TREASURE is to know Jesus.\r\n5 For we preach not ourselves, but Christ Jesus the Lord; and ourselves your servants for Jesus' sake. 6 For God, who commanded the light to shine out of darkness, hath shined in our hearts, to give the LIGHT of the knowledge of the GLORY of God in the face of **Jesus Christ**. \r\n\r\n#### Some Have not this Treasure: \"They Have Their portion in this life\"\r\n\r\n1. Rich Young Ruler\r\n\r\n> Lu 18:22 Now when Jesus heard these things, he said unto him, Yet lackest thou one thing: sell all that thou hast, and distribute unto the poor, and thou shalt have treasure in heaven: and come, follow me. 23 And when he heard this, he was very sorrowful: for he was very rich.\r\n\r\n2. Lot\r\n&hellip;Set his tent toward Sodom.\r\nDidn't necessarily love Sodom, but he didn't hate it either!\r\n\r\n3. Demas \r\n&hellip;The apostle had confidence in Demas.\r\n\r\n> **Colossians 4:14** Luke, the beloved physician, and Demas, greet you.\r\n> **Philemon 1:24** Marcus, Aristarchus, Demas, Lucas, my fellowlabourers.\r\n<!-- -->\r\n> 2 Timothy 4:10 For Demas hath forsaken me, having loved this present world, and is departed unto Thessalonica;&hellip;\r\n\r\nLIVING: Not necessarily gain, but the threat to life he would find at Rome.\r\n\r\n#### Some have this Treasure: The Victory of Contentment, Satisfied with Jesus\r\n\r\n\"I do not place my portion in earthly treasures, but in beholding God's face\" >>> I shall be satisfied &hellip;with they likeness <<<\r\n\r\n> 2 Corinthians 4:6 The light of the knowledge of the glory of God in the face of Jesus Christ.\r\n\r\n> Philippians 3:7 But what things were gain to me, those I counted loss for Christ.\r\n\r\n### This Treasure we have in Earthen vessels.\r\n7 But we have this treasure in earthen vessels, that the excellency of the power may be of God, and not of us.\r\n\r\n### The Message: \r\n\r\nGod has a purpose in what I \"cannot\". I am called to live to a higher purpose.\r\n\r\n## Function: Storage, Keeping\r\n\r\nLuke 12:21-40 \"The Lifestyle of the Believer---**Living to a Higher Purpose**\"\r\n\r\n#### 1. Investment in the Eternal\r\n#### 2. Life is more than Food\r\n#### 3. Body is more than Raiment\r\n#### 4. Seek First the Kingdom of God\r\n\r\n- never a doubtful mind -- DEPENDING ON GOD - God will supply - Seeking not Creating!\r\n\r\n## Frailties\r\n\r\nIn earthen vessels. This refers to the apostles and ministers of religion, as weak and feeble; as having bodies decaying and dying; as fragile, and liable to various accidents, and as being altogether unworthy to hold a treasure so invaluable; as if valuable diamonds and gold were placed in vessels of earth of coarse composition, easily broken, and liable to decay.\r\n\r\n> 1 We are troubled on every side, yet not distressed; we are perplexed, but not in despair; 9 Persecuted, but not forsaken; cast down, but not destroyed; 2 Always bearing about in the body the dying of the Lord Jesus 3 Death worketh in us us, but life in you\r\n\r\n## Conclusion\r\n\r\n#### Why?\r\n\r\n> &hellip;that the excellency of the power may be of God, and not of us\r\nMy treasure is in heaven and I shall be satisfied to see Jesus."},"type":"READ_MD_FILE"}