{"id":1097,"courseId":"stephen-reynolds-jr-sermon-outlines","tasks":[],"title":"20160807P WHEN TO TAKE A STAND","fileType":"md","value":{"path":"C:\\sites\\github\\courses\\stephen-reynolds-jr-sermon-outlines/20160807P_when-to-take-a-stand.md","raw":"# When to Take a Stand (Controversial Christians)\r\n\r\nTEXT: 1 Samuel 17:17-29-31\r\n\r\n> And David said, What have I now done? Is there not a cause?\r\n\r\n## Introduction\r\n\r\n### Premise (Take Courage and Boldness, firmly held belief)\r\n\r\nMost situations might not be the Believer's fight; these are things you just \"let go\" with no response. But other situations demand a response; we must take a stand and not fall silent.\r\n\r\n> **Battle of the Alamo**, Colonel William Travis, commander of the Alamo defense forces. In the waning days of the Battle, Santa Anna sent a messenger to Travis demanding surrender, or else everyone in the compound would be killed. According to the legend, Travis called the Alamo defenders together, explained that defeat was almost certain, and read the letter of surrender; Travis then (having chosen to die instead of surrender) reportedly pulled his battle sword, used it to draw a line in the ground of the Alamo, and asked for volunteers to cross over the line and join him, understanding their decision would be irreversible. The legend states that all but one of the defenders (including Jim Bowie and Davy Crockett) joined Travis on his side of the line; Moses Rose was the only defender choosing to leave the compound. Travis then responded to Santa Anna's letter with cannon fire, whereupon Santa Anna replied by sounding the bugles to attack!\r\n\r\n### Examples in Scripture\r\n\r\n1. Moses - Before Pharoah \"Let my people Go!\"\r\n2. David - Before Goliath \"Is there not a cause?\"\r\n3. Shammah - (One of David's Mighty Men)\r\n\r\n> 2 Samuel 23:11 And after him was Shammah the son of Agee the Hararite. And the Philistines were gathered together into a troop, where was a piece of ground full of lentiles: and the people fled from the Philistines. 12 But he stood in the midst of the ground, and defended it, and slew the Philistines: and the LORD wrought a great victory.\r\n\r\n## Why I Must Take a Stand\r\n\r\nTaking a Stand, May Appear Out of Line on the Surface and will usually be criticized as inconsistent with the Gospel. Knowing our **motivation** has the favor of God is key to our maintaining our conviction. **\"God does require this of me.\"**\r\n\r\n### Aren't We called to be peacemakers?\r\n\r\n> **Matthew 5:9 **Blessed are the peacemakers: for they shall be called the children of God.\r\n\r\nWe are not called to be divisive or controversial, but are called to be peacemakers. Sometimes action and a proclamation is the only way to make peace and not passivity.\r\n\r\nIt will usually cost us something and the question will be asked, \"Is it worth the cost?\" \"Should we just fall silent and let it go?\" Has the peace already been broken?\r\n\r\n> **Proverbs 15:1** A soft answer turneth away wrath: but grievous words stir up anger.\r\n\r\n### Aren't we to be Slow to Speak and Slow to Anger?\r\n\r\n> **Psalm 37:8** Cease from anger, and forsake wrath: fret not thyself in any wise to do evil. (\"heavy breathing\")\r\n\r\n> **James 1:19** Wherefore, my beloved brethren, let every man be swift to hear, slow to speak, slow to wrath:\r\n\r\nRighteous anger is a reaction of anger over mistreatment, insult, or malice. Not \"I have a right to be angry\", but \"I have a responsibility to be angry.\"\r\n\r\n> Mt 21:12,13&mdash;And Jesus went into the temple of God, and cast out all them that sold and bought in the temple, and overthrew the tables of the moneychangers, and the seats of them that sold doves, 13 And said unto them, It is written, My house shall be called the house of prayer; but ye have made it a den of thieves.\r\n\r\nWe often allow action we would never endorse by our passiveness.\r\n\r\n### Aren't We Called to Unity?\r\n\r\n> **Psalm 133:1 Behold**, how good and how pleasant it is for brethren to dwell together in unity!\r\n\r\nRecognize that our fellowship is in the truth. If there is no truth, there can be no Christian unity. Light cannot fellowship with darkness.\r\n\r\n> 2 Corinthians 6:14 Be ye not unequally yoked together with unbelievers: for what fellowship hath righteousness with unrighteousness? and what communion hath light with darkness?\r\n\r\n## When to Take a Stand\r\n\r\n### For the glory of Christ.\r\n\r\nThe Believer is burdened with a responsibility to not just respond to offenses to his own sensibilities, but when the Glory and Lordship of Christ is blasphemed.\r\n\r\n> **Romans 2:24 **For the name of God is blasphemed among the Gentiles through you, as it is written.\r\n\r\n### It is a Good Work\r\n\r\n> 1** Peter 3:15-17** &mdash;15 But sanctify the Lord God in your hearts: and be ready always to give an answer to every man that asketh you a reason of the hope that is in you with meekness and fear: Having a good conscience; that, whereas they speak evil of you, as of evildoers, they may be ashamed that falsely accuse your good conversation in Christ. 17 For it is better, if the will of God be so, that ye suffer for well doing, than for evil doing.\r\n\r\nThere will always be resistance no matter what you do.\r\n\r\n### The Reputation of the Gospel May be Compromised\r\n\r\n> Ac 18:5,6&mdash; And when Silas and Timotheus were come from Macedonia, Paul was pressed in the spirit, and testified to the Jews that Jesus was Christ. 6 And when they opposed themselves, and blasphemed, he shook his raiment, and said unto them, Your blood be upon your own heads; I am clean: from henceforth I will go unto the Gentiles.\r\n\r\n### My Vineyard is Threatened (I must answer to God for my faithful keeping)\r\n\r\n(Shammah)\r\n\r\n> Isa 1:15 And when ye spread forth your hands, I will hide mine eyes from you: yea, when ye make many prayers, I will not hear: your hands are full of blood.\r\n\r\n\r\n> Ps 127:3 Lo, children are an heritage of the LORD: and the fruit of the womb is his reward.\r\n\r\n> LINE IN THE SAND: India \"Lakshmana rekha\"\r\n\r\n===================\r\n\r\n\r\n\r\n## How to Take a Stand\r\n\r\nRemember, it is not a priority to be understood by our peers, but to have the favor of God.\r\n\r\n\r\n## Where to take a Stand\r\n\r\nThe Christian and politics"},"type":"READ_MD_FILE"}