{"id":1098,"courseId":"stephen-reynolds-jr-sermon-outlines","tasks":[],"title":"20170416P RESSURRECTION SUNDAY","fileType":"md","value":{"path":"C:\\sites\\github\\courses\\stephen-reynolds-jr-sermon-outlines/20170416P-ressurrection-sunday.md","raw":"# He Resurrected As He Said\r\n\r\nMatthew 26:38-28:20\r\n\r\n> Mt 28:6&mdash;He is not here: for he is risen, as he said. Come, see the place where the Lord lay. \r\n\r\n## AS HE SAID\r\n> Mt 12:40 For as Jonas was three days and three nights in the whale's belly; so shall the Son of man be three days and three nights in the heart of the earth.\r\n\r\n> Mt 26:61 And said, This fellow said, I am able to destroy the temple of God, and to build it in three days.\r\n\r\n>Nu 23:19 God is not a man, that he should lie; neither the son of man, that he should repent: hath he said, and shall he not do it? or hath he spoken, and shall he not make it good?\r\n\r\n## God is the God of the Living (Matthew 22:23-33)\r\n\r\n> Mt 22:23 ¶ The same day came to him the Sadducees, which say that there is no resurrection, and asked him,\r\n 24 Saying, Master, Moses said, If a man die, having no children, his brother shall marry his wife, and raise up seed unto his brother.\r\n 25 Now there were with us seven brethren: and the first, when he had married a wife, deceased, and, having no issue, left his wife unto his brother:\r\n 26 Likewise the second also, and the third, unto the seventh.\r\n 27 And last of all the woman died also.\r\n 28 Therefore in the resurrection whose wife shall she be of the seven? for they all had her.\r\n 29 Jesus answered and said unto them, Ye do err, not knowing the scriptures, nor the power of God.\r\n 30 For in the resurrection they neither marry, nor are given in marriage, but are as the angels of God in heaven.\r\n 31 But as touching the resurrection of the dead, have ye not read that which was spoken unto you by God, saying,\r\n 32 I am the God of Abraham, and the God of Isaac, and the God of Jacob? God is not the God of the dead, but of the living.\r\n 33 And when the multitude heard this, they were astonished at his doctrine.\r\n\r\n## Five Hundred Plus Eyewitnesses\r\n\r\n> 1 Corinthians 15:3-6&mdash;For I delivered unto you first of all that which I also received, how that Christ died for our sins according to the scriptures; 4 And that he was buried, and that he rose again the third day according to the scriptures: 5 And that he was seen of Cephas, then of the twelve: 6 After that, he was seen of above five hundred brethren at once; of whom the greater part remain unto this present, but some are fallen asleep.\r\n\r\nJesus also appears to:\r\n- His half-brother, James (1 Corinthians 15:7),\r\n-  to the ten disciples (John 20:19-23), \r\n-  to Mary Magdalene (John 20:11-18), \r\n-  to Thomas (John 20:24-31), \r\n-  to Cleopas and a disciple (Luke 24:13-35), \r\n-  once again to the disciples but this time all eleven of them (John 20:26-31), and \r\n-  to seven disciples by the Sea of Galilee (John 21:1). \r\n\r\nIf this were part of a courtroom testimony, this would be considered absolute, conclusive evidence.\r\n\r\n## The Tomb Was Empty!\r\n\r\nJesus or the angels rolled away the stone at Jesus’ tomb not so He could get out, but so others could get in and see that the tomb was empty, testifying to the fact that He had risen. The stone was 1-1/2 to 2 two tons and would have taken many strong men to move. The tomb was sealed and guarded by Roman guards, so to believe that the disciples secretly came at night, overpowered the Roman guards, and snatched Jesus’ body away so that others would believe in the resurrection is ridiculous. The disciples were in hiding, afraid that they would be next, and kept their door locked, as it says, “On the evening of that day, the first day of the week, the doors being locked where the disciples were for fear of the Jews, Jesus came and stood among them and said to them, ‘Peace be with you.’” (John 20:19). Now if the tomb had not been empty, claims of the resurrection could not have been maintained for even one hour, knowing that people in Jerusalem could have gone to the tomb to check for themselves.\r\n\r\n## The Burial Linens and Facecloth (John 20:3-8)\r\n\r\n> John 20:3&ndash;8&mdash; Peter therefore went forth, and that other disciple, and came to the sepulchre. 4 So they ran both together: and the other disciple did outrun Peter, and came first to the sepulchre. 5 And he stooping down, and looking in, saw the linen clothes lying; yet went he not in. 6 Then cometh Simon Peter following him, and went into the sepulchre, and seeth the linen clothes lie, 7 And **the napkin, that was about his head, not lying with the linen clothes, but wrapped together in a place by itself** . 8 Then went in also that other disciple, which came first to the sepulchre, and he saw, and believed.\r\n\r\nThe interesting fact here is that when the disciples went into the tomb, Jesus was gone, but the linen wrappings were folded up and the facecloth was rolled up as if to say, “I don’t need these anymore, but I will leave things lying separately but placed strategically and organized.” The implications are that Jesus must have done this himself, as if He simply moved through the wrappings, apparently without a struggle. If Jesus’ body had been stolen, as some claim, the thieves would not have taken the time to remove the wrappings or roll up the face cloth.\r\n\r\n## Jesus’ Death Opened the Tombs\r\n\r\n> Mt 27:50-54 &mdash;Jesus, when he had cried again with a loud voice, yielded up the ghost. 51 And, behold, the veil of the temple was rent in twain from the top to the bottom; and the earth did quake, and the rocks rent; 52 And the graves were opened; and many bodies of the saints which slept arose, 53 And came out of the graves after his resurrection, and went into the holy city, and appeared unto many. 54 Now when the centurion, and they that were with him, watching Jesus, saw the earthquake, and those things that were done, they feared greatly, saying, **Truly this was the Son of God**.\r\n\r\nAt the very moment Jesus yielded up His Spirit, meaning that He died voluntarily (Matt 27:50), the temple curtain was torn from the top down (Matt 27:51a). This indicated the end of the separation between the holy of holies (representing God’s presence) and man being accomplished by Jesus’ torn body (Isaiah 53), \r\n\r\nbut then something very supernatural happened. “The earth shook, and the rocks were split. The tombs also were opened. And many bodies of the saints who had fallen asleep were raised, and coming out of the tombs after his resurrection they went into the holy city and appeared to many” (Matt 27:51b-53). Jesus’ death allowed the saints of old and those of us today to not be bound by death or held by the grave. \r\n\r\n> John 11:25 Jesus said unto her, I am the resurrection, and the life: he that believeth in me, though he were dead, yet shall he live: 26 And whosoever liveth and believeth in me shall never die. Believest thou this?"},"type":"READ_MD_FILE"}