{"id":1100,"courseId":"stephen-reynolds-jr-sermon-outlines","tasks":[],"title":"20170528 THE RICHNESS OF THE CHRISTIAN EXPERIENCE","fileType":"md","value":{"path":"C:\\sites\\github\\courses\\stephen-reynolds-jr-sermon-outlines/20170528_the-richness-of-the-christian-experience.md","raw":"# The Richness of the Christian Experience\r\n\r\n## Introduction - The Cheapening of Christianity\r\n\r\n- Prayer and Faith are presented as if \"God is in the palm of my hand.\" instead of \"Me being in the Palm of His Hand\".\r\n- Holiness and Sanctification are mentioned in word, but rarely in principle. \"To be Like Jesus\" but what does that look, smell, and sound like?\r\n- An Article  written by Bob Siedensticker \"Christianity: Just Another Marketing Scam\". \"Christianity is also just marketing. There’s nothing there, just promises.\"\r\n- Someone posted a quote about the Believers call of separation apart from the world and followed that with a video of a singer who appearance sells perfectly the message of modern fashion--wrapped all up in current flood of carnal focus. (Just a song, just a clever quote?)\r\n- What is under that ministry to others? (more on that later)\r\n\r\n- Love the Way of Holiness unto the Lord and Teach the Reasons to Our Children (DEPTH OF EARTH.)\r\nWhen we do not talk about them, we tend to first forget the reasons (1Pe 3:15).\r\n\r\n> 1Pe 3:15 &mdash;But sanctify the Lord God in your hearts: and be ready always to give an answer to every man that asketh you a reason of the hope that is in you with meekness and fear:\r\n\r\n- Where is the Difference in Lifestyle from the Believer and the Sinner? Is it obvious? Is it prominent? HOW IS IT DIFFERENT? If there is no different in the product produced by a life serving Christ than that product produced by a life serving self, where is the VALUE in my faith?\r\n- Lord Help us to Illustrate the Richness of a Relationship with Christ\r\n\r\n## I. A Genuine Revival is Needed in Our Appreciation of the WHOLE Word of God -- Appreciating The Old Testament\r\n\r\n(\"The Old Bible\"--Andy Parrett)\r\n\r\n### A. Is the Old Testament Irrelevant to the New Testament Believer?\r\n\r\nWas the Old Testament \"done away with?\"\r\n\r\n#### 1. What Some are Saying\r\n\r\n> Christians need no spiritual relationship with the Old Testament, including the Ten Commandments and the principle of tithing, considered by many Christians as traditional hallmarks of the faith&mdash;Andrew Farley, in his Book \"God without Religion\", #8 on Washington Times Best Seller last last June. \r\n\r\n#### 2. Where is that phrase found in Scripture?\r\n\r\nWe can find this phrase in 1Co 13:10; 2Co 3:7; 2Co 3:11, but 2 Corinthians 3:14 most directly mentions our subject:\r\n\r\n> 2 Corinthians 3:14 But their minds were blinded: for until this day remaineth the same vail untaken away in the reading of the old testament; which vail is done away in Christ.\r\n\r\nIt is the \"Viel over the reading\" that is done away and not the Word.\r\n\r\n#### 3. Who needs the Old Testament? Everyone.\r\n\r\nThe Key is in HOW we read it. So, how should we read the Old Testament?\r\n\r\n### B. You cannot understand the \"NEW\" without the \"OLD\"\r\n\r\nWe can EMBRACE the WHOLE council of God.\r\n\r\nThe accounts of the Old Testament speak to our hearts in the very least through significance and symbolism.\r\n\r\n> Matthew 13:51-52&mdash; Jesus saith unto them, Have ye understood all these things? They say unto him, Yea, Lord. 52 Then said he unto them, Therefore every scribe which is instructed unto the kingdom of heaven is like unto a man that is an householder, which bringeth forth out of his treasure things new and old.\r\n\r\n<!-- -->\r\n\r\n> St. Augustine &mdash; \"The New is in the Old contained; The Old is by the New explained.\"\r\n\r\nHebrews is incomplete without Leviticus and Revelation without Daniel.\r\n\r\n- Happened for an Example and Written for our Admonition&mdash;mild rebuke, warning.\r\n\r\n> 1 Corinthians 10:1-14&mdash;Moreover, brethren, I would not that ye should be ignorant, how that all our fathers were under the cloud, and all passed through the sea; 2 And were all baptized unto Moses in the cloud and in the sea; 3 And did all eat the same spiritual meat; 4 And did all drink the same spiritual drink: for they drank of that spiritual Rock that followed them: and that Rock was Christ. 5 But with many of them God was not well pleased: for they were overthrown in the wilderness. 6 ¶ Now these things were our examples, to the intent we should not lust after evil things, as they also lusted. 7 Neither be ye idolaters, as were some of them; as it is written, The people sat down to eat and drink, and rose up to play. 8 Neither let us commit fornication, as some of them committed, and fell in one day three and twenty thousand. 9 Neither let us tempt Christ, as some of them also tempted, and were destroyed of serpents. 10 Neither murmur ye, as some of them also murmured, and were destroyed of the destroyer. 11 Now all these things happened unto them for ensamples: and they are written for our admonition, upon whom the ends of the world are come. 12 Wherefore let him that thinketh he standeth take heed lest he fall. 13 There hath no temptation taken you but such as is common to man: but God is faithful, who will not suffer you to be tempted above that ye are able; but will with the temptation also make a way to escape, that ye may be able to bear it. 14 Wherefore, my dearly beloved, flee from idolatry.\r\n\r\n## II. Appreciating Tithing in Particular\r\n\r\nJesus mentions tithing in the context of the Pharisees Hypocrisy.\r\n\r\n> Luke 11:42&mdash; But woe unto you, Pharisees! for ye tithe mint and rue and all manner of herbs, and pass over judgment and the love of God: these ought ye to have done, and not to leave the other undone.\r\n\r\nSome would conclude then tithing is done way with. But the truth of the matter is what has changed is how we are to understand the Old Testament Scriptures (Lev 27:32 \"tenth of the herd\";  Numbers 18:26 \"tenth part of the heave offering\"; De 14:22 \"tithe all the increase of thy seed\"; and\r\n\r\n> Malachi 3:8&mdash;Will a man rob God? Yet ye have robbed me. But ye say, Wherein have we robbed thee? In tithes and offerings. 9 Ye are cursed with a curse: for ye have robbed me, even this whole nation.\r\n\r\n- God is not interested in merely a 10th of my income, the Principles of Grace are even More Rich!\r\n\t- We are to Give Liberally and Regularly (The first Lesson tithing teaches us is one of THANKFULNESS, \"Where did you get it in the first place?\"\r\n\r\n>  1 Corinthians 6:20&mdash;For ye are bought with a price: therefore glorify God in your body, and in your spirit, which are God's.\r\n\r\n\t- We are to Love Each Other and Carry Each Other's Burdens as Our Own\r\n\r\n>  Ac 2:44 And all that believed were together, and had all things common;\r\n\r\n\t- We are to develop a heart in tune with God's so that we put forth our effort and investment into what matters to Christ!\r\n\r\n> 1 Corinthians 16:2&mdash;Now concerning the collection for the saints, as I have given order to the churches of Galatia, even so do ye. 2 Upon the first day of the week let every one of you lay by him in store, as God hath prospered him, that there be no gatherings when I come. 3 And when I come, whomsoever ye shall approve by your letters, them will I send to bring your liberality unto Jerusalem.\r\n\r\n10%??? Giving Unto God and His Work is not \"Done Away With, the principal is expanded.\r\n\r\n> 2 Co 9:6-7 ¶ But this I say, He which soweth sparingly shall reap also sparingly; and he which soweth bountifully shall reap also bountifully. 7 Every man according as he purposeth in his heart, so let him give; not grudgingly, or of necessity: for God loveth a cheerful giver.\r\n\r\n## III. The Lessons of the Robe of the Ephod, Exodus 28:31-39\r\n\r\n<!-- -->\r\n\r\n> Exodus 28:31-39&mdash;31 ¶ And thou shalt make the robe of the ephod all of blue. 32 And there shall be an hole in the top of it, in the midst thereof: it shall have a binding of woven work round about the hole of it, as it were the hole of an habergeon, that it be not rent. 33 And beneath upon the hem of it thou shalt make pomegranates of blue, and of purple, and of scarlet, round about the hem thereof; and bells of gold between them round about: 34 A golden bell and a pomegranate, a golden bell and a pomegranate, upon the hem of the robe round about. 35 And it shall be upon Aaron to minister: and his sound shall be heard when he goeth in unto the holy place before the LORD, and when he cometh out, that he die not. 36 And thou shalt make a plate of pure gold, and grave upon it, like the engravings of a signet, HOLINESS TO THE LORD. 37 And thou shalt put it on a blue lace, that it may be upon the mitre; upon the forefront of the mitre it shall be. 38 And it shall be upon Aaron's forehead, that Aaron may bear the iniquity of the holy things, which the children of Israel shall hallow in all their holy gifts; and it shall be always upon his forehead, that they may be accepted before the LORD. 39 And thou shalt embroider the coat of fine linen, and thou shalt make the mitre of fine linen, and thou shalt make the girdle of needlework.\r\n\r\n### A. The Many Layers of this Garment\r\n\r\n> Exodus 28:1-5&mdash;And take thou unto thee Aaron thy brother, and his sons with him, from among the children of Israel, that he may minister unto me in the priest's office, even Aaron, Nadab and Abihu, Eleazar and Ithamar, Aaron's sons. 2 And thou shalt make **holy garments** for Aaron thy brother for glory and for beauty. 3 And thou shalt speak unto all that are wise hearted, whom I have filled with the spirit of wisdom, that they may make Aaron's garments **to consecrate him, that he may minister unto me in the priest's office**. 4 And these are the garments which they shall make; a **breastplate**, and an **ephod**, and a **robe**, and a **broidered coat**, a **mitre**, and a **girdle**: and they shall make holy garments for Aaron thy brother, and his sons, that he may minister unto me in the priest's office. 5 And they shall take gold, and blue, and purple, and scarlet, and fine linen.\r\n\r\n- There is a depth of work that God is intent on developing in every BELIEVER.\r\n- Is my surrender to Christ deeper than convenience? The expectations of others? \r\n\r\n\t- 1. The Ephod, v. 6,7\r\n\r\n> Exodus 28:6&mdash;And they shall make the ephod of gold, of blue, and of purple, of scarlet, and fine twined linen, with cunning work.\r\n\r\n\t- 2.  The Girdle of the Ephod, v. 8-14\r\n\r\n\t- 3. The Breastplate, v. 15-30\r\n\r\n### B. The Robe of the Ephod, v. 31-35\r\n\r\n#### 1. Underneath What Can be Seen By Others, God Does his Best Work\r\n\r\nUnderneath the Breastplate, the Ephod, and the girdle was the Robe of the Ephod--This was the first over piece or outer garment.\r\n\r\n- And thou shalt make the robe of the ephod (**A sleeveless garment, the breastplate (which stones each represented a tribe of Israel) was fastened to the ephod**)\r\n\r\n\t- What is under that public ministry to others?\r\n\t- Annabelle Guenther -- 1. Happy, Jolly (her backstory if one of feeling unloved and unwanted) 2. Hardworking 3. Beautiful Singer 4. Annointed Singer 5. Sunday School Teacher, etc...\r\n\t\r\n(underneath the robe of the Ephod was the linen tunic and breeches.)\r\n\r\n#### 2. You can not Improve on What God Does\r\n\r\n- all of blue. < The linen underbreeches and the linen coat with the linen girdle were worn by both the high priest and the lower priests.>\r\n- Will Heaven be worth the journey?\r\n- A Singular Color (unlike the ephod itself which was a beautiful pathwork of gold, of blue, and of purple, of scarlet, and fine twined linen)\r\n- No Greater Love, No Greater Gift\r\n\r\n### 3. If we Build It According to the Pattern, the Enemy Cannot Undo It!\r\n\r\n>. v. 32 And there shall be an hole in the top of it, in the midst thereof: it shall have a binding of woven work round about the hole of it, as it were the hole of an habergeon, that it be not rent. \r\n\r\n\r\n### 4. God is Purposeful, There is no Beauty Without a Function and not Function or work of God that is not Beautiful\r\n\r\n- 33 And beneath upon the hem of it thou shalt make pomegranates of blue, and of purple, and of scarlet, round about the hem thereof; and bells of gold between them round about: 34 A golden bell and a pomegranate, a golden bell and a pomegranate, upon the hem of the robe round about. 35 And it shall be upon Aaron to minister: and his sound shall be heard when he goeth in unto the holy place before the LORD, and when he cometh out, that he die not. \r\n\r\n> \"The bells provided sound by which the people could follow the progress of the priest. \"\r\n\r\n## Conclusion: In the Forefront, HOLINESSS UNTO THE LORD\r\n\r\n> 36 And thou shalt make a plate of pure gold, and grave upon it, like the engravings of a signet, HOLINESS TO THE LORD. 37 And thou shalt put it on a blue lace, that it may be upon the mitre; upon the forefront of the mitre it shall be. \r\n"},"type":"READ_MD_FILE"}