{"id":1102,"courseId":"stephen-reynolds-jr-sermon-outlines","tasks":[],"title":"20170618A LANDMARK FOLLOW CLOSER","fileType":"md","value":{"path":"C:\\sites\\github\\courses\\stephen-reynolds-jr-sermon-outlines/20170618a_LANDMARK_follow-closer.md","raw":"# Following Jesus\r\n\r\n> John 6:25,26,35 &mdash;  And when they had found him on the other side of the sea, they said unto him, Rabbi, when camest thou hither? 26  Jesus answered them and said, Verily, verily, I say unto you, Ye seek me, not because ye saw the miracles, but because ye did eat of the loaves, and were filled. 27  Labour not for the meat which perisheth, but for that meat which endureth unto everlasting life, which the Son of man shall give unto you: for him hath God the Father sealed. 35  And Jesus said unto them, I am the bread of life: he that cometh to me shall never hunger; and he that believeth on me shall never thirst.\r\n\r\n\r\n\r\n## 1. Afar Off ?\r\n\r\n### Distractions, Things between you and Christ\r\n\r\nSo much distance from where you are and where Christ is, where you should be.\r\n\r\nIn John 6, this crowd really missed the point. Before them stood the BREAD OF LIFE, but They were \"AFAR OFF\".\r\n\r\n### Running Away\r\n\r\nUntil you stop running, you won't have peace of mind! You are running from you help.\r\n\r\n### Watching, Unbelief, Fear, what is the point of hoping?\r\n\r\nPeter followed afar off [when Jesus was being led to Caiphas the High priest; fear; discouragement \"to see the end\"]\r\n\r\n> Matthew 26:54 &mdash;  But Peter followed him afar off unto the high priest's palace, and went in, and sat with the servants, to see the end. \r\n\r\n### Insecure, Ignorant of the Promise\r\n\r\nPublican Standing Afar Off [humility, careful not so assume or presume]\r\n\r\n> Luke 18:13 &mdash;  And the publican, standing afar off, would not lift up so much as his eyes unto heaven, but smote upon his breast, saying, God be merciful to me a sinner.\r\n\r\n### Headed in the right direction\r\n\r\nIt is not a matter so much of how great or little the distance you are from Christ, but in what direction are you moving in? RUN TOWARDS HIM!\r\n\r\nThe man in the tombs (with an unclean spirit, legion) of the Gadarenes ...\r\n\r\n> Mark 5:6 &mdash; But when he saw Jesus afar off, he ran and worshipped him,\r\n\r\nHow do I know if I'm moving in the right direction? Hebrews 13:10 \"WE HAVE AN ALTAR\" which they have no right to eat that serve the tabernacle. vs. 13 Let us go forth unto Him!\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n## 2. Following\r\n\r\nTo be with Christ, Not all the apostles' experiences with jesus were equal. - minus crowd - minus more disciples - mount transfiguration ( Peter and Paul in the NT, It matters how you follow)\r\n\r\n### a. Sensitive, seeking (Matthew 6:33)\r\n\r\nTo Peter Jesus said ...\r\n\r\n> John 13:36 &mdash; Simon Peter said unto him, Lord, whither goest thou? Jesus answered him, Whither I go, thou canst not follow me now; but thou shalt follow me afterwards.\r\n\r\nYou will not find full liberty in Christ by accident.\r\nHeaven's declare theh glory of God and a child can be saved, BUT\r\nyou will consistently walk with Christ only if you seek after him.\r\n\r\n### b. Worshipping, surrendering\r\n\r\n> Matthew 4:19 &mdash;  And he saith unto them, Follow me, and I will make you fishers of men.\r\n\r\nNot MIMIC, worship. IN SPIRIT AND IN TRUTH. In your heart.\r\n\r\nCain and Abel ( Sissy and Stephen, for a babe not entirely a bad thing that is how they learn. )\r\n\r\n### c. Obedience, Faith\r\n\r\n\"I've met God halfway.\" \r\nBut have you come as far as you can?\r\n\r\nWe often grow ear in the little acts of obedience but they are the very avenues that God most often chooses to work in. SIMPLE OBEDIENCE.\r\n\r\n\r\n\r\n\r\n\r\n\r\n## 3. JESUS IS THE PRIZE!\r\n\r\n### Some Reasons We Follow Jesus\r\n\r\n### A church is made up of all sorts, and have all sorts of reasons why we show up.\r\n\r\n1. Drawn by God's Love\r\n2. Other People (\"sheep follow sheep\")\r\n3. The Temporal Blessings (Lady showing up only for the meal after church.)\r\n4. A Personal Need is being met - RELIEF - healing, peace (THERE IS SO MUCH MORE FOR YOU THAN RELIEF FROM YOUR BURDEN in Christ) -- b/c ye did eat of the loaves John 6:26\r\n\r\n\r\n> Philippians 3:10-14 &mdash;  That I may know him, and the power of his resurrection, and the fellowship of his sufferings, being made conformable unto his death; 11  If by any means I might attain unto the resurrection of the dead. \r\n12  Not as though I had already attained, either were already perfect: but I follow after, if that I may apprehend that for which also I am apprehended of Christ Jesus. 13  Brethren, I count not myself to have apprehended: but this one thing I do, forgetting those things which are behind, and reaching forth unto those things which are before, 14  I press toward the mark for the prize of the high calling of God in Christ Jesus. \r\n\r\nKeep you eyes on Jesus!\r\nGet Your eyes full of Jesus!\r\n\r\n"},"type":"READ_MD_FILE"}