{"id":1104,"courseId":"stephen-reynolds-jr-sermon-outlines","tasks":[],"title":"20170622 AYC FOLLOWING JESUS","fileType":"md","value":{"path":"C:\\sites\\github\\courses\\stephen-reynolds-jr-sermon-outlines/20170622_ayc_following-jesus.md","raw":"<!-- Antiock Youtch Camp 2017 6-22-17 Thursday Night -->\r\n\r\n# Following Jesus\r\n\r\nREAD: John 6:24-27,35\r\n\r\n> John 6:25,26,35 &mdash;  And when they had found him on the other side of the sea, they said unto him, Rabbi, when camest thou hither? 26  Jesus answered them and said, Verily, verily, I say unto you, Ye seek me, not because ye saw the miracles, but because ye did eat of the loaves, and were filled. 27  Labour not for the meat which perisheth, but for that meat which endureth unto everlasting life, which the Son of man shall give unto you: for him hath God the Father sealed. 35  And Jesus said unto them, I am the bread of life: he that cometh to me shall never hunger; and he that believeth on me shall never thirst.\r\n\r\n## INTRODUCTION\r\n\r\n- It was at Antioch disciples were first called \"CHRISTIANS\" -- Acts 11:26 (The title given to differentiate them from other Jews. Something different about these!)\r\n- Only 3 times used in Bible, but the name has stuck!\r\n- Christian means \"Follower of Christ\" \r\n- There are those who FOLLOW Christ from AFAR and there are those we who following Christ developing a deep personal relationship with Him. \r\n- Following Jesus is Not So Different Today.\r\n- As there is a diverse crowd of folks in the church tonight, so there were all types of folks in crowd following after Jesus.\r\n- Not all the peoples'  and even the disciples experiences with jesus were equal. - minus crowd - minus more disciples (just 3) - mount transfiguration ( It matters how you follow)\r\n\r\n[caravan] Follow Closer\r\n\r\n## 1. Afar Off\r\n\r\nAll sorts of people follow Jesus from Afar.\r\n\r\n### A CROWD SEEKING BREAD followed from AFAR\r\n\r\nIn John 6, this crowd really missed the point. Before them stood the BREAD OF LIFE, but They were \"AFAR OFF\". (ignorant of the work of God)\r\n\r\nThere eyes were on the TEMPORAL bread -- NOT BREAD OF LIFE\r\n\r\nYou'll never truly understand Christ so long as NOW is most important -- sought to make him a king. \r\n\r\n======================================================================\r\n\r\n==== HE IS MORE THAN RELIEF. (Pray and never come back.)=====\r\n\r\nRELIEF - healing, peace (THERE IS SO MUCH MORE FOR YOU THAN RELIEF FROM YOUR BURDEN in Christ) -- b/c ye did eat of the loaves John 6:26\r\n\r\n======================================================================\r\n\r\nJesus made a separation from the crowd and his disciples.\r\n\r\nGod rewards stewardship at the altar! (he is a rewarder of them that diligently seek Him!)\r\n\r\n> Hebrews 11:6  But without faith it is impossible to please him: for he that cometh to God must believe that he is, and that he is a rewarder of them that diligently seek him.\r\n\r\n==> FOLLOW CLOSER!\r\n\r\n### CAIN followed from AFAR\r\n\r\n> Matthew 4:19 &mdash;  And he saith unto them, Follow me, and I will make you fishers of men.\r\n\r\n- Cain and Abel ( Sissy and Stephen, for a babe not entirely a bad thing that is how they learn. )\r\n- Other People (\"sheep follow sheep\")\r\n- Not MIMIC, worship. IN SPIRIT AND IN TRUTH. In your heart.\r\n- mix what you do with faith \r\n- Let's see how much I can get out of this. JEALOUSY motivated Cain.\r\n\r\n==> FOLLOW CLOSER!\r\n\r\n### Peter Followed from Afar\r\n\r\nWatching, Unbelief, Fear, what is the point of hoping?\r\n\r\nPeter followed afar off [when Jesus was being led to Caiphas the High priest; fear; discouragement \"to see the end\"]\r\n\r\n> Matthew 26:54 &mdash;  But Peter followed him afar off unto the high priest's palace, and went in, and sat with the servants, to see the end. \r\n\r\n- A man well intended to be with Jesus to the end, but FEAR. That was no time to allow distance between Him and Christ!\r\n\r\n- !!! What he thought following Jesus meant... his eyes were greatly opened. (JESUS KNEW FROM THE BEGINNING)\r\n\r\n- There is an ebb and flow in the blessing, stick with it!\r\n\r\n==> FOLLOW CLOSER! (When you are converted/changed \"strengthen your brethren\")\r\n\r\n### Publican Stood Afar Off\r\n\r\nInsecure, Ignorant of the Promise, it is for you!\r\n\r\n [humility, careful not so assume or presume]\r\n\r\n> Luke 18:13 &mdash;  And the publican, standing afar off, would not lift up so much as his eyes unto heaven, but smote upon his breast, saying, God be merciful to me a sinner.\r\n\r\nHave not answered a call to the altar yet.\r\n\r\n==> FOLLOW CLOSER!\r\n\r\n### The Man in the Tombs -- Headed in the right direction\r\n\r\nIt is not a matter so much of how great or little the distance you are from Christ, but in what direction are you moving in? RUN TOWARDS HIM!\r\n\r\nThe man in the tombs (with an unclean spirit, legion) of the Gadarenes ...\r\n\r\n> Mark 5:6 &mdash; But when he saw Jesus afar off, he ran and worshipped him,\r\n\r\nHebrews 13:10 \"WE HAVE AN ALTAR\" which they have no right to eat that serve the tabernacle. vs. 13 Let us go forth unto Him!\r\n\r\n==> FOLLOW CLOSER! (\"I've met God halfway.\" But have you come as far as you can?)\r\n\r\nYou will not find full liberty in Christ by accident.\r\nHeaven's declare the glory of God and a child can be saved, BUT\r\nyou will consistently walk with Christ only if you seek after him.\r\n\r\n==> FOLLOW CLOSER!\r\n\r\n## 2. ALTAR CALL: The Dangers from Following from Afar\r\n\r\n1. You are not Really Out, but you are never really in\r\n2. [caravan] Distractions, Things between you and Christ. So much distance from where you are and where Christ is, where you should be.\r\n3. You cannot make out the details from AFAR. (God has so much more for you.)\r\n\r\n4. You'll Never Experience Deep Down Within that it is JESUS that is the PRIZE!\r\n\r\n> Philippians 3:10-14 &mdash;  That I may know him, and the power of his resurrection, and the fellowship of his sufferings, being made conformable unto his death; 11  If by any means I might attain unto the resurrection of the dead. 12  Not as though I had already attained, either were already perfect: but I follow after, if that I may apprehend that for which also I am apprehended of Christ Jesus. 13  Brethren, I count not myself to have apprehended: but this one thing I do, forgetting those things which are behind, and reaching forth unto those things which are before, 14  I press toward the mark for the prize of the high calling of God in Christ Jesus. \r\n"},"type":"READ_MD_FILE"}