{"id":1105,"courseId":"stephen-reynolds-jr-sermon-outlines","tasks":[],"title":"20170625 JOPPA WORSHIP","fileType":"md","value":{"path":"C:\\sites\\github\\courses\\stephen-reynolds-jr-sermon-outlines/20170625_joppa_worship.md","raw":"# The Altar of Our Worship\r\n\r\n## Introduction\r\n\r\n> Hebrews 13:10-16 &mdash; We have an altar, whereof they have no right to eat which serve the tabernacle. 11  For the bodies of those beasts, whose blood is brought into the sanctuary by the high priest for sin, are burned without the camp. 12  Wherefore Jesus also, that he might sanctify the people with his own blood, suffered without the gate. 13  Let us go forth therefore unto him without the camp, bearing his reproach. 14  For here have we no continuing city, but we seek one to come. 15  By him therefore let us offer the sacrifice of praise to God continually, that is, the fruit of our lips giving thanks to his name. 16  But to do good and to communicate forget not: for with such sacrifices God is well pleased.\r\n\r\n- In the earliest times of the Bible altars were made of earth or stones found in a field, and no tool could be used. = Not a work of man, but of God (an altar of earth)\r\n\r\n> Exodus 20:24 &mdash; An altar of earth thou shalt make unto me, and shalt sacrifice thereon thy burnt offerings, and thy peace offerings, thy sheep, and thine oxen: in all places where I record my name I will come unto thee, and I will bless thee.\r\n\r\n\r\n- They could not have steps lest the nakedness of man be exposed without a covering. = FLESH COVERED\r\n- They served as a table to place the sacrifice upon, and also to catch the blood of the sacrificial victim. = BLOOD --> Cain and Abel (others to be made, but a blood sacrifice not to be neglected)\r\n\r\n> Hebrews 9:22 &mdash; And almost all things are by the law purged with blood; and without shedding of blood is no remission.\r\n\r\n- On the Altar in the Tabernacle were four horns (one on each of the four corners of the altar) = God's Power in Salvation\r\n\r\n## WHERE= Have You Got an Altar?, v. 10 (Where to Worship)\r\n\r\n> 10  We have an altar, whereof they have no right to eat which serve the tabernacle.\r\n\r\n========= ANYWHERE WE MEET THE CONDITIONS OF MEETING WITH GOD ================\r\n\r\nIn the Tabernacle, the priests had to go to a particular physical location to do service unto God.\r\nAn altar is made WHERE we have a personal encounter and communicate with God.\r\n\r\n- Moses built an altar\r\n- Joshua built an altar on Mt. Ebal\r\n- in the Taberanacle\r\n- in the temple\r\n- WHERE IS AN ALTAR made? In our heart!\r\n\r\n> 1 Corinthians 6:19 &mdash; What? know ye not that your body is the temple of the Holy Ghost which is in you, which ye have of God, and ye are not your own? \r\n\r\n## WHEN= (When to Worship)\r\n\r\n- When the preacher invites?\r\n\r\n    1800's, popular American Methodist preachers wanted a method to help them determine who of their listeners had been converted. \r\n    Anglican churches featured an altar in front of the communion table, and ministers often encouraged parishioners to come to the altar if they needed prayer or encouragement. \r\n    Methodist preachers inherited this tradition but changed its purpose, calling rather those \"under conviction\" to come forward to the altar. \r\n    In 1801, for example, itinerant Methodist preacher Peter Cartwright told women at a camp meeting that if they promised \"to pray to God for religion,\" they might take a seat at the altar. \r\n    Cartwright further accused parents who discouraged their children from \"going to the altar\" of hindering their salvation.\r\n\r\n    The altar call gained popularity in the 1830s with the preaching of Charles G. Finney. Finney rejected Calvinistic teaching that human nature was irreparably depraved; he believed only men's wills, not their natures, needed to be   converted. His \"new measures,\" then, set out to make regeneration as easy as possible. the \"anxious bench\" or \"seat of decision.\" \"The object of our measures is to gain attention,\" Finney said, and for that \"you must have something new.\"\r\n\r\nProminent evangelists since Finney's time, most notably D.L. Moody and Billy Graham, have continued to make use of the altar call. But if Moody used Finney's method with enthusiasm, he was careful to avoid implying that a minister can \"cause\" salvation—whatever the methods used. \"It is not our strength we want,\" he told his volunteer counselors. \"It is not our work to make them believe. That is the work of the Spirit … I cannot convert men; I can only proclaim the Gospel.\"\r\n\r\n- When CONVICTION - I've got to find a place to pray! - God gives an ALTAR CALL!\r\n\r\n- Paul and Silas found themselves in a prison.\r\n\r\n## WHY= Have You Got a Sacrifice?, v. 11,12 (Why to Worship)\r\n\r\n> 11  For the bodies of those beasts, whose blood is brought into the sanctuary by the high priest for sin, are burned without the camp. 12  Wherefore Jesus also, that he might sanctify the people with his own blood, suffered without the gate.\r\n\r\n\r\n========= THE PRICE OF HAVING A RELATIONSIHP WITH A HOLY GOD ================\r\n\r\n- HIS Sacrifice is that He might SANCTIFY the people -- separate from the world and set apart to God.\r\n\r\n- Our Worship is how we develop our relationship with Him. --> IS THERE SIN IN MY LIFE?\r\n\r\n> Clayton Alward \"Stewardship is Rewarded at the Altar\" --> Have you been working for the king?\r\n\r\nMary and Joseph had kept baby Jesus and 8 days later at the Temple (to present him unto the Lord) they had a hallelujah time! Simeon and Anna.\r\n\r\n\r\n## What= Let Us Go Unto Him!, 13-16 (How to Worship or what worship looks like)\r\n\r\n> 13  Let us go forth therefore unto him without the camp, bearing his reproach. 14  For here have we no continuing city, but we seek one to come. 15  By him therefore let us offer the sacrifice of praise to God continually, that is, the fruit of our lips giving thanks to his name. 16  But to do good and to communicate forget not: for with such sacrifices God is well pleased.\r\n\r\nCome Bless the Lord!\r\n\r\n- It Needs to be Guarded (Genesis 15:11) Drive Off the Fowl)\r\n- Bearing His Reproach (cannot care what is going on around you) -- tendancy to watch instead of worship--\r\n> Fire On the Altar (The Holy Ghost) -- Elijah, Gideon\r\n\r\n## WHO= Unto Him (Who to Worship)\r\n\r\n> 13  Let us go forth therefore unto him without the camp, bearing his reproach.\r\n\r\n- not the preacher\r\n- not the music\r\n- think about Jesus\r\n\r\n## CONCLUSION: \r\n\r\n1. WHERE? THE ALTAR: ANYWHERE WE MEET THE CONDITIONS OF MEETING WITH GOD\r\n2. WHEN? anytime, all the time\r\n3. WHY? exchange is made with God\r\n4. What/How? in spirit and in truth\r\n5. Who? Jesus\r\n\r\n\r\n\r\n"},"type":"READ_MD_FILE"}