{"id":1106,"courseId":"stephen-reynolds-jr-sermon-outlines","tasks":[],"title":"20170716P","fileType":"md","value":{"path":"C:\\sites\\github\\courses\\stephen-reynolds-jr-sermon-outlines/20170716P.md","raw":"# The Family\r\n\r\n## Introduction: Etymology\r\n\r\n- \"family\" found in 76 verses ( N.T. 1 verse)\r\n\r\n### GREEK (\"family\" N.T. 1 verse)\r\n\r\n> Ephesians 3:15&mdash; Of whom the whole family in heaven and earth is named, \r\n\r\n1. \"GROUP OF FAMILIES\" patria: paternal descent, i.e. (concretely) a group of families or a whole race (nation):--family, kindred, lineage. \r\n2. Greek patria [3985] found in 3 verses: Ephesians 3:15; Luke 2:4 (\"lineage\"); Acts 3:25 (\"kindreds\")\r\n\r\n### HEBREW (\"family\" O.T. 75 verses)\r\n\r\n1. Hebrew - mishpachah [4940] : a family, i.e. circle of relatives; figuratively, a class (of persons), a tribe or people:--family, kind(-red). \r\n2. mishpacha [3985] found in 224 verses: \"kinds\", \"families\", \"family\"\r\n\r\n### Some Questions\r\n\r\n1. What makes a family? What Does the Family Unit Look like in Scripture?\r\n2. What destroys a family?\r\n3. What strengthens a family?\r\n\r\n## What does the Family \"Unit\" Look Like?\r\n\r\n- Father, Mother, and Children\r\n- The Overwhelming Testimony of Scripture establishes this definition. God Created Adam, then Eve as a help meet for Adam who then bore children: Cain, Abel and Seth. God instituted Marriage and the Family in the very beginning.\r\n\r\n## Relationships in the Family (How do we relate to each other?)\r\n\r\n- relationship: the way in which two or more people regard and behave toward each other.\r\n\r\n### Husband and Wife: Marriage\r\n\r\nFamily is the fundamental building block of all human civilizations, and marriage is the foundation of the family.\r\n\r\n> Ecclesiastes 4:9 &mdash; Two are better than one; because they have a good reward for their labour.\r\n\r\n> Mark 10:9 &mdash; What therefore God hath joined together, let not man put asunder.\r\n\r\n### Husband to Wife\r\n\r\n> Ephesians 5:25-33 &mdash; Husbands, love your wives, even as Christ also loved the church, and gave himself for it; 26 That he might sanctify and cleanse it with the washing of water by the word, 27 That he might present it to himself a glorious church, not having spot, or wrinkle, or any such thing; but that it should be holy and without blemish. 28 So ought men to love their wives as their own bodies. He that loveth his wife loveth himself. 29 For no man ever yet hated his own flesh; but nourisheth and cherisheth it, even as the Lord the church: 30 For we are members of his body, of his flesh, and of his bones. 31 For this cause shall a man leave his father and mother, and shall be joined unto his wife, and they two shall be one flesh. 32 This is a great mystery: but I speak concerning Christ and the church. 33 Nevertheless let every one of you in particular so love his wife even as himself; and the wife see that she reverence her husband.\r\n\r\n> Genesis 2:24 &mdash; Therefore shall a man leave his father and his mother, and shall cleave unto his wife: and they shall be one flesh.\r\n\r\n### Wife to Husband\r\n\r\n> Ephesians 5:21-24 &mdash; Submitting yourselves one to another in the fear of God.  22 Wives, submit yourselves unto your own husbands, as unto the Lord.  23 For the husband is the head of the wife, even as Christ is the head of the church: and he is the saviour of the body.  24 Therefore as the church is subject unto Christ, so let the wives be to their own husbands in every thing.\r\n\r\n### Children to Parents\r\n\r\n> Ephesians 6:1-3 ¶ Children, obey your parents in the Lord: for this is right. 2 Honour thy father and mother; (which is the first commandment with promise;) 3 That it may be well with thee, and thou mayest live long on the earth.\r\n\r\n### Father to Children\r\n\r\n> Deuteronomy 6:1-7 &mdash; ¶ Now these are the commandments, the statutes, and the judgments, which the LORD your God commanded to teach you, that ye might do them in the land whither ye go to possess it: 2 That thou mightest fear the LORD thy God, to keep all his statutes and his commandments, which I command thee, thou, and thy son, and thy son's son, all the days of thy life; and that thy days may be prolonged. 3 Hear therefore, O Israel, and observe to do it; that it may be well with thee, and that ye may increase mightily, as the LORD God of thy fathers hath promised thee, in the land that floweth with milk and honey. 4 ¶ Hear, O Israel: The LORD our God is one LORD: 5 And thou shalt love the LORD thy God with all thine heart, and with all thy soul, and with all thy might. 6 And these words, which I command thee this day, shall be in thine heart: 7 And thou shalt teach them diligently unto thy children, and shalt talk of them when thou sittest in thine house, and when thou walkest by the way, and when thou liest down, and when thou risest up.\r\n\r\n> Ephesians 6:4 &mdash; And, ye fathers, provoke not your children to wrath: but bring them up in the nurture and admonition of the Lord.\r\n\r\n### Parents to Children\r\n\r\n> Proverbs 22:6 &mdash; Train up a child in the way he should go: and when he is old, he will not depart from it.\r\n\r\n## The Most Important Lesson from the Family Structure\r\n\r\n- Is that it teaches us how to relate to God.\r\n\r\n> Ephesians 4:6 &mdash; One God and Father of all, who is above all, and through all, and in you all.\r\n<!-- -->\r\n> Matthew 23:9 &mdash; And call no man your father upon the earth: for one is your Father, which is in heaven.\r\n\r\n- And to understand the Godhead/Trinity\r\n\r\n> Matthew 3:16 &mdash; And Jesus, when he was baptized, went up straightway out of the water: and, lo, the heavens were opened unto him, and he saw the Spirit of God descending like a dove, and lighting upon him: 17 And lo a voice from heaven, saying, This is my beloved Son, in whom I am well pleased.\r\n\r\n## What Weakens Families?\r\n\r\nHalf of all marriages end in divorce.\r\n\r\n> \"The American Family: An Endangered and Disappearing Species\" : \"Several statistics suggest that traditional families (husband and wife with children) and family life are disappearing in the United States.  One major factor in the disintegration of families in America is the movement of young adults away from marriage. Nonmarital cohabitation and temporary “hooking up” have to some extent replaced marriage in some segments of the young adult population.\"\r\n\r\n<!-- -->\r\n\r\n> PEW Research Center: \"The U.S. marriage rate (percentage of persons married at age 18-32) has steadily dropped by generation from 65 percent of the Silent Generation (1960) to 48 percent of the Baby Boomer Generation (1980) to 36 percent of the Gen X Generation (1997), to just 26 percent of the Millennial Generation (2013).\"\r\n\r\nIs there an attack on the family? YES\r\n\r\n1. The Decline in Morals - God Fearing\r\n\t- Lost of a Moral Compass\r\n\t- Lust of the Flesh\r\n\t- Loss of Value for the Human Body\r\n\t- Not Watchful of Dangerous things: pornography, pride, loose living\r\n\r\n2. Selfishness - Mother's leaving babies in trashcans. \"Ruining my plans.\"\r\n\r\n3. Carelessness: Insults and Criticism eat like cancer at what bind us together (Gossip)\r\n\r\n## What Strengthens Families?\r\n\r\n1. God Centeredness - A Focus on the WILL of God (leadership)\r\n\r\n2. Love - Compassion - Kindness (\"All things in common, brothers and sisters, a success that seems to be able to take over the world!)\r\n\r\n\tTenderness: words go a long way! ---- Never speak unkindly behind anyone's back. LOYALTY SUPPORT ONE ANOTHER\r\n\tapologies and forgiviness\r\n\r\n3. SPIRITUAL TOGETHER: Godly Disciplines in the Home (Spiritual Home)\r\n\t1. Praying Together\r\n\t2. Reading Together\r\n\t3. Fasting Together\r\n\t4. Teaching in the Home\r\n\t5. Memorizing Scripture\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n"},"type":"READ_MD_FILE"}