{"id":1108,"courseId":"stephen-reynolds-jr-sermon-outlines","tasks":[],"title":"20170725 JESUS IS GOD","fileType":"md","value":{"path":"C:\\sites\\github\\courses\\stephen-reynolds-jr-sermon-outlines/20170725_jesus-is-god.md","raw":"# Jesus is God\r\n\r\nJohn 1:1-14\r\n\r\n- 68% believe Jesus is God\r\n- Americans Love God and the Bible, Fuzzy on the Details\r\n- they’re not sure everything in it is true.\r\n- Six in 10 say everyone eventually goes to heaven, but half say only those who believe in Jesus will be saved. \r\n- And while 7 in 10 say there’s only one true God—Father, Son and Holy Spirit—two-thirds say God accepts worship of all faiths.\r\n- Scott McConnell, executive director of LifeWay Research, says most Americans still identify as Christians. But they seem to be confused about some of the details of their faith.\r\n- For example, he says, about two-thirds of Americans believe Jesus is God while half say Jesus is a being created by God. Those two beliefs don’t seem to match, he says. “Contradictory and incompatible beliefs are OK for most people,” McConnell says.\r\n\r\n## The Word  (“Logos” - the spoken word) vs. 1-5\r\n\r\na.\tThe Word (“Logos”)\r\n\r\n\tThe Word is mentioned four times in two verses.  Three times in verse one and once in verse 14.\r\n\tW O R D  (Gk.) Logos 3056  The Divine Expression\r\n\r\n\tChrist - the spoken word   (used 22 times in John)  The whole written Word. The first 18 verses mainly are a presentation of the Person of Christ.\r\n\r\n\t\t1.\tThe Word and Deity – “The Word was with God”  \r\n\r\n## The Son of God\r\n\t\r\n### Other Scriptures (47 verses in N.T. \"The Son of God\")\r\n\r\n\r\n > Da 3:25 He answered and said, Lo, I see four men loose, walking in the midst of the fire, and they have no hurt; and the form of the fourth is like the Son of God. \r\n <!-- -->\r\n > Mt 4:3 And when the tempter came to him, he said, If thou be the Son of God, command that these stones be made bread.\r\n <!-- -->\r\n> Mt 8:29 And, behold, they cried out, saying, What have we to do with thee, Jesus, thou Son of God? art thou come hither to torment us before the time?\r\n <!-- -->\r\n> Mt 14:33 Then they that were in the ship came and worshipped him, saying, Of a truth thou art the Son of God.\r\n <!-- -->\r\n> Mt 27:54 Now when the centurion, and they that were with him, watching Jesus, saw the earthquake, and those things that were done, they feared greatly, saying, Truly this was the Son of God.\r\n  <!-- -->\r\n> Mr 1:1 ¶ The beginning of the gospel of Jesus Christ, the Son of God;\r\n <!-- -->\r\n>  1Jo 5:20 And we know that the Son of God is come, and hath given us an understanding, that we may know him that is true, and we are in him that is true, even in his Son Jesus Christ. This is the true God, and eternal life.\r\n\r\n## Vs. 1 Father and Son – A distinction is made here – not part but of the whole deity The Divine Nature-The Divine Image\r\n\r\n“In the beginning was the Word” Before the world was made when as yet there was nothing created. \r\nMeaning of “in the beginning.” The Word had existence before the world was created.  This was spoken of the Son, not the man Jesus.  But the Divine Son of God in the fullness of His glory.  John 17:5   17:1, 24\r\n\r\n\t\t\tPs. 90:2 Before the mountains were brought forth.\r\n\t\t\tJohn 17:24  “Before the foundation of the world.”\r\n\t\t\tI Peter 1:20   Foreordained before the foundation of the world.\r\n\t\t\tRev. 13:8      Lamb slain from the foundation of the world.\r\n\t\t\tJohn 8:58; 17:5  6:62  3:13  6:46  8:14  16:28\r\n\r\n\t\t\ta)\tEternity - unmeasurable, indefinite eternity\r\nThe fact of\t\t\tthat preceded all time\r\nexistence\t\t\tSame as Gen. 1:1  “In the beginning”\r\n \r\nb)\tDivine Expression - “Logos” the spoken word\r\nThe eternal purpose was expressed\r\n“was the word” – \r\nChrist the word – The personal Word, a title of the Son of God.  \r\n\r\n  \t\tvs. 1  He is Eternal He is Divine\r\n\r\n(He has His own personality.) Vs. 1  The Word was with God  Vs. 2  The same was in The beginning with God.  This close union was before creation.  It cannot be said God was with Himself.  The Spoken Word “Logos” was with God.  Logos was in the same sense distinct from God.  The distinction is Father and Son.  When we say one is with another we imply there is a distinction between them.  Not an inferior being or creature but equal with the Father called by the same name, God, Creator and Word same attributes, performs same works, same honor and same in substance – Power and Glory.\r\n\r\nLaw of\t\t\tc)\tPersonality - of His own yet totally united\r\nexistence\t\t\tIntelligent active personality  “with”\r\n\t\t\t\t“the Word was with God”\r\n\t\t\t\tEternally coexistent and coequal\r\n\t\t\t\tSeparated only on the Cross\r\n\t\t\t\tJesus is the outward manifestation of God given to us who now believe, in and by the Word of God.\r\n\r\nNature of\t\td)\tNature - of this Word is Divine\r\nexistence\t\t\tThe divine Word of God\r\n\t\t\t\t“The Word was God”\r\n\t\t\t\t“God” (Gk.) Theos  78 times in John\r\n\t\t\t\t2316  Deity, supreme divinity, God\r\n\t\t\t\tThe Logos possessed and eternally manifolded\r\n\t\t\t\tthe very nature of God.\r\n\t\t\t\tHeb. 1:1-3  “The brightness of His glory”\r\n\t\t\t\tThe express image of His person\r\n\r\n## The Word and Creation -\r\n\t\t\tVs. 2,3\r\n\r\n\t\t\ta)\tAntiquity - vs. 2  “The same was in the beginning\r\n\t\t\t\twith God”  \r\n\t\t\t\tThe ancient of days  Dan. 7:9,13,22\r\n\r\nb)\tAgency - vs. 3 “All things were made by Him” – “All things” relate to the universe.\r\n\r\n1)\tIts elements\r\n2)\tIts system of laws\r\n\r\nAll things came into being by Him.\r\n\t\t\tc)\tActivity - “were made”  12 times in John\r\n\r\n1096  Came into being by the word spoken (Gk.) Ginomai - to cause to be What was not came into being when He spoke vs. 3 “without Him was not anything made that was made.” Logos shared with God His position as Son and now as creator. The method of Creation - the spoken word The fact of Creation - John 1:1-3  Gen. 1:1 Heb. 1:1-3  Col. 1:15-17 “Heir of all things”  CREATOR of all things\r\n\r\n## 3.\tThe Word and Life - vs. 4,5,9\r\n\t\t\tLogos and spiritual life\r\n\r\na)\tThe fountain of life - “In Him was life”\r\nGen 2:7  Job 33:4\r\n\r\n\t\t\tb)\tThe effect of life in man - “the life was the light of man”\r\n\t\t\t\tProv. 20:27  Psa. 18:28  Prov. 24:20\r\n\t\t\t\r\nc)\tThe power of life - “the light shineth in darkness”\r\n\r\nd)\tThe scope of life - “the true light that lighteth every man that cometh into the world.”\r\n\r\n\t\tLIFE OF GOD\t\t\tLIGHT OF MEN\r\n\t“In Him was life”\t\t\t“The life was the light of men”\r\n\t\r\n\tLight is used in relation to the righteousness of God\r\n\t\tJohn 3:19,20    \t\t\t12:25\r\n\r\n\t“Walk while ye have the light”\r\n\tGen. 1:2\t Isa. 60:2 \t\tJoel 2:2,31\t\t Acts 2:20\r\n\t\r\n\tJohn 12:35\t\tMatt. 4:16;  27:45      Mark 15:33   Luke 23:44\r\n\tII Cor. 4:6    John 1:5; 3:19; 8:12; 12:46\r\n\r\n\tLogos brings illumination\r\n\tJesus has provided (light) which is revelation to all men, which God has \r\ncreated.  Men can’t extinguish or dim it but can refuse it, and God will cause the light in you to become darkness.\r\n\r\n\tTrue light\t\t\t\tEternal light\r\n\r\n\t\tCan’t be put out by man.\r\n\t\tThe effect is eternal life for every believer.\r\n\t\tJohn 17:2-3 – Knowing the ultimate character of God’s being.\r\n\r\n## Jesus Is God\r\n\r\n> Col 2:6-12 , vs. 9 For in him dwelleth all the fulness of the Godhead bodily.\r\n\r\n<!-- >\r\n\r\n- (Jesus said to them, \"Truly, truly, I say to you, before Abraham was, I am.\"John 8:58). \r\n\r\n- He claimed that He and His Father are one (John 10:30),\r\n\r\n-  and that He is equal with the Father (John 5:17-18)."},"type":"READ_MD_FILE"}