{"id":1111,"courseId":"stephen-reynolds-jr-sermon-outlines","tasks":[],"title":"20170827 PROMISE SUNDAY SCHOOL LESSON","fileType":"md","value":{"path":"C:\\sites\\github\\courses\\stephen-reynolds-jr-sermon-outlines/20170827_promise-sunday-school-lesson.md","raw":"﻿# Dispensation of Promise\r\n\r\n## Overview\r\n\r\n- The Dispensation of Promise spanned 430 years from the call of Abraham to the Exodus.\r\n\r\n- This dispensation is also called the Patriarchal Dispensation.\r\n\r\n- This Dispensation gets its name from the promise made to Abraham and his seed. \r\n\r\n- This Dispensation follows after the time of the beginning of paganism. \r\n\r\nIn our last study, Nimrod had introduced idolatry at Babel. This resulted in God confusing the languages of the people. This was the beginning of Pagan religion. Nimrod, it is believed, worshipped his mother as queen of heaven.\r\n\r\nThe Apostle Paul, speaks of the pagan world in Romans, Chapter one. They “changed the incorruptible God knot an image made like man, and to birds, and four-footed beasts, and creeping things.” Vs. 23\r\n\r\nDeities of human form were worshipped in Greece, those of bestial form in Egypt; and both methods of worship were practiced in Rome. Serpent worship was common in Chaldea and also in Egypt. \r\n\r\nThe people of Abram’s day, had became so evil minded God singled out one man through which He could bring forth the promised seed.\r\n\r\n## The History of Abraham’s Life - Gen. 11:10-25:11\r\n\r\n(1) God referred to Himself as the God of Abraham. Gen. 26:24\r\n\r\n(2) God also referred to Abraham as His friend. Isa. 41:8; James 2:23\r\n\r\n(3) Abraham is considered the father of three religions of today, Judaism, Christianity and Islam.\r\n\r\n(a) Through Isaac - the Jewish religion\r\n\r\n(b) Through Ishmael - The Islamic religion\r\n\r\n(c) Through Christ ( the seed of Abraham) the Christian religion. Rom. 4:11 Gal. 3:7\r\n\r\n(4) Abraham lived in genealogy “halfway” between Adam and Christ.\r\n\r\n\r\n## The Call of Abraham\r\nGen. 12:1-3 Acts 7:1-8\r\n\r\n(1) Where did Abraham live? Gen. 11:31\r\n\r\n(2) What do we know of the city and the religious background? Joshua 24:2 Heathen country - they worshipped the moon god.\r\n\r\n(3) What was God’s command? Gen. 12:1 “Get thee out”\r\n\r\n(4) What was God’s promise to obedience? Vs. 2 “I will bless thee”\r\n\r\n(5) What two symbols was Abraham recognized by?\r\n\r\n(a) An altar - Gen. 12:7, 8 Gen. 13:4,18 Gen. 22:9\r\n(b) A tent -; Heb. 11:9 A temporary dwelling –\r\nLooking for a city.\r\n\r\n## The Land \r\nGen. 12:1 “Get thee out...unto a land”\r\n\r\nFor God’s peculiar people there was a peculiar place. It has been said that the Jew is the miracle of history and Canaan is marvel of geography.\r\n\r\n(1) It is located between the Euphrates and Nile river valleys.\r\nIt was on the international trade routes between Egypt and Mesopotamia.\r\n\r\nIt is known as a land bridge between the north and the south.\r\n\r\n(2) It’s size - Dan to Beersheba - 155 miles long, 55 miles wide.\r\n\r\n(3) It’s climate - has two seasons, wet and dry\r\nEarly or former rains in November and the Latter rains in April.\r\n\r\n(4) It’s production - Deut. 8:7-9 Deut. 32:13\r\n\r\nThe Dead Sea area contains a tremendous wealth of minerals. It has been estimated that the chemical wealth of this area is worth $1.27 Trillion. Russia’s ambition through the centuries has been to conquer this land. Does obedience to the will of God mean that there are no trials? Gen. 13:14-18\r\n\r\n## The Abrahamic Covenant\r\nGen. 13:14-17 Gen. 15:5 Gen. 17:4-8\r\n\r\n(1) Seed shall be as dust of the earth\r\n\r\n(2) Stars of the sky\r\n\r\n(3) Father of many nations\r\n\r\n## The Promised Son - Isaac\r\n\r\n(1) Abraham was a hundred years old when Isaac was born. Gen.17:17\r\n\r\n(2) What was Abraham’s reaction to the promise of a son?\r\nGen. 17:17\r\n\r\n(3) What was Sarah’s reaction to the promise of a son?\r\nGen. 18:12-15\r\n\r\n(4) What does Isaac mean? \r\nLaughter\r\n\r\n## Abraham sent his servant to get a wife for Isaac.\r\nGen. 24:4\r\n\r\n(1) Who was the girl? Gen. 24:24\r\n\r\n(2) What did her name mean?\r\nTo ensnare by beauty.\r\n\r\n(3) How old was Isaac when he married Rebecca?\r\nGen. 25:20\r\n\r\n(4) What was unusual about Rebecca being with child?\r\nGen. 25:23\r\n\r\n(5) What are the meanings of the son’s names?\r\nEsau - hairy, rough\r\nJacob - heel holder, supplanter, trickster \r\n\r\n## Jacob’s sons\r\n\r\n(1) Reuben Son of a Vision\r\n(2) Simeon Gracious hearing\r\n(3) Levi Joined\r\n(4) Judah Praising\r\n(5) Dan A Judge\r\n(6) Naphtali Wrestling\r\n(7) Gad A Troop\r\n(8) Asher Blessed\r\n(9) Issachar A Reward\r\n(10) Zebulun Desired\r\n(11) Joseph Added\r\n(12) Benjamin Son of the Right Hand\r\n\r\n## The rest of Genesis is concerned with Joseph who is a type of Christ.\r\n\r\n(1) The object of his father’s love Gen. 37:3\r\n\r\n(2) The object of his brother’s hatred Gen. 37:4\r\n\r\n(3) Dreams of exaltation Gen. 37:5-10\r\n\r\n(4) Sold into Egypt Gen. 37:12-28\r\n\r\n(5) Life in Egypt Gen. 39:1-6\r\n\r\n(6) Steps to the throne\r\nResistance of evil - Gen. 39:7-9\r\nDivinely favored - Gen. 39:21\r\nProvidential circumstances - Gen. 40:5-8\r\nHonored God - Gen. 41:16\r\nDivine revelation - Gen. 41:25-36\r\nExalted to the throne - Gen. 41:39-44\r\n\r\n(7) A Christ-like spirit\r\nIn forgiving his brothers - Gen. 45:15\r\nIn returning good for evil - Gen. 50:19-21"},"type":"READ_MD_FILE"}