{"id":1114,"courseId":"stephen-reynolds-jr-sermon-outlines","tasks":[],"title":"20171119P ","fileType":"md","value":{"path":"C:\\sites\\github\\courses\\stephen-reynolds-jr-sermon-outlines/20171119P_.md","raw":"# Samson: The Tragic and the Triumphant\r\n\r\nTEXT: Hebrews 11:32-40\r\n\r\n## Introduction\r\n\r\nSamson's name is mentioned in the Hall of Faith in Hebrews 11 in the same breath as it were as Gideon and David, etc.:\r\n\r\n> Hebrews 11:32 &mdash; And what shall I more say? for the time would fail me to tell of Gedeon, and of Barak, and of Samson, and of Jephthae; of David also, and Samuel, and of the prophets:\r\n\r\n<!-- -->\r\n\r\n> Hebrews 11:33-40 &mdash; Who through faith subdued kingdoms, wrought righteousness, obtained promises, stopped the mouths of lions. 34 Quenched the violence of fire, escaped the edge of the sword, out of weakness were made strong, waxed valiant in fight, turned to flight the armies of the aliens. 35 Women received their dead raised to life again: and others were tortured, not accepting deliverance; that they might obtain a better resurrection: 36 And others had trial of cruel mockings and scourgings, yea, moreover of bonds and imprisonment: 37 They were stoned, they were sawn asunder, were tempted, were slain with the sword: they wandered about in sheepskins and goatskins; being destitute, afflicted, tormented; 38 (Of whom the world was not worthy:) they wandered in deserts, and in mountains, and in dens and caves of the earth. 39 And these all, having obtained a good report through faith, received not the promise: 40 God having provided some better thing for us, that they without us should not be made perfect. \r\n\r\n## The Tragic\r\n\r\nBut isn't there alot about Samson that is tragic?\r\n\r\n### Samon's Own Tragedies\r\n\r\n1. Tampered with evil associations (Judges 14:1-3)\r\n\r\n> Judges 14:1-3 &mdash; 1 And Samson went down to Timnath, and saw a woman in Timnath of the daughters of the Philistines. 2 And he came up, and told his father and his mother, and said, I have seen a woman in Timnath of the daughters of the Philistines: now therefore get her for me to wife. 3 Then his father and his mother said unto him, Is there never a woman among the daughters of thy brethren, or among all my people, that thou goest to take a wife of the uncircumcised Philistines? And Samson said unto his father, Get her for me; for she pleaseth me well. \r\n\r\n-- DOWN TO TIMNAH : Of the daughters of the Philistines.—This was against the spirit of the law, which forbad intermarriages with Canaanites\r\n\r\n2. Under the power of carnal appetites (Judges 16:1-4)\r\n3. Childish in His Plans (Judges 15:4)\r\n4. Weak in resisting tempation (Judges 16:15-17)\r\n5. His SAD end (Judges 16:30)\r\n\r\n### Samson's Company\r\n\r\nNone of the biographies in Scripture are present for the purpose of adulation of its characters. Even those who had a part in great acts of God, are presented along with their flaws. The take away from our Bible reading of Judges 13-16 cannot be \"I want to be like Samson\". The Samson's story isn't placed here as a model for this how you OVERCOME. For the most part, there is more here to teach us of, \"THIS IS HOW NOT TO DO IT\".\r\n\r\nThe other \"Honorable Mentions\" in Hebrews 11:\r\n\r\n- **Gideon** : Not once or twice but **4 times**, Gideon doubted God asking for confirmation of a physcial sign. This is not a lesson in how to determine the will of God.\r\n- **Barak** : Everyone knows that DEBORAH and not Barak is the highlight of the story in Judges 4. Barak refused to enter the Battle without Deborah by His side against Sisera.\r\n\r\n> Judges 4:9 &mdash; And she said, I will surely go with thee: notwithstanding the journey that thou takest shall not be for thine honor; for the LORD shall sell Sisera into the hand of a woman. And Deborah arose, and went with Barak to Kedesh. \r\n\r\n- **Jephthae** : (Judges 10) In a certain light, was a man who  was a prostitute’s son, at one point lead a gang in criminal behavior and seemed to have offered his daughter up as a human sacrifice.\r\n- **David** : David had some pretty low lows along with his highs. He doubts God's promises at times (Someday I'll die) and even is weak concerning his flesh with Bathsheba.\r\n- **Samuel** : What could be said ill of the great prophet Samuel? While Samuel was spotless in his own life, he did not raise his sons to follow his example. They took bribes and were dishonest rulers.\r\n\r\nWhy is this story and others like it in the Bible then? \r\n\r\nEven in Paul's usage of **Abraham** we are forced to asked some questions, \"stumbled not at the promise\" though we know \"ABRAM\" did. Paul uses Samson in this chapter, in the same way he used Abraham and Noah, etc.\r\n\r\nThe MODEL of the story is found on the Godward side of the story. Look how God accomplished His will despite the developing character of Samson. Because of God, Samson's story is not just **TRAGIC**, it is also **TRIUMPHANT**.\r\n\r\n> Hebrews 11:34 &mdash; &hellip; out of weakness were made strong &hellip;\r\n\r\n## The Triumphant\r\n\r\nWith God's Influence, Samson's life was full of contrasts:\r\n\r\n1. Separated as Nazarite (Judges 14:1-3) --Tampered with evil association\r\n\r\nHis very birth was a miracle and prophetic.\r\n\r\n2. Spiritual at times (Judges 13:25; 15:14) -- often yet under the power of carnal appetites >>\r\n3. Courageous in battle (Judges 15:11-14) --Childish in His Plans\r\n4. Mighty in Physical Strength (Judges 16:3,9,12,14) --Weak in resisting tempation>>\r\n5. His end was not without fruit (Judges 16:30) --His SAD end\r\n\r\n> Judges 16:30 &mdash;  And Samson said, Let me die with the Philistines. And he bowed himself with all his might; and the house fell upon the lords, and upon all the people that were therein. **So the dead which he slew at his death were more than they which he slew in his life.**\r\n\r\n<!-- -->\r\n\r\n> Judges 13:3-5 &mdash; And the angel of the Lord appeared unto the woman, and said unto her, Behold now, thou art barren, and bearest not: but thou shalt conceive, and bear a son. 4 Now therefore beware, I pray thee, and drink not wine nor strong drink, and eat not any unclean thing: 5 For, lo, thou shalt conceive, and bear a son; and no razor shall come on his head: for the child shall be a Nazarite unto God from the womb: and **he shall begin to deliver Israel out of the hand of the Philistines.**\r\n\r\n<!-- -->\r\n\r\nFAITH\"S GREAT VICTORY IS NOT JUST OVER THE DEVIL, IT IS OVER SELF!\r\n\r\n> Hebrews 11:33-40 &mdash; Who through faith subdued kingdoms, wrought righteousness, obtained promises, stopped the mouths of lions. 34 Quenched the violence of fire, escaped the edge of the sword, **out of weakness were made strong**, waxed valiant in fight, turned to flight the armies of the aliens. 35 Women received their dead raised to life again: and others were tortured, not accepting deliverance; that they might obtain a better resurrection: 36 And others had trial of cruel mockings and scourgings, yea, moreover of bonds and imprisonment: 37 They were stoned, they were sawn asunder, were tempted, were slain with the sword: they wandered about in sheepskins and goatskins; being destitute, afflicted, tormented; 38 (Of whom the world was not worthy:) they wandered in deserts, and in mountains, and in dens and caves of the earth. 39 And these all, having obtained a good report through faith, received not the promise: 40 God having provided some better thing for us, that they without us should not be made perfect. "},"type":"READ_MD_FILE"}