{"id":1116,"courseId":"stephen-reynolds-jr-sermon-outlines","tasks":[],"title":"20171126A KEEPING THE CHARGE","fileType":"md","value":{"path":"C:\\sites\\github\\courses\\stephen-reynolds-jr-sermon-outlines/20171126A_keeping-the-charge.md","raw":"# Keeping the Charge\r\n\r\nTEXT: 1 Chronicles 23:24-32; Nehemiah 12:45\r\n\r\n> 1 Chronicles 23:32 &mdash; And that they should keep the charge of the tabernacle of the congregation, and the charge of the holy place, and the charge of the sons of Aaron their brethren, in the service of the house of the LORD.\r\n<!-- -->\r\n> Neh. 12:45 &mdash; And both the singers and the porters kept the ward of their God, and the ward of the purification, according to the commandment of David, and of Solomon his son. \r\n\r\n\r\n## Introduction\r\n\r\n- Functions of Levitical Order: Service, Burdens (in wilderness), Blood and Sacrifices, Teaching, ---- Gate Keepers, Worshippers\r\n\r\n- the sons of Levi, namely, \r\n    + **Gershon (vs. 7-11)** --  Under Moses->to serve, and for burdens; curtains, coverings and hangings\r\n    + **Kohath (vs. 12-20)** Under Moses->separated to the most holy things when Aaron and his sons have made an end of covering to bear it: but they shall not touch\r\n    + **Merari** (vs 21-23) --  Under Moses->the boards of the tabernacle, and the bars thereof, and the pillars thereof, and sockets thereof, 32And the pillars of the court round about, and their sockets, and their pins, and their cords, with all their instruments, and with all their service: and by name ye shall reckon the instruments\r\n\r\n- David Modified The Duties of a Levite Were To:\r\n    -  wait on the sons of Aaron for the service of the house of the LORD, in the courts, in the chambers, in the purifying of all holy things, the work of the service of the house of God; \r\n    - the shewbread, and for the fine flour for meat offering, and for the unleavened cakes, and for that which is baked in the pan, and for that which is fried, and for all manner of measure and size; \r\n    - **To stand every morning and evening to thank and praise the LORD**\r\n    - to offer all burnt sacrifices unto the LORD \r\n    - keep the charge of the tabernacle of the congregation, and the charge of the holy place, and the charge of the sons of Aaron their brethren, in the service of the house of the LORD.\r\n\r\n## Time is Against Us ( So Little Time)\r\n\r\n<<< **Retirement for Levites**\r\n--  from twenty and five years old and upward they shall go in to wait upon the service of the tabernacle of the congregation: from the age of fifty years they shall cease waiting upon the service thereof, and shall serve no more: 26But **shall minister with their brethren** in the tabernacle of the congregation, **to keep the charge**, and shall do no service. >>>\r\n\r\n----------------\r\n----------------\r\n\r\n- NO HEAVY LIFTING by bearing and carrying the vessels of the sanctuary upon their shoulders, as Jarchi interprets it; this, according to the Jewish writers, was only in force while the tabernacle was in the wilderness, and was moved from place to place: but when it had a fixed habitation, and that laborious service of bearing and carrying the vessels of it ceased, **years made no difference in the Levites, or disqualified them for service;**\r\n\r\n\r\n\r\n## Seasons of Life are Against Us (I can't do what I use to)\r\n\r\n- at Shiloh, and at Jerusalem, where there was no bearing and carrying upon the shoulder, the Levites were not rejected on account of years, **only for their voice**, when they had lost that, and could not sing. \r\n\r\nSingers (Nehemiah 12: Dedication of the Wall)\r\n\r\n> Nehemiah 12:45-46 &mdash; And both the singers and the porters kept the ward of their God, and the ward of the purification, according to the commandment of David, and of Solomon his son. 46 For in the days of David and Asaph of old there were chief of the singers, and songs of praise and thanksgiving unto God.\r\n\r\nIn Nehemiah 12, 2 Great Groups were divided to SING:\r\n\r\n> Numbers 12:27-43 &mdash; 27 And at the dedication of the wall of Jerusalem they sought the Levites out of all their places, to bring them to Jerusalem, to keep the dedication with gladness, both with thanksgivings, and with singing, with cymbals, psalteries, and with harps. ... 30And the priests and the Levites purified themselves, and purified the people, and the gates, and the wall. 31Then I brought up the princes of Judah upon the wall, and appointed two great companies of them that gave thanks, whereof one went on the right hand upon the wall ... 38And the other company of them that gave thanks went over against them, ... 40So stood the two companies of them that gave thanks in the house of God, ... And the singers sang loud, with Jezrahiah their overseer. 43Also that day they offered great sacrifices, and rejoiced: **for God had made them rejoice with great joy**: the wives also and the children rejoiced: so that the joy of Jerusalem was heard even afar off.\r\n<!-- -->\r\n> Psalm 92:4 &mdash;For thou, LORD, hast made me glad through thy work: I will triumph in the works of thy hands.\r\n\r\n- He Has Made me Glad!\r\n\r\n<!-- -->\r\n\r\n> Psalm 96:1,2 &mdash; 1 O sing unto the LORD a new song: sing unto the LORD, all the earth. 2 Sing unto the LORD, bless his name; shew forth his salvation from day to day.\r\n\r\n- THANKSGIVING IS AN INSTITUTION-- - We all face Seasons of WHAT I CAN'T seem to take our focus -- You don't **RETIRE** from it\r\n- David's Last Say on the Temple Worship: **1 Chronicles 23** (1 Chronicles 23:24-32)\r\n- What were the regular times of thanksgiving: Morning and Evening\r\n\r\n>  1 Chronicles 23:30 &mdash; And to stand every morning to thank and praise the LORD, and likewise at even; \r\n\r\n## Humanity is against Us\r\n\r\nPorters\r\n\r\n- Singers and Porters\r\n- Musicians and Gatekeepers\r\n- Singers and Gatekeepers\r\n\r\n-- **WARD**\r\n\r\n-  ward, duty, service, service obligations,  what God required, worship of God, charge\r\n\r\n> To \"keep the ward\" is to observe the regular times and seasons of sacrifice and thanksgiving. &mdash; Ellicott's Commentary for English Readers\r\n\r\n- a gate-keeper, take charge of the doors and gates of the temple. The man who attends to the gate\r\n\r\n> John 10:1-3 &mdash; Verily, verily, I say unto you, He that entereth not by the door into the sheepfold, but climbeth up some other way, the same is a thief and a robber.2 But he that entereth in by the door is the shepherd of the sheep. 3 To him the porter openeth; and the sheep hear his voice: and he calleth his own sheep by name, and leadeth them out.\r\n\r\n> **ILLUSTRATION**: Tevye, Jewish Dairy Farmer, Changes happening all around him and new patterns developing .... \"On the One hand ... on the other hand ... THERE IS NO OTHER HAND\"\r\n\r\n- Zeal for the Things of God (the ward of the purification) Watchman on the wall -- **PRAY** --- **LEAD TO TRUE WORSHIP**\r\n\r\n- This is My Joy!\r\n> Psalm 84:10 &mdash; For a day in thy courts is better than a thousand. I had rather be a doorkeeper in the house of my God, than to dwell in the tents of wickedness.\r\n\r\n- They were sometimes employed as musicians ( 1 Chronicles 15:18 ). Even the Door Keeper get's to sing!\r\n\r\n\r\n\r\n\r\n\r\n- "},"type":"READ_MD_FILE"}