{"id":1123,"courseId":"stephen-reynolds-jr-sermon-outlines","tasks":[],"title":"20180121 BRIEF","fileType":"md","value":{"path":"C:\\sites\\github\\courses\\stephen-reynolds-jr-sermon-outlines/20180121-brief.md","raw":"# Biography: Isaiah the Prophet\r\n\r\n> Isaiah 1:1 &mdash; The vision of Isaiah the son of Amoz, which he saw concerning Judah and Jerusalem in the days of Uzziah, Jotham, Ahaz, and Hezekiah, kings of Judah.\r\n\r\n## Isaiah, his Name\r\n\r\nHis name means “The Lord is salvation.”\r\n\r\nIsaiah is often called the \"Messianic Prophet\" as he is best known for prophesying the coming of Jesus Christ to save mankind from sin. There would be many leaders deliverers throughout Israel's history, but Isaiah prophesied of the \"Messiah\", \"The Anointed One.\" The New Testament title for \"Messiah\" is \"The Christ\".\r\n\r\n## Family\r\n\r\n### Parents\r\n\r\nAccording to the rabbinic literature, Isaiah was a descendant of the royal house of Judah and Tamar (Sotah 10b). He was the son of Amoz (not to be confused with Prophet Amos), who was the brother of King Amaziah of Judah.\r\n\r\n## Historical Setting\r\n\r\nIsaiah was a contemporary with the prophets Amos, Hosea and Micah.\r\n\r\nTiglath-pileser (King of Assyria) had conquered all of northern Syria by 740 (the date of Uzziah’s death) and forced all small kingdoms, including Israel under Menahem to pay tribute (2 Kings 15:19f) and Judah under Uzziah (\"Azariah\").\r\n\r\nAssyria (Shalmaneser or his successor Sargon II) moved against Israel and after a three year siege, took the capital of Samaria (722/1) and carried the people into captivity\r\n\r\n## Wife and Children\r\n\r\nIsaiah was married to a prophetess and they had two sons whose names had prophetic meanings.\r\n\r\n### Mahershalalhashbaz\r\n\r\nmeaning “speed the spoil, hasten the booty”\r\n\r\n### Shear-Jashub\r\n\r\nmeaning “a remnant shall return”\r\n\r\n### Uzziah\r\n\r\n## Ministry\r\n\r\n### Timeline\r\n\r\nIsaiah’s Judean ministry extended for at least 40 years (740-701):\r\n\r\n1. Uzziah’s death 740 B.C. (6:1)\r\n\r\n2. Through the reign of Jotham (750-731)\r\n\r\n3. Through the reign of Ahaz (735-715)\r\n\r\n4. Through the reign of Hezekiah (certainly 701)\r\n\r\n5. Possibly through some of the reign of Manasseh [if it was he who assassinated him] (696-642)\r\n\r\n### 700 Years Before Christ\r\n\r\nIsaiah lived about 700 years before the birth of Jesus Christ. Born in Jerusalem, Israel, he was said to have found his calling as a prophet when he saw a vision in the year of King Uzziah’s death. Isaiah prophesized the coming of the Messiah Jesus Christ.\r\n\r\n## Isaiah, the Book\r\n\r\n## Isaiah's Death\r\n\r\nJewish tradition says he was killed by being sawn in two by King Manasseh, the son of King Hezekiah. This seems to be alluded to in Hebrews 11:37.\r\n\r\n> Hebrews 11:37 &mdash; They were stoned, they were sawn asunder, were tempted, were slain with the sword: they wandered about in sheepskins and goatskins; being destitute, afflicted, tormented;\r\n\r\n"},"type":"READ_MD_FILE"}