{"id":1124,"courseId":"stephen-reynolds-jr-sermon-outlines","tasks":[],"title":"20180121 ISAIAH BIOGRAPHY","fileType":"md","value":{"path":"C:\\sites\\github\\courses\\stephen-reynolds-jr-sermon-outlines/20180121_isaiah-biography.md","raw":"# Biography: Isaiah the Prophet\r\n\r\n> Isaiah 1:1 &mdash; The vision of Isaiah the son of Amoz, which he saw concerning Judah and Jerusalem in the days of Uzziah, Jotham, Ahaz, and Hezekiah, kings of Judah.\r\n\r\n## Isaiah, his Name\r\n\r\nHis name means “The Lord is salvation.”\r\n\r\nIsaiah is often called the \"Messianic Prophet\" as he is best known for prophesying the coming of Jesus Christ to save mankind from sin. There would be many leaders deliverers throughout Israel's history, but Isaiah prophesied of the \"Messiah\", \"The Anointed One.\" The New Testament title for \"Messiah\" is \"The Christ\".\r\n\r\nIn the Old Testament: \r\n- PRIESTS were anointed with oil when they were appointed to their office (Exodus 30:25-30; Leviticus 8:10-13). \r\n- PROPHETS were anointed\r\n- KINGS were also anointed with oil when they were appointed by God (1 Samuel 16:1,13; 1 Kings 19:16)\r\n\r\nIsaiah prophesied of the \"Anointed One\" who would hold all three offices: Priest, Prophet and King.\r\n\r\n> Isaiah 11:1 &mdash; And there shall come forth a rod out of the stem of Jesse, and a Branch shall grow out of his roots:\r\n\r\n## Family\r\n\r\n### Parents\r\n\r\nAccording to the rabbinic literature, Isaiah was a descendant of the royal house of Judah and Tamar (Sotah 10b). He was the son of Amoz (not to be confused with Prophet Amos), who was the brother of King Amaziah of Judah.\r\n\r\n- name means \"the strength of the Lord,\" \"strengthened by Yahweh,\" or \"Yahweh is mighty\"; \r\n- was a king of Judah, the son and successor of Joash. \r\n- His mother was Jehoaddan (2 Kings 14:1–4) and his son was Uzziah (2 Chronicles 26:1). \r\n- He took the throne at the age of 25, after the assassination of his father, and reigned for 29 years, (2 Kings 14:2, 2 Chronicles 25:1) 24 years of which were with the co-regency of his son. \r\n- 2 Kings and the 2 Chronicles consider him a righteous king, but with some hesitation.\r\n-  He is praised for killing the assassins of his father only and sparing their children, as dictated by the law of Moses.\r\n\r\n## Historical Setting\r\n\r\nIsaiah was a contemporary with the prophets Amos, Hosea and Micah.\r\n\r\nB. Tiglath-pileser (King of Assyria) had conquered all of northern Syria by 740 (the date of Uzziah’s death) and forced all small kingdoms, including Israel under Menahem to pay tribute (2 Kings 15:19f) and Judah under Uzziah (\"Azariah\").\r\n\r\nA Syro-Ephraimite coalition attempted to overthrow the king of Judah (Isa. 7:1) to replace him with a king that would join the coalition. Isaiah exhorted Ahaz to trust in the Lord. Ahaz refused and turned to Assyria for help (Isa. 7; 2 Kings 16:7-9). (Tiglath-pilesar's name means \"my trust is in the son of the Ešarra the son of the Ešarra (false god of barley)\")\r\n\r\n6. Tiglath-pileser invaded Israel and almost came to Judah’s boarders (Isa. 15:29) Israel’s king--Hoshea paid tribute to Tiglath-pileser (732)\r\n\r\nb. Tiglath-pileser died (727) and Hosea (who overtook Pikah in Israel) refused (in alliance with So of Egypt) to pay tribute to Shalmaneser V as he had to Tiglath-pileser (2 Kings 17:4).\r\n\r\nC. Assyria (Shalmaneser or his successor Sargon II) moved against Israel and after a three year siege, took the capital of Samaria (722/1) and carried the people into captivity\r\n\r\nD. Assyria expanded unto the northern boundary of Judah. Judah was also left alone when many of the city states of Palestine and Syria along with Egypt rebelled against Assyria and were put down in 720 B.C.\r\n\r\nE. Judah (under Hezekiah) joined an uprising along with Egypt, Edom, and Moab against Assyria (713-711)\r\n\r\nF. Sargon (of Assyria) took Ashdod and Gath leaving Judah vulnerable\r\n\r\nG. Sargon died in 705 leading to revolt by many including Judah under Hezekiah along with Babylon (2 kings 20:12-19; Isa. 39:1-4)\r\n\r\nH. Sennacherib (of Assyria) retaliated in 701 defeating Sidon, receiving tribute from Ashdod, Ammon, Moab, and Edom, subjugating Ashkelon and Ekron, and surrounding Hezekiah2 and forcing him to pay tribute to Sennacherib (2 Kings 18:13-16)\r\n\r\n## Wife and Children\r\n\r\nIsaiah was married to a prophetess and they had two sons whose names had prophetic meanings.\r\n\r\n### Mahershalalhashbaz\r\n\r\nmeaning “speed the spoil, hasten the booty”\r\n\r\n> Isaiah 8:3 &mdash; Isa 8:3 And I went unto the prophetess; and she conceived, and bare a son. Then said the LORD to me, Call his name Mahershalalhashbaz. 4 For before the child shall have knowledge to cry, My father, and my mother, the riches of Damascus and the spoil of Samaria shall be taken away before the king of Assyria.\r\n\r\n### Shear-Jashub\r\n\r\nmeaning “a remnant shall return”\r\n\r\n> Isaiah 7:3 &mdash; Then said the LORD unto Isaiah, Go forth now to meet Ahaz, thou, and Shearjashub thy son, at the end of the conduit of the upper pool in the highway of the fuller's field; \r\n\r\nIsaiah and his family would be for “signs and wonders in Israel”. His prophecies are still “signs and wonders” for us today.\r\n\r\n> Isaiah 8:18 &mdash; Behold, I and the children whom the LORD hath given me are for signs and for wonders in Israel from the LORD of hosts, which dwelleth in mount Zion.\r\n\r\n### Uzziah\r\n\r\n(II Chron. 26:1-4) Uzziah was a good king, who did that which was right in the sight of the Lord God. He sought the Lord, and God made him to prosper. God helped him in battle (Vs. 7-8). He served the people, building towers in the desert to protect herds, digging many wells, and planting vineyards (Vs. 10). He had a great army (Vs. 12-13), was a brilliant leader (Vs. 15), and his name was known far and wide.\r\n\r\n(II Chron. 26:16) But Uzziah made a serious and fatal mistake which led to his utter destruction and death. \"When he was strong;\" he was mighty, he was proud of his accomplishments, he was free from the fear of the enemy; and his heart was so overcome by his importance that he went into the temple, into the holy place, where the altar of incense stood, and into which NONE BUT THE PRIEST MIGHT ENTER, to offer incense himself upon the altar.\r\n\r\n(II Chron. 26:17-18)\tAzariah, the priest, and eighty priests of the Lord withstood King Uzziah, declaring unto him the seriousness of his act. Only the priests of God, the\tsons of Aaron, were consecrated by God to burn incense to the Lord. NO MAN, NOT EVEN A KING, was permitted to offer sacrifices for sin (Heb. 5:1-5). They told him that such an act could not honor him before God. No matter how sincere nor how great a man may be, it is folly to violate the holiness of God.\r\n\r\n(II Chron. 26:19-21) Instead of listening to the priest and leaving the temple, Uzziah became angry and held to the censer to burn incense. God smote the proud king with leprosy, took away his office, and he died in disgrace as a common leper. When they buried him, they said, \"He is a leper.\"\r\n\r\n3.\tIsaiah evidently learned much from the death of King Uzziah. He said, \"In the year that King Uzziah died, I saw the Lord; I saw myself and I saw the condition of the people.\"\r\n\r\n## Ministry\r\n\r\n### Timeline\r\n\r\nIsaiah’s Judean ministry extended for at least 40 years (740-701) and Isaiah prophesied during the rule of at least four different kings of Judah. They were Uzziah, Jotham, Ahaz and Hezekiah and possibly Manasseh.\r\n\r\n1. Uzziah’s death 740 B.C. (6:1)\r\n\r\n2. Through the reign of Jotham (750-731)\r\n\r\n3. Through the reign of Ahaz (735-715)\r\n\r\n4. Through the reign of Hezekiah (certainly 701)\r\n\r\n5. Possibly through some of the reign of Manasseh [if it was he who assassinated him] (696-642)\r\n\r\n### 700 Years Befor Christ\r\n\r\nIsaiah lived about 700 years before the birth of Jesus Christ. Born in Jerusalem, Israel, he was said to have found his calling as a prophet when he saw a vision in the year of King Uzziah’s death. Isaiah prophesized the coming of the Messiah Jesus Christ.\r\n\r\n> Isaiah \r\n\r\nIsaiah is widely regarded as one of the greatest prophets of the Bible. \r\n\r\nHe lived in Jerusalem and the prophecies God gave him were directed toward Israel, Judah and other nations. J\r\n\r\n\r\nJewish tradition says he was of royal descent, and he may have been a cousin to King Uzziah. This may have given him access to the kings of Judah in Jerusalem.\r\n\r\nThe biblical account in chapter 1, verse 1 of the book he authored says he received visions from God during the reigns of four kings of Judah—Uzziah, Jotham, Ahaz and Hezekiah. The time covered is from the end of King Uzziah’s reign (Isaiah 6:1) to the Assyrian King Sennacherib’s siege of Jerusalem. It was at least a 40-year ministry during the last half of the eighth century B.C.\r\n\r\n\r\n\r\n\r\n## Isaiah, the Book\r\n\r\nThere is debate as to whether there was one or two (three or four) author’s of the book because there does not seem to be any reason for eighth century Isaiah to discuss events lying 200 years in the future for Hezekiah’s generation. It is assumed that chapters 40-66 were written by a Second Isaiah at the end of the exile to deported and defeated fellow-countrymen. This broad generalization is not a necessary conclusion. Isaiah is believed to have written chapters 1-39 in The Book of Isaiah with the balance of the book authored by several other prophets. \r\n\r\n## Isaiah's Death\r\n\r\nJewish tradition says he was killed by being sawn in two by King Manasseh, the son of King Hezekiah. This seems to be alluded to in Hebrews 11:37.\r\n\r\n> Hebrews 11:37 &mdash; They were stoned, they were sawn asunder, were tempted, were slain with the sword: they wandered about in sheepskins and goatskins; being destitute, afflicted, tormented;\r\n\r\n"},"type":"READ_MD_FILE"}