{"id":1125,"courseId":"stephen-reynolds-jr-sermon-outlines","tasks":[],"title":"20180204SS","fileType":"md","value":{"path":"C:\\sites\\github\\courses\\stephen-reynolds-jr-sermon-outlines/20180204SS.md","raw":"# A Biography of Jeremiah\r\n\r\n## I. A Prophet of God\r\n\r\nJeremiah 1:4 “The Word of the Lord came”. 51 distinct prophecies came to Jeremiah The things of God were first on his list all his life.\r\n\r\n### A. The Making of a Prophet Jer. 1:1-5\r\n\r\n1:5 Even before conception, God has a plan God’s eternal purpose (Eph. 3:11) should be every believers aim to know and to work out.  Psa. 139:16 \t\tGal. 1:15,16\r\n\r\n#### 1.\tCalled from the womb 1:5 (Formed, Foreknown, Set apart and Ordained by God)\r\n#### 2.\tBorn to a priest (Jeremiah received upbringing, training and teaching by a priest of God.)\r\n#### 3. Called to be a Prophet (Men are not born prophets, they must be made a prophet by a divine calling.)\r\n\r\n- The CHOICE 1:6, 7 (You have a choice to do the will of God Or follow your own will)\r\n- The CHALLENGE\r\nChallenge to your strength (1:6,7) reveals your weakness and inabilities. “I cannot speak”. Whatever God calls you to do, He qualifies you. Challenge to your faith (1:8,) reveals your fears “Be not afraid of their faces”. Challenge to our courage 1:9, 10 **It is His Word** in us that enables us to finish the task.\r\n\r\n- The CONTRACT (Written in bold print: “I HAVE PUT MY WORDS IN THY MOUTH”)\r\nPromise of His presence 1:8; Promise of deliverance 1:8-19; Promise of power 1:9. The contract is signed by the I AM.\r\nThe covenant keeping God – the Lord 1:8\r\n\r\n#### 4. A True Seer\r\n\r\n> Jeremiah 1:11 &mdash; “What seest thou?”\r\n\r\nJeremiah was a Man of Deep Understanding of God’s Heart of Love and that is why God ordained him to “See” over the nations and over the kingdoms. Jeremiah 1:10: \r\n\r\n- “to root out”, “to pull down”, “to pull down” – destruction\r\n- “to throw down”, “to build”, “to plant” – restoration\r\n\r\n### B. The Making of An Overcomer\r\n\r\n- Adverse Experiences &mdash; Jeremiah was raised in Anathoth (A place of adversity, poverty, affliction and depression.)\r\n\r\nJeremiah’s imprisonment 32:1-33:26: Coming captivity 34:1-35:19; The roll is written, burned and rewritten 36:1-32; Imprisonment of Jeremiah 37:1-38:28; Jeremiah among the remnant 40:1-42:22; Jeremiah in Egypt 43:1-44:30\r\n\r\n- Calling Experience &mdash; Anathoth was “In the land of Benjamin (son of my right-hand; place of power, authority and rule; Gen. 35:16-20; 49:19,27)\r\n- Lonely Experiences &mdash; To overcome under adverse circumstances, you will learn to walk alone with God -- a lonely experience. (Genesis 49:27)\r\n- Early Experiences &mdash; “In the morning he shall devour the prey” (young, strong,healthy) (Genesis 49:27; Jeremiah 32:33)\r\n- Latter Experiences &mdash; “At night” - The closing chapters of your life are a success because you have devoured the prey and gained a spoil to divide. The spoil is the result of a life of faith, a fight of faith and battle for truth. (John 6:63)\r\n- Loyal Experience &mdash; Don’t seek God for the benefits, Seek God for who He is.\r\n- Experience in Light &mdash; Run in the morning and keep running till the night. Run while you have the light\r\n\r\n## II. The Weeping Prophet\r\n\r\nKnown as the Weeping Prophet – 9:1 (Associated with troubles and problems continually.)\r\n\r\n> Jeremiah 9:1 &mdash; Oh that my head were waters, and mine eyes a fountain of tears, that I might weep day and night for the slain of the daughter of my people!\r\n\r\n### A.\tHis Life and Ministry\r\n\r\nName literally means “Yahweh Throws”. Perhaps this means in the sense of laying a foundation. We can interpret the name to mean \"Yahweh establishes, appoints or sends\".\r\n\r\n> Jeremiah 1:10 &mdash; See, I have this day set thee over the nations and over the kingdoms, to root out, and to pull down, and to destroy, and to throw down, to build, and to plant.\r\n\r\n- a good record keeper 36:4 \r\n- Jeremiah’s birth 1:5\r\n- A son of a Priest (Hilkiah)\r\n- He was commanded not to marry (16:1) so that he could deliver a stern and solemn message through a broken heart that no one else could bear.\r\n\r\n> Jeremiah 16:2 &mdash; Thou shalt not take thee a wife, neither shalt thou have sons or daughters in this place.\r\n\r\nHis ministry was to Israel (primarily) before the Babylonian captivity and sometime during the captivity.\r\n\r\nJeremiah is unique in the extent to which it integrates prophetic preaching and the life and times of the prophet (began 626 BC). The book thereby enables readers to make explicit connections between the word of God and actual life situations into which that word is addressed. \r\n\r\n### B.\tHis Ministry was not Accepted\r\n\r\n1.\t12:6   His own family rejected him\r\n2.\t11:18-23   His own towns men\r\n3.\t18:18; 1-12   Jerusalem rejected 20:1-18;   26:1-24; 37:1-38:28\r\n4.\t42:19-22; 42:7 Judah rejected\r\n5.\tAfter 40 years of ministry, it has been said that Jeremiah was stoned to death in Egypt.\r\n\r\n After Gedaliah was assassinated, Jeremiah was taken against his will to Egypt by some of the Jews who feared reprisal from the Babylonians. Jeremiah probably died about 570 BC. According to a tradition that is preserved in extrabiblical sources, he was stoned to death by his exasperated fellow countrymen in Egypt.\r\n\r\n## III. A Timely Prophet\r\n\r\n### A. Israel and Judah's own wickedness brought on the judgment\r\n\r\n“Their wickedness” 1:16; Forsaking God 1:16;  Idolatry 1:16; Idol making 1:16\r\n\r\nJeremiah's congregation was very religious.\r\n\r\nHe was the last prophet that God sent to preach to the southern kingdom, which comprised the tribes of Judah and Benjamin. The Northern Kingdom was taken captive by the Assyrians first while Jeremiah prophesied to the Southern Kingdom before the Babylonian captivity.\r\n\r\n> Jeremiah 27:6 &mdash; And now have I given all these lands into the hand of Nebuchadnezzar the king of Babylon, my servant; and the beasts of the field have I given him also to serve him. \r\n\r\nThe certainty of God’s judgment because of sin, yet the tenderness and eternity of the love of God.\r\n\r\n> Jeremiah 31:3 &mdash; The LORD hath appeared of old unto me, saying, Yea, I have loved thee with an everlasting love: therefore with lovingkindness have I drawn thee.\r\n\r\nJeremiah made the announcement of judgment, and, on the far side of disaster, a word of promise.\r\n\r\nJudah’s backsliding 2:1-6:30 (God’s former relationship with His people 2:2, 3; What iniquity have your fathers found in me? 2:5; Divine complaints: )\r\n\r\n(1)\tGoing far from God 2:5\r\n(2)\tSinful walk\t2:5\r\n(3)\tBecome vain2:5\r\n(4)\tForgot to inquire after God2:6\r\n(5)\tUngrateful toward God2:6\r\n(6)\tLack of faith in God2:18\r\n(7)\tAlliance with foreign powers 2:19\r\n(8)\tTransgression against God 2:29\r\n(9)\tForgetting God 2:32\tPsa. 9:17\r\n(10) Complaints against the Priest 2:8\r\n(11) Complaints against the pastors 2:8\r\n(12) Complaints against the false prophets2:8\r\n\r\nJudah’s rebellion to God’s complaints: “We are Lords, we will come no more unto thee.” 2:31\r\n\r\n\t\t\t\r\n### B. Hope in Judgment (Jehoichin’s Liberation 52:31-34)\r\n\r\n- Released from prison 52:31\r\n- Promoted to the throne above the other kings 52:32\r\n- Changed prison garments to king’s garments 52:33\r\n- Received daily a king’s diet 52:34\r\n- After 37 years of captivity in prison, he was lifted up and brought forth out of prison 52:31\r\n- The words were kind 52:32\r\n\r\n(36:23 Jehoiakim, Jehoiachin’s father, cut the word of God Jeremiah had written and threw it into the fire.)\r\nJehoichin received the kind words and the kind deeds “all the days of his life”\t52:32,34\r\n\r\n### C. Rising Up Early\r\n\r\n- 7:13 Rising Up Early and Speaking (11 x's:)\r\n\r\n\t- “rising up early and TEACHING them” &mdash; Jeremiah 32:33\r\n\t- “rising up early and SPEAKING” &mdash; Jeremiah 7:13; 25:3; 35:14;\r\n\t- “daily rising up early and SENDING them” &mdash; Jeremiah 7:25; 25:4; 26:5; 29:19; 35:15; 44:4\r\n\t- “rising early and PROTESTING” &mdash;  Jeremiah 11:7\r\n\r\n(The subject of Jeremiah 7 is the defamation and idoltary done in the temple. Early, the Lord sent His prophets and in Jeremiah's case he was \"launched forth\".)\r\n\r\nJeremiah 7:13 &mdash; And now, because ye have done all these works, saith the LORD, and I spake unto you, rising up early and speaking, but ye heard not; and I called you, but ye answered not;\r\n\r\n- 31:14-17; 31-34 God’s goodness with a new covenant\r\n\r\nJeremiah's unique \"new covenant\" language has left an indelible promissory mark on the larger biblical collection.\r\n\r\n> Jeremiah 31:31-33 &mdash; Behold, the days come, saith the LORD, that I will make a new covenant with the house of Israel, and with the house of Judah: 32 Not according to the covenant that I made with their fathers in the day that I took them by the hand to bring them out of the land of Egypt; which my covenant they brake, although I was an husband unto them, saith the LORD: 33 But this shall be the covenant that I will make with the house of Israel; After those days, saith the LORD, I will put my law in their inward parts, and write it in their hearts; and will be their God, and they shall be my people.\r\n\r\n<!-- -->\r\n\r\n> Luke 22:20 &mdash; Likewise also the cup after supper, saying, This cup is the new testament in my blood, which is shed for you.\r\n\r\n- 52:16  Vinedressers left in the land (many have gone into bondage of sin, but God has reserved some unto Holiness)"},"type":"READ_MD_FILE"}