{"id":1127,"courseId":"stephen-reynolds-jr-sermon-outlines","tasks":[],"title":"20180422 HELL","fileType":"md","value":{"path":"C:\\sites\\github\\courses\\stephen-reynolds-jr-sermon-outlines/20180422_hell.md","raw":"# News from Hell\r\n\r\nTEXT: Luke 16:19-31\r\n\r\n## Introduction\r\n\r\n- Behold both Goodness and Severity of God\r\n\r\n> Romans 11:22 &mdash; Behold therefore the goodness and severity of God: on them which fell, severity; but toward thee, goodness, if thou continue in his goodness: otherwise thou also shalt be cut off.\r\n\r\n## Hell is Necessary , vs. 19-22\r\n\r\n19 There was a certain rich man, which was clothed in purple and fine linen, and fared sumptuously every day:\r\n20 And there was a certain beggar named Lazarus, which was laid at his gate, full of sores,\r\n21 And desiring to be fed with the crumbs which fell from the rich man's table: moreover the dogs came and licked his sores.\r\n22 And it came to pass, that the beggar died, and was carried by the angels into Abraham's bosom: the rich man also died, and was buried;\r\n\r\nA Just Consquence\r\n\r\n> Jeremiah 25:14 &mdash; For many nations and great kings shall serve themselves of them also: and I will recompense them **according to their deeds**, and according to the works of their own hands.\r\n\r\nThe Devil's Lie: Genesis 3:4 ... Ye shall not surely die:\r\n\r\n## Hell is Near, v. 23\r\n\r\n23 And in hell he lift up his eyes, ...\r\n\r\n## Hell is Not for You, vs. 23-31\r\n\r\n being in torments, and seeth Abraham afar off, and Lazarus in his bosom.\r\n24 And he cried and said, Father Abraham, have mercy on me, and send Lazarus, that he may dip the tip of his finger in water, and cool my tongue; for I am tormented in this flame.\r\n25 But Abraham said, Son, remember that thou in thy lifetime receivedst thy good things, and likewise Lazarus evil things: but now he is comforted, and thou art tormented.\r\n26 And beside all this, between us and you there is a great gulf fixed: so that they which would pass from hence to you cannot; neither can they pass to us, that would come from thence.\r\n27 Then he said, I pray thee therefore, father, that thou wouldest send him to my father's house:\r\n28 For I have five brethren; that he may testify unto them, lest they also come into this place of torment.\r\n29 Abraham saith unto him, They have Moses and the prophets; let them hear them.\r\n30 And he said, Nay, father Abraham: but if one went unto them from the dead, they will repent.\r\n31 And he said unto him, If they hear not Moses and the prophets, neither will they be persuaded, though one rose from the dead.\r\n\r\n## News from Hell\r\n\r\n=================================================================\r\n\r\n## A Just Consquence\r\n\r\n> Jeremiah 25:14 &mdash; For many nations and great kings shall serve themselves of them also: and I will recompense them **according to their deeds**, and according to the works of their own hands.\r\n\r\nThe Devil's Lie: Genesis 3:4 ... Ye shall not surely die:\r\n\r\n- Death \t\t\t\t\tRomans 6:23; Ezekiel 18:20; Genesis 3\r\n- Corruption \t\t\t\tGalatians 6:8 (reap what you sow)\r\n- Death Spread \t\t\t\tRomans 5:12\r\n- Unquenchable Fire \t\tMark 9:43; Jude 7\r\n- God's Face Hidden\t\t\tIsaiah 59:2\r\n- Utter Darkness     \t\t2 Peter 2:4\r\n- Fall Short of God's glory Romans 3:23\r\n\r\n\r\n## Moved with Fear\r\n\r\n- Behold both Goodness and Severity of God\r\n\r\n> Romans 11:22 &mdash; Behold therefore the goodness and severity of God: on them which fell, severity; but toward thee, goodness, if thou continue in his goodness: otherwise thou also shalt be cut off.\r\n\r\n- Noah Moved with Fear\r\n\r\n> Hebrews 11:7 &mdash; By faith Noah, being warned of God of things not seen as yet, moved with fear, prepared an ark to the saving of his house; by the which he condemned the world, and became heir of the righteousness which is by faith.\r\n\r\n- Beginning of Wisdom\r\n\r\n> Proverbs 9:10 &mdash; The fear of the LORD is the beginning of wisdom: and the knowledge of the holy is understanding.\r\n\r\n- By the fear of the LORD men depart from evil\r\n\r\n> Proverbs 16:6 By mercy and truth iniquity is purged: and by the fear of the LORD men depart from evil.\r\n\r\n- Save with Fear\r\n\r\n> Jude 20 But ye, beloved, building up yourselves on your most holy faith, praying in the Holy Ghost, 21 Keep yourselves in the love of God, looking for the mercy of our Lord Jesus Christ unto eternal life. 22 And of some have compassion, making a difference: 23 And others save with fear, pulling them out of the fire; hating even the garment spotted by the flesh.\r\n\r\n- Do not Come Here!\r\n\r\n> Luke 16:28 &mdash; For I have five brethren; that he may testify unto them, lest they also come into this place of torment.\r\n\r\n## Lake of Fire - The Second Death\r\n\r\n> Revelation 2:11 ... not hurt of the second death\r\n\r\n- The Beast, False Prophet - Revelation 19:20 ... were cast alive into a lake of fire burning with brimstone.\r\n\r\n- The Devil - Revelation 20:10 ... was cast into the lake of fire and brimstone, where the beast and the false prophet are, and shall be tormented day and night for ever and ever.\r\n\r\n- Death and Hell - Revelation 20:14 ... were cast into the lake of fire. This is the second death. [1 Cor. 15:26]\r\n\r\n- Whosoever not found in the Book of Life - Revelation 20:15 ... was cast into the lake of fire.\r\n\r\n> Revelation 21:8 &mdash; But the fearful, and unbelieving, and the abominable, and murderers, and whoremongers, and sorcerers, and idolaters, and all liars, shall have their part in the lake which burneth with fire and brimstone: which is the second death.\r\n\r\n## A Place of ...\r\n\r\n| weeping, wailing\t\t| gnashing of teeth \t| torment \r\n| thirst \t\t\t\t| agony \t\t\t\t| unquenchable fire \r\n| follows death \t\t| memory \t\t\t\t| permanent, no escape \r\n| desire \t\t\t\t| eternal smoke \t\t|  no rest \r\n| Gehenna, trash heap\t| shut out of heaven\t| Suffocating Darkness (cp. Egypt)\r\n| | | \r\n| | | \r\n\r\n## False Doctrine\r\n\r\n### 1. Universalism\r\n\r\nAll IN THE END are saved. \"There is a hell, but its created fo the devil and angels only.\" \"Hell is there, possible no one will go there.\"\r\n\r\n### 2. Inclusivism\r\n\r\nSome will go to Hell, only those who have hear the Gospel and rejected, but those who have never heard the gospel will be saved ultimately.\r\n\r\n### 3. Annihilationism\r\n\r\n\"Consciousness extinguished.\" \"No longer exist.\"\" \"The Fire that consumes\" \"Soul Sleep\" \"feels fair\"\r\n\r\nUnbelievers will be obliterated, exterminated, DESTROYED.\r\n\r\n> Matthew 10:28 &mdash; And fear not them which kill the body, but are not able to kill the soul: but rather fear him which is able to DESTROY both soul and body in hell.\r\n\r\n**DESTROY**: apollumi\tSTRONGS#622\tto destroy, destroy utterly\r\n\t[an adjective sharing closely same meaening is Apollyon, Destroyer STRONGS#623, Rev. 9:11]\r\n\r\nMatthew 2:13\t- Herod desired to \"DESTROY\" the baby\r\nMatthew 8:25\t- disciples afriad of drowning, \"we PERISH\"\r\nLuke 15\t\t\t- LOST coin, son, lamb\r\nLuke 5:37\t\t- ruined wineskin \"bottles shall PERISH\"\r\nJohn 6:27\t\t- \"the meat which PERISHETH\"\r\nJohn 17:12\t\t- \"the son of PERDITION\"\r\nLuke 21:18\t\t- not an hair of your head PERISH.\r\nActs 8:20\t\t- to simeon \"your money PERISH with you\"\r\nMatthew 26:8\t- perfume spilled, \"To what purpose is this WASTE?\"\r\n\r\n\"Gehenna\" A Trash Heap, continual burning.\r\n\r\n\"the valley of the sons of Hinnom\", south of Jerusalem, where the idolatrous Jews offered their children in sacrifice to Molech ( 2 Chronicles 28:3 ; 33:6 ; Jeremiah 7:31 ; 19:2-6 ). This valley afterwards became the common receptacle for all the trash of the city. Here the dead bodies of animals and of criminals, and all kinds of filth, were cast and consumed by fire kept always burning. It thus in process of time became the image of the place of everlasting destruction.\r\n\r\nDestroyed in the sense of ruined for any useful purpose and not \"ANNILIHILATED\"\r\n\r\n\r\n## Verses\r\n\r\n> Deuteronomy 4:24 &mdash; For the LORD thy God is a consuming fire, even a jealous God.\r\n\r\n> Deuteronomy 32:2 &mdash; fire is kindled in my anger ... burn unto the lowest hell (Matthew 3:12 unquenchable fire)\r\n\r\n> 2 Samuel 22:6 &mdash; sorrows of Hell compassed me\r\n\r\n> Job 26:6 &mdash; hell is naked before Him\r\n\r\n> Psalm 9:17 &mdash; wicked turned into hell\r\n\r\n> Psalm 16:10 &mdash; not leave my soul in hell (Acts 2:27)\r\n\r\n> Psalm 139:8 &mdash; my bed in hell \r\n\r\n> Isaiah 30:33 &mdash; Tophet is ordained of old (brimstone)\r\n\r\n> Isaiah 66:24 &mdash; 24 ... their worm shall not die, neither shall their fire be quenched [Undying Worm and Unquenchable Fire ]\r\n\r\n> Jeremiah 4:4 &mdash; ... My wrath will go forth like fire And burn with none to quench it...\r\n\r\n> Ezekiel 32:27 &mdash; gone down to hell\r\n\r\n> Daniel 12:2 &mdash;  And many of them that sleep in the dust of the earth shall awake, some to everlasting life, and some to shame and everlasting contempt. [Everlasting Contempt]\r\n\r\n> Habakkuk 2:7 &mdash; enlargeth his desire \"as hell\" (cannot be satisfied)\r\n\r\n> Nahum 1:6 &mdash; ... Who can stand before his indignation? and who can abide in the fierceness of his anger? his fury is poured out like fire, and the rocks are thrown down by him.\r\n\r\n> Malachi 3:2 &mdash; But who may abide the day of his coming? and who shall stand when he appeareth? for he is like a refiner's fire, and like fullers' soap:\r\n\r\n> Matthew 5:22 &mdash; In Danger of Hell Fire (who is?) (Jesus is a hell fire preacher)\r\n\r\n> Matthew 5:29,30 &mdash; body cast into hell\r\n\r\n> Matthew 10:28 &mdash; destroy in Hell\r\n\r\n> Matthew 13:42 &mdash; And shall cast them into a furnace of fire: there shall be wailing and gnashing of teeth.\r\n\r\n> Matthew 18:8,9 &mdash; rather than having two hands or two feet to be cast into everlasting fire ... than having two eyes to be cast into hell fire.\r\n\r\n> Matthew 23:15 &mdash; two-fold sons of hell\r\n\r\n> Matthew 25:30 &mdash; outer darkness, weeping and gnashing of teeth\r\n\r\n> Matthew 25:41 &mdash; everlasting fire\r\n\r\n> Matthew 25:46 &mdash; And these shall go away into everlasting punishment: but the righteous into life eternal.\r\n\r\n> Matthew 26:24 &mdash; better not born b/c consequences\r\n\r\n> Mark 9:44 &mdash; Where their worm dieth not, and the fire is not quenched.\r\n\r\n> Luke 12:5 &mdash; power to cast into Hell\r\n\r\n> Luke 16:19-31 &mdash; in hell lift up his eyes\r\n\r\n> Acts 1:25 &mdash; ... Judas by transgression fell, that he might go to his own place.\r\n\r\n> 2 Thessalonians 1:9 &mdash; Who shall be punished with everlasting destruction from the presence of the Lord, and from the glory of his power;\r\n\r\n> 2 Peter 2:4 &mdash; angels that sinned...cast them down to hell ... chains of darkness, to be reserved unto judgment;\r\n\r\n> Jude 7 &mdash; ... the vengeance of eternal fire\r\n\r\n> Jude 13 &mdash; ... to whom is reserved the blackness of darkness for ever.\r\n\r\n> Revelation 2:11 not hurt of the second death\r\n\r\n> Revelation 6:8 &mdash; hell followeth pale horse (death)\r\n\r\n> Revelation 14:9-11 &mdash; punishment for those who wear the mark of the beast (others suggest this punishment is \"on earth\")\r\n\r\n> Revelation 19:20 The Beast, False Prophet -  ... were cast alive into a lake of fire burning with brimstone.\r\n\r\n> Revelation 20:10 The Devil -  ... was cast into the lake of fire and brimstone, where the beast and the false prophet are, and shall be tormented day and night for ever and ever.\r\n\r\n> Revelation 20:14 Death and Hell  ... were cast into the lake of fire. This is the second death. [1 Cor. 15:26]\r\n\r\n> Revelation 20:15 Whosoever not found in the Book of Life -  ... was cast into the lake of fire.\r\n\r\n> Revelation 21:8 &mdash; But the fearful, and unbelieving, and the abominable, and murderers, and whoremongers, and sorcerers, and idolaters, and all liars, shall have their part in the lake which burneth with fire and brimstone: which is the second death.\r\n\r\n## Thoughts\r\n\r\n- 79% of those who believe in God, believe in Hell; 11% believe only Heaven exists; Among those who do believe in heaven and hell, 82% expect to wind up in heaven; 2% expect to end up in hell\r\n\r\n- What did Jesus die to save us from? Hell (deliverance, rescue,saved)\r\n\r\n- What would be the proper consequence of sin? Many live as though there is no consequence for sin. No one is getting away with anything If not hell, what would be a just consequence?\r\n\r\n- treasurest up unto thyself wrath ... Romans 2:5\r\n\r\n- Sheol, Gehenna, Hell, Tophet\r\n\r\n- Necessity, Reality, Nearness, Nature of Hell\r\n\r\n- Don't be reluctant to discipline sin in our children. Teach them that sin has immense consequence.\r\n\r\n- A Child of Hell is one that is DESERVING of Hell (Judas: his own place, Acts 1:25)\r\n\r\n- Hell: conscious eternal punishment\r\n\r\n- Give Warning: Escape Hell! Luke 16:28"},"type":"READ_MD_FILE"}