{"id":1131,"courseId":"stephen-reynolds-jr-sermon-outlines","tasks":[],"title":"20180506 THE LORD OF GLORY","fileType":"md","value":{"path":"C:\\sites\\github\\courses\\stephen-reynolds-jr-sermon-outlines/20180506_the-lord-of-glory.md","raw":"# The Lord of Glory\r\n\r\n## Introduction\r\n\r\n> 1 Corinthians 2:1 &mdash; And I, brethren, when I came to you, came not with excellency of speech or of wisdom, declaring unto you the testimony of God. 2 For I determined not to know any thing among you, save Jesus Christ, and him crucified. 3 And I was with you in weakness, and in fear, and in much trembling. 4 And my speech and my preaching was not with enticing words of man's wisdom, but in demonstration of the Spirit and of power: 5 That your faith should not stand in the wisdom of men, but in the power of God. 6 Howbeit we speak wisdom among them that are perfect: yet not the wisdom of this world, nor of the princes of this world, that come to nought: 7 But we speak the wisdom of God in a mystery, even the hidden wisdom, which God ordained before the world unto our glory: 8 Which none of the princes of this world knew: for had they known it, they would not have crucified the Lord of glory.\r\n9 But as it is written, Eye hath not seen, nor ear heard, neither have entered into the heart of man, the things which God hath prepared for them that love him. 10 But God hath revealed them unto us by his Spirit: for the Spirit searcheth all things, yea, the deep things of God.\r\n11 For what man knoweth the things of a man, save the spirit of man which is in him? even so the things of God knoweth no man, but the Spirit of God. 12 Now we have received, not the spirit of the world, but the spirit which is of God; that we might know the things that are freely given to us of God. 13 Which things also we speak, not in the words which man's wisdom teacheth, but which the Holy Ghost teacheth; comparing spiritual things with spiritual. 14 But the natural man receiveth not the things of the Spirit of God: for they are foolishness unto him: neither can he know them, because they are spiritually discerned.\r\n15 But he that is spiritual judgeth all things, yet he himself is judged of no man.\r\n16 For who hath known the mind of the Lord, that he may instruct him? But we have the mind of Christ.\r\n\r\n- LORD \r\n\r\n\t- he has authority, or 'master'; rules; God\r\n\t- we call Jesus Lord when we obey them.\r\n\t- He will do what he has promised them. It is the covenant name of God. Yahweh or Jehovah\r\n\t- he is over all.\r\n\t- God's holiest name. he is always God. The Jews refused to speak this word aloud, in order to respect God. Elyon , YHWH , Yahweh , Adonai , Elohim .\r\n\r\n## A Personal Savior, v.2\r\n\r\n> 1 Corinthians 2:1,2 &mdash;  And I, brethren, when I came to you, came not with excellency of speech or of wisdom, declaring unto you the testimony of God. 2 For I determined not to know any thing among you, save Jesus Christ, and him crucified.\r\n\r\nThe foundation of Paul's preaching was not the miracles of Jesus or even the awesome doctrines taught by Christ, but the core of His message was JESUS CHRIST AND HIM CRUCIFIED. Christ is not first introduced as the \"PROBLEM SOLVER\" or \"RELIGIOUS TEACHER\", but as a \"PERSONAL SAVIOR\".\r\n\r\nChrist being firstly a personal Savior confronts EVERYONE with a Question. \"FOR YOU I DIED.\" \"What will you do with Jesus?\"\r\n\r\n> SONG: \"What will you do with Jesus? Will You laugh at Him? Will You Walk Away? Or Will you let Him In.\"\r\n\r\n===================\r\n- **LETTING HIM IN** \"Stop Asking Jesus Into Your Heart\" by J.D. Graeer\r\n\r\n> John 1:12  &mdash; But as many as received him, to them gave he power to become the sons of God, even to them that believe on his name:\r\n\r\n> Ephesians 3:17-19 &mdash; That Christ may dwell in your hearts by faith; that ye, being rooted and grounded in love, 18 May be able to comprehend with all saints what is the breadth, and length, and depth, and height; 19 And to know the love of Christ, which passeth knowledge, that ye might be filled with all the fulness of God.\r\n\r\n\"Letting Jesus In\" can be understood in part by considering **HOW HAVE WE KEPT HIM OUT?**\r\n\r\n\t**IT IS OUR SIN THAT HAS SEPARATED US FROM GOD**\r\n> Isaiah 59:2 &mdash; But your iniquities have separated between you and your God, and your sins have hid his face from you, that he will not hear.\r\n\r\n\t**Instead of seeking to follow His plan, they resisted everything unfamiliar ...**\r\n> Luke 13:34 &mdash; O Jerusalem, Jerusalem, which killest the prophets, and stonest them that are sent unto thee; how often would I have gathered thy children together, as a hen doth gather her brood under her wings, and ye would not!\r\n\r\n\t**Legalism is a Subsitute for God's Substitute**\r\n> Galatians 5:4 &mdash; Christ is become of no effect unto you, whosoever of you are justified by the law; ye are fallen from grace.\r\n\r\n- **BELIEVING ON THE LORD JESUS CHRIST**\r\n\r\n> Mark 16:16  &mdash; He that believeth and is baptized shall be saved; but he that believeth not shall be damned.\r\n\r\n> John 3:16  &mdash; For God so loved the world, that he gave his only begotten Son, that whosoever believeth in him should not perish, but have everlasting life.\r\n\r\n> Acts 16:30,31  &mdash; 30 And brought them out, and said, Sirs, what must I do to be saved? 31 And they said, Believe on the Lord Jesus Christ, and thou shalt be saved, and thy house.\r\n\r\n> Ephesians 2:8-9 &mdash; For by grace are ye saved through faith; and that not of yourselves: it is the gift of God: 9. Not of works, lest any man should boast.\r\n\r\n\t**It is something we MUST DO, but What Does it Mean to Believe on the Lord Jesus Christ?**\r\n\r\nSpiritual Life BEGINS and ENDS with Christ.\r\nConfess OUR SIN, OUR NEED OF A SAVIOR and THAT SAVIOR THE CRUCIFIED LORD JESUS CHRIST.\r\nTo Truly believe is to OBEY. \r\n\r\n> Luke 6:46 &mdash; And why call ye me, Lord, Lord, and do not the things which I say?\r\n\r\nThis is getting \"PERSONAL\".\r\n\r\n> Luke 9:23 &mdash; And he said to them all, If any man will come after me, let him deny himself, and take up his cross daily, and follow me.\r\n\r\n===================\r\n\r\n## The Foundation of Faith, v.5\r\n\r\n> 1 Corinthians 2:5 &mdash; That your faith should not stand in the wisdom of men, but in the power of God.\r\n\r\n\r\n\r\n## The Hidden Wisdom of God, v.8\r\n\r\n> 1 Corinthians 2:8 &mdash;  Which none of the princes of this world knew: for had they known it, they would not have crucified the Lord of glory.\r\n\r\n> John 6:44 &mdash; No man can come to me, except the Father which hath sent me draw him: and I will raise him up at the last day.\r\n\r\n- **Why Was Christ Such a Mystery to the Jews?**\r\n\r\n> 10 But God hath revealed them unto us by his Spirit: for the Spirit searcheth all things, yea, the deep things of God.\r\n\r\n- **He is Knowable**\r\n\r\nFreely Given, v. 12\r\n\r\n> 1 Corinthians 2:12 &mdash; Now we have received, not the spirit of the world, but the spirit which is of God; that **we might know** the things that are freely given to us of God.\r\n\r\n> 16 For who hath known the mind of the Lord, that he may instruct him? But we have the mind of Christ.\r\n\r\n## The Lord of Glory, v.8\r\n\r\nlike defining beauty\r\n\r\n- Our Glory\r\n\r\n > 7 But we speak the wisdom of God in a mystery, even the hidden wisdom, which God ordained before the world **unto our glory**:\r\n\r\n- The Glory of God\r\n\r\n\r\n## He Has More, If We Believe on Him and Him Crucified\r\n\r\n> 13 **Which things also we speak**, not in the words which man's wisdom teacheth, but which the Holy Ghost teacheth;\r\n\r\nHe has not only Died!\r\n\r\n- John 16:7 &mdash; Nevertheless I tell you the truth; It is expedient for you that I go away: for if I go not away, the Comforter will not come unto you; but if I depart, I will send him unto you.\r\n\r\n- John 14:2 &mdash; In my Father's house are many mansions: if it were not so, I would have told you. I go to prepare a place for you.\r\n\r\n"},"type":"READ_MD_FILE"}