{"id":1132,"courseId":"stephen-reynolds-jr-sermon-outlines","tasks":[],"title":"20180520 FOUNDATION","fileType":"md","value":{"path":"C:\\sites\\github\\courses\\stephen-reynolds-jr-sermon-outlines/20180520-foundation.md","raw":"# The Foundation is Laid - Build On It\r\n\r\n## Introduction\r\n\r\nWe must be aware of the importance of a solid foundation. It's right only when the foundation is right.\r\n\r\n> ILLUSTRATION: The tower of Pisa has been leaning so long -- around 845 years -- it's natural to assume it will defy gravity forever.\r\n\r\n> Pisa got its name in 600 BC from a Greek word meaning “marshy land.” Tower of Pisa stands at 185 feet and until 1990 was leaning at about a 10 degree angle and had been falling by a rate of about 1/16th of in per year. The famous structure has been in danger of collapsing almost since its first brick was laid. It began leaning shortly after construction began in **1173**. Builders had only reached the third of the tower's planned eight stories when its foundation began to settle unevenly on soft soil composed of mud, sand and clay. As a result, the structure leaned slightly to the north. Laborers tried to compensate by making the columns and arches of the third story on the sinking northern side slightly taller.\r\n\r\n> Corrections to the foundation beginning in the 1990's were completed June 2007 effectively straightening the tower by 18 inches which had been 15 feet off its vertical. \"If we had not stepped in the tower would have collapsed between 2030 and 2040,\" said Salvatore Settis, the president of the committee. \r\n\r\nWe must be sure we build on the foundation that is been laid by God.\r\n\r\n> 1 Cor. 3:1-23\r\n\r\n## Take Heed that We Build\r\n\r\n### Are Ye not Carnal? vs. 1-4\r\n\r\n> 1 Corinthians 3:1-4 &mdash; And I, brethren, could not speak unto you as unto spiritual, but as unto carnal, even as unto babes in Christ. 2 I have fed you with milk, and not with meat: for hitherto ye were not able to bear it, neither yet now are ye able. 3 For ye are yet carnal: for whereas there is among you envying, and strife, and divisions, are ye not carnal, and walk as men? 4 For while one saith, I am of Paul; and another, I am of Apollos; are ye not carnal?\r\n\r\n- Carnality and Spirituality are in direct conflict\r\n- envying, strife, and division are how men walk \"walk as men\" v.3\r\n- Divisions on the lines of personality are carnal. \"I am of Paul; ... I am of Apollos\".\r\n- Walking \"AS MEN\" produces a life built on UNFAITHFUL  and FALSE foundations.\r\n\r\n### Who Then is Paul and Apollos? vs.5-9a\r\n\r\n> 1 Corinthians 3:5-9a &mdash;  5 ¶ Who then is Paul, and who is Apollos, but ministers by whom ye believed, even as the Lord gave to every man? 6 I have planted, Apollos watered; but God gave the increase. 7 So then neither is he that planteth any thing, neither he that watereth; but God that giveth the increase. 8 Now he that planteth and he that watereth are one: and every man shall receive his own reward according to his own labour. 9 For we are labourers together with God:\r\n\r\n1. **MINISTERS** and not **LORDS** by whom you have believed. v.5\r\n\r\nMINISTER: to run on errands; an attendant, a waiter; specially, a Christian teacher and pastor; deacon, servant. \r\n\r\n2. We Planted and Watered BUT its God that gave the increase. vs. 5,6, 7\r\n\r\n> \"They gave it to you as God gave it to them\"\r\n\r\nSO ... are not \"anything\" but its God.\r\n\r\n3. Paul and Apollos are not in conflict with another. Yet schisms have developed around them as if they were. **IMMATURE** v.8,9\r\n\r\nWe are laborers together with God.\r\n\r\n### Other False Foundations\r\n\r\n- Denominational lines\r\n- Labels\r\n- Experience\r\n\r\n## Take Heed of the Foundation, vs. 9-11, 16-20\r\n\r\n> ye are God's husbandry, ye are God's building.\r\n 10 According to the grace of God which is given unto me, as a wise masterbuilder, I have laid the foundation, and another buildeth thereon. But let every man take heed how he buildeth thereupon. 11 ¶ For other foundation can no man lay than that is laid, which is Jesus Christ.\r\n\r\n> 16 ¶ Know ye not that ye are the temple of God, and that the Spirit of God dwelleth in you? 17 If any man defile the temple of God, him shall God destroy; for the temple of God is holy, which temple ye are. 18 ¶ Let no man deceive himself. If any man among you seemeth to be wise in this world, let him become a fool, that he may be wise. 19 For the wisdom of this world is foolishness with God. For it is written, He taketh the wise in their own craftiness. 20 And again, The Lord knoweth the thoughts of the wise, that they are vain. \r\n\r\n**How firm a foundation**, ye saints of the Lord,\r\nis laid for your faith in His excellent Word!\r\nWhat more can He say than to you He hath said,\r\nwho unto the Savior for refuge have fled?\r\n\r\nThe Lord's Throne is In Heaven - --- He is Still Watching ---\r\n\r\n- his eyes behold, try the children of men, The Lord trieth the righteous,\r\n\r\nBuild Your Life on the Word.\r\n\r\n- BUT the wicked 'his soul hateth'\r\n- The Righteous Lord loveth righteousness.\r\n\r\nGod is intensely aware of our faith and righteousness. Are we intensely aware that YES IT MATTERS TO GOD?\r\n\r\n## Take Heed of How We Build\r\n\r\n> \"let every man take heed how he buildeth thereupon\" v.10\r\n\r\n> \"When the time comes to die, make sure that all you have to do is die!\" ~Jim Elliot\" \r\n\r\n> 12 Now if any man build upon this foundation gold, silver, precious stones, wood, hay, stubble; 13 Every man's work shall be made manifest: for the day shall declare it, because it shall be revealed by fire; and the fire shall try every man's work of what sort it is. 14 If any man's work abide which he hath built thereupon, he shall receive a reward. 15 If any man's work shall be burned, he shall suffer loss: but he himself shall be saved; yet so as by fire. 16 ¶ Know ye not that ye are the temple of God, and that the Spirit of God dwelleth in you? 17 If any man defile the temple of God, him shall God destroy; for the temple of God is holy, which temple ye are. 18 ¶ Let no man deceive himself. If any man among you seemeth to be wise in this world, let him become a fool, that he may be wise. 19 For the wisdom of this world is foolishness with God. For it is written, He taketh the wise in their own craftiness. 20 And again, The Lord knoweth the thoughts of the wise, that they are vain. \r\n  \r\n- Take Heed What You Build With v.12 (gold, silver, precious stones, wood, hay, stubble)\r\n- Every Work Will Be Revealed, v.13 (revealed by fire \"what sort it is\")\r\n-  The Test Will be If It Survives the Fire of God's Holiness, v. 14\r\n\r\n> Psalms 119:133 &mdash; Order my steps in thy word: and let not any iniquity have dominion over me.\r\n\r\n- All that is not of Christ will be destroyed v.15\r\n\r\nForgiven but your invention will fail\r\n\r\n> Psalm 99:8 Thou answeredst them, O Lord our God: thou wast a God that forgavest them, though thou tookest vengeance of their inventions.\r\n\r\nWe should pray \"Take Vengeance on my inventions\"\r\n\r\nOur Works and Holiness of God ... FORGIVENESS AND RETRIBUTION\r\n\r\nVengeance : which divinely dogs all sin; God's Vengeance is not selfish retaliation (as man's will be) but is the just response to sin\r\n\r\nBrought to nought\r\n\r\nHow remarkable to consider these two acts laid side by side --- forgave & took vengeance\r\n\r\n## Conclusion\r\n\r\n > 21 ¶ Therefore let no man glory in men. For all things are yours; 22 Whether Paul, or Apollos, or Cephas, or the world, or life, or death, or things present, or things to come; all are yours; 23 And ye are Christ's; and Christ is God's."},"type":"READ_MD_FILE"}