{"id":1133,"courseId":"stephen-reynolds-jr-sermon-outlines","tasks":[],"title":"20180625 SECRETS OF THE HEART","fileType":"md","value":{"path":"C:\\sites\\github\\courses\\stephen-reynolds-jr-sermon-outlines/20180625_secrets-of-the-heart.md","raw":"- TAKE ADVANTAGE OF MOMENTUM OF YOUTH CAMP\r\n\r\n\r\n# Secrets of the Heart\r\n\r\n> Psalms 44:20,21 &mdash; If we have forgotten the name of our God, or stretched out our hands to a strange god; 21 Shall not God search this out? for He knoweth the secrets of the heart.\r\n\r\n## Introduction\r\n- My relationship with my parents\r\n- My dad has always been a kind man, but a very serious man, as well. \r\n- Very rigid and unmoving in his convictions\r\n- Since I can't go through it, I'd try to slide under the radar. - SECRET SIN\r\n\r\n## The Heart is Deceitful\r\n- \"FOLLOW YOUR HEART\"\r\n- What do I want what is forbidden by God?\r\n\r\n> Jeremiah 17:9 &mdash; The heart is deceitful above all things, and desperately wicked: who can know it?\r\n\r\n- Understanding why I want things different than from what I'm taught:\r\n- What I think I want, especially sin, becomes a curse to us.\r\n- The Night, UNDER DARKNESS, eph. 5:12 a shame to speak of things they do in secret\r\n- You don't really want a part of that filth\r\n\r\nMy uncle Danny running to violence in the park.\r\n\r\n## The Heart is a Secret Place\r\n\r\n- The heart is a private place. \r\n- It seems hidden away\r\n- So long as you hide from God, YOU'LL NEVER BE HAPPY\r\n\r\n## He is the Father that Sees in Secret (Matthew 6:4 & 18)\r\n\r\n- You can always talk to Jesus.\r\n- Daniel 2:47 &mdash; God is a REVEALER OF SECRETS\r\n- God will Judge the secrets of men\r\n- Mini TV under the blankets (sneaking) What are you doing?\r\n- Woman's CD in car and the girls at school (dad's dream)\r\n- Storage Hole in my Bedroom (sense of relief)\r\n\r\n> Mark 4:22 &mdash; For there is nothing hid, which shall not be manifested; neither was any thing kept secret, but that it should come abroad.\r\n\r\n## PRESCRIPTION: Confess\r\n\r\n1. Confess Our Sin\r\n\r\nJOSHUA TO ACHAN:\r\n\r\n> Joshua 7:19 &mdash; And Joshua said unto Achan, My son, give, I pray thee, glory to the LORD God of Israel, and make confession unto him; and tell me now what thou hast done; hide it not from me.\r\n\r\n- There is a POWER in confession\r\n\r\n- We have to take sides with God against OURSELF - \"GOD BE MERCIFUL TO ME, A SINNER\"\r\n- God understands your heart condition\r\n- Psalms 51:10 &mdash; Create in me a clean heart, O God; and renew a right spirit within me.\r\n\r\n2. Confess the Word\r\n\r\n> Romans 10:8 &mdash; But what saith it? The word is nigh thee, even in thy mouth, and in thy heart: that is, the word of faith, which we preach;\r\n\r\nJesus, YOU ARE LORD!"},"type":"READ_MD_FILE"}