{"id":1134,"courseId":"stephen-reynolds-jr-sermon-outlines","tasks":[],"title":"20180626 THE CONTRAST OF A LIFE OF FAITH","fileType":"md","value":{"path":"C:\\sites\\github\\courses\\stephen-reynolds-jr-sermon-outlines/20180626_the-contrast-of-a-life-of-faith.md","raw":"# The Life of Faith vs. the Life of Faithlessness\r\n\r\n> Romans 1:17 For therein is the righteousness of God revealed from faith to faith: as it is written, The just shall live by faith.\r\n\r\n## Introduction\r\n\r\n- So you are not convinced to dive in and give your life to Jesus?\r\n- Are you UNCOMMITTED to God? On the fence?\r\n- Have you considered what a life without Faith in God actually looks like?\r\n\r\nConstrasting the life of faith and a life without faith.\r\n\r\nWhat do you believe?\r\n- \"nothing.\"\r\n- \"i don't know\"\r\n\r\nLiving a religious life is not the same as living by FAITH.\r\n\r\n## What Does a Life Without Faith Look Like?\r\n\r\nLoren Eiseley:&hellip;\r\n\r\n\"Man is the Cosmic Orphan. He is the only creature in the universe who asks, \"Why?\" Other animals have instincts to guide them, but man has learned to ask questions. \"Who am I?\" man asks. \"Why am I here? Where am I going?\" Since the Enlightenment, when **he threw off the shackles of religion**, man has tried to answer these questions without reference to God. But **the answers that came back were not exhilarating, but dark and terrible**. \r\n\r\n- \"You are the accidental by-product of nature, a result of matter plus time plus chance. \r\n- There is no reason for your existence. \r\n- All you face is death.\"\r\n\r\nLife without God, that is Faith in God, leads only to a grave. (wicked and good alike)\r\n\r\n> DEFINITION \"absurd\": wildly unreasonable, illogical, or inappropriate, preposterous.\r\n\r\nLife without Faith in God, concludes with death. No matter what happens in the mean time, eventually you will cease to exist.\r\n\r\nWe are prisoners who await our execution. \r\nHaving no higher purpose, significance or value.\r\n\r\nAdvances in sciences like medicine&hellip;no permanent value because the universe is DOOMED. Life is absurd. We work and sacrifice to accomplish things that will not deter the outcome -- and ever expanding universe that will eventually just cease to exist with no memory or proof it had ever existed.\r\n\r\nA life without faith in God, cannot meaningfully answer our greatest questions: Why Am I here? What is the Meaning and purpose of my life? AT best we can agree to a level of \"SELF DELUSION\"&hellip;let's PRETEND it all has meaning (evening though we know it doesn't) and fool ourselves.\r\n\r\n> \"in killing God, man has also killed himself\"\r\n\r\nSin is a hard taskmaster!\r\n\r\n\r\n\r\n## What Does the Life of Faith Look Like?\r\n\r\nBiblical Christianity therefore provides the two conditions necessary for a meaningful, valuable, and purposeful life for man: God and immortality. Because of this, we can live consistently and happily.\r\n\r\nHebrews 11:\r\n\r\n1. v.4 Abel offered a more excellent sacrifice\r\n\r\n**The favor of God is what gives any WORK permanent value.**\r\n\r\n2. v.5 Enoch was translated\r\n\r\n**How horrible the world is&hellip; Enoch escaped it even bypassing the grave by faith.**\r\n\r\n3. v.7 Noah Prepared an Ark and Became heir of Righteousness\r\n\r\n**In the face of bad NEWS, there's always a PLAN and therefor a DESIGNER.**\r\n\r\n> **Romans 8:28** And we know that all things work together for good to them that love God, to them who are the called according to his purpose.\r\n\r\n4. v.8 Abraham journeyed not knowing where to\r\n\r\nBy faith we access to an eternal strength to move forward even into the unknown with CONFIDENCE.\r\n\r\n**ILLUSTRATION POEM:**\r\n\r\nEach anxious, puzzled \"Why?\" \r\nFrom doubt or dread that grows, \r\nFinds answer in this thought; \r\nI know not, but He knows.\r\n\r\nby Annie Johnson Flint\r\n\r\n5. v.9 Abraham sojourned in the Land of Promise\r\n6. v.17 Abraham offered Isaac\r\n7. v.20 Isaac Blessed Jacob and Isaac Prophetically\r\n8. v.21 Jacob Blessed both sons of Joseph\r\n9. v.22 Joseph gave commandment concerning his bones (God will bring us out someday)\r\n10. v.23 Moses was hid three months\r\n11. v.24 Moses refused to be called the son of Pharaoh's daughter\r\n12. v.27 Moses forsook Egypt\r\n13. v.29 Israel passed through the Red Sea\r\n14. v.30 Walls of Jericho Fell\r\n15. v.31 Rahab perished not\r\n\r\n## Faith Word Study\r\n\r\n### Pistis\r\n\r\nFaith (4102/pistis) is always received from God, and never generated by us.\r\n\r\nRo 12:3: \"For through the grace given to me I say to everyone among you not to think more highly of himself than he ought to think; but to think so as to have sound judgment, as God has allotted to each a measure of faith (4102/pistis)\r\n\r\nA.\t#1: A Personal Belief, Mental Acceptance & Acknowledgement Of God's Existence:\r\nB.\t#2: A conduct or work inspired by the compete surrender to mental acceptance:\r\nC.\t#3: A trusting or trustworthiness: (pistis)\r\nD.\t#4: The System Of Doctrine And Morality Peculiar To Christianity:\r\n\r\n## Phrases\r\n\r\n### emuwn - h0525 (5 verses)\r\n\r\n\"&hellip; in Whom is no faith &hellip;\" Deuteronomy 32:20\r\n\"&hellip; but a faithful ambassador is health &hellip;\" Proverbs 13:17\r\n\"&hellip; a faithful witness &hellip;\" Proverbs 14:5\r\n\"&hellip; a faithful man&hellip;\" Proverbs 20:6\r\n\"&hellip; which keepeth the truth may enter in &hellip;\" Isaiah 26:2\r\n\r\n### emuwnah - H0530 (49 verses)\r\n\r\n\"&hellip; his hands were steady &hellip;\" Exodus 17:12\r\n\"&hellip; God of truth and without iniquity &hellip;\" Deuteronomy 32:4 \r\n\"&hellip; his faithfulness and his righteousness &hellip;\" 1 Samuel 26:23 \r\n\"&hellip; they dealt faithfully &hellip;\" 2 Kings 12:15\r\n\"&hellip; ordain in their set office &hellip;\" 1 Chronicles 9:22\r\n\"&hellip; his works are done in truth &hellip;\" Psalm 33:4\r\n\"&hellip; just shall live by his faith &hellip;\" [H0530] Habakkuk 2:4\r\n\r\n<!--\r\nResources:\r\n\r\n- http://biblehub.com/greek/4102.htm\r\n\r\n-->\r\n\r\n-------------------\r\n\r\nAdd to your faith\r\n2Pe 1:5 And beside this, giving all diligence, add to your faith virtue; and to virtue knowledge;\r\n\r\nWork of Faith\r\n\r\nPower of Faith\r\n\r\n\r\n\r\n\r\n\r\n## What Does the Life of Faith Look Like?\r\n\r\nActs 15:9 \"purifying their hearts by faith\"\r\nActs 26:18 \"sanctified by faith\"\r\nRomans 1:17 \"live by faith\" (Gal. 3:11; Heb. 10:38)\r\nRomans 3:22 \"the righteousness of God which is by faith\" (Phil. 3:9)\r\nRomans 3:28 \"justified by faith\" (Romans 3:30; 5:1; Gal. 3:24)\r\nRomans 5:2 \"access (to God) by faith\"\r\nRomans 11:20 \"thou standest by faith\" (2 Cor. 1:24)\r\n2 Corinthians 5:7 \"we walk by faith\"\r\nGalatians 3:26 \"are the children of God by faith\"\r\nGalatians 5:5 \"wait for the hope of righteousness by faith\"\r\nEphesians 3:17 \"christ may dwell in your hearts by faith\"\r\nHebrews 4:2 united by faith\r\n\r\nefkcb8ee8f8ydd"},"type":"READ_MD_FILE"}