{"id":1138,"courseId":"stephen-reynolds-jr-sermon-outlines","tasks":[],"title":"20180812 ZECH 4 SUNDAY SCHOOL","fileType":"md","value":{"path":"C:\\sites\\github\\courses\\stephen-reynolds-jr-sermon-outlines/20180812_zech-4 sunday school.md","raw":"<style>body {max-width:700px;} h2 {color:red;}</style>\r\n\r\n# Understanding How God Works\r\n\r\nCry, Grace, Grace Unto it, v. 7\r\n\r\nTEXT: Zechariah 4:1-14\r\n\r\n## Introduction\r\n\r\n> Zechariah 4:1-14 &mdash; 1 And the angel that talked with me came again, and waked me, as a man that is wakened out of his sleep. 2 And said unto me, What seest thou? And I said, I have looked, and behold a candlestick all of gold, with a bowl upon the top of it, and his seven lamps thereon, and seven pipes to the seven lamps, which are upon the top thereof: 3 And two olive trees by it, one upon the right side of the bowl, and the other upon the left side thereof. \r\n\r\n> 4 So I answered and spake to the angel that talked with me, saying, What are these, my lord? 5 Then the angel that talked with me answered and said unto me, Knowest thou not what these be? And I said, No, my lord. 6 Then he answered and spake unto me, saying, This is the word of the LORD unto Zerubbabel, saying, Not by might, nor by power, but by my spirit, saith the LORD of hosts. 7 Who art thou, O great mountain? before Zerubbabel thou shalt become a plain: and he shall bring forth the headstone thereof with shoutings, crying, Grace, grace unto it. 8 Moreover the word of the LORD came unto me, saying, 9 The hands of Zerubbabel have laid the foundation of this house; his hands shall also finish it; and thou shalt know that the LORD of hosts hath sent me unto you. 10 For who hath despised the day of small things? for they shall rejoice, and shall see the plummet in the hand of Zerubbabel with those seven; they are the eyes of the LORD, which run to and fro through the whole earth. 11 Then answered I, and said unto him, What are these two olive trees upon the right side of the candlestick and upon the left side thereof? 12 And I answered again, and said unto him, What be these two olive branches which through the two golden pipes empty the golden oil out of themselves? 13 And he answered me and said, Knowest thou not what these be? And I said, No, my lord. 14 Then said he, These are the two anointed ones, that stand by the LORD of the whole earth.\r\n\r\nThis vision of the Golden Lampstand, Golden Bowl and the two Trees is a picture of God's designed method of working through and in his people. The vision is declaring \"\"how the work of God is to be done.\"\r\n\r\n- What we don't understand of the Scripture, gets us asking the right questions.\r\n- \"please don't be like the world\"\r\n- Understanding How God Works\r\n\r\n## 1. \"As a man wakened out of his sleep\", v.1\r\n\r\n- The 70 years of babylonion Capitivity is over. \r\n- Decree has been signed by Persian King\r\n- First group of about 50,000 made trip to Jerusalem.\r\n- Ezra received money and temple objects taken away by the Babylonions.\r\n- Started to rebuild the temple and those in the area having settled in the last 70 years began to conflict.\r\n- The temple was just a huge mountain of rumble.\r\n- The people began to get discouraged with the effort and turned their efforts to restoring their own homes and vineyards and farms.\r\n- In the beginning the did have joy and excitement\r\n- But task seemed insurmountable and the were discouraged\r\n\r\n- Haggai comes by and prophesies to get back to the work.\r\n- He points out their failed crops as being the result of having their priorities messed up.\r\n- You have put yourselves first and God Second.\r\n- Lets get back and rebuild the temple.\r\n- Zurrubabel then is a part of this continuation of the rebuilding of the temple.\r\n\r\n- The mountain of rubble is still there.\r\n- God gives this vision to Zechariah in chapter 4.\r\n\r\n## 2.  \"What seest thou? v.2-5\r\n\r\n- a candlestick all of gold, \r\n- with a bowl upon the top of it, \r\n- and his seven lamps thereon, \r\n- and seven pipes to the seven lamps, which are upon the top thereof: \r\n- 3 And two olive trees by it, one upon the right side of the bowl, and the other upon the left side thereof. \r\n\r\nOn the left side and right side stood two OLIVE TREES from which flowed OIL into the GOLDEN BOWL upon a GOLDEN CANDELSTICK. Upon the GOLDEN CANDELSTICK also were SEVEN LAMPS from each lamp to the GOLDEN BOWL a pipe (seven in total)\r\n\r\n- Should Zerrubabel have known? (\"Knowest thou not what these be?\") He is answers, \"No, my lord.\"\r\n\r\n> 4 So I answered and spake to the angel that talked with me, saying, What are these, my lord? 5 Then the angel that talked with me answered and said unto me, Knowest thou not what these be? And I said, No, my lord.\r\n\r\n## 3. \"This is the word of the LORD unto Zerubbabel\" v.6-10\r\n\r\n > 6 Then he answered and spake unto me, saying, This is the word of the LORD unto Zerubbabel, saying, Not by might, nor by power, but by my spirit, saith the LORD of hosts. \r\n\r\n- Not exactly the answer Zechariah is asking for as there is much to this vision that is not explained in full until under the New Testament covenant.\r\n\r\n-  7 Who art thou, O great mountain? before Zerubbabel thou shalt become a plain: \r\n\r\n- and he shall bring forth the headstone thereof \r\n\r\n- with shoutings, crying, Grace, grace unto it. \r\n\r\n**GRACE, GRACE unto it!** (AS it is NOT by might!)\r\nWe prepare for the rain, but only God can send it!\r\n\r\n> 8 Moreover the word of the LORD came unto me, saying, 9 The hands of Zerubbabel have laid the foundation of this house; his hands shall also finish it; and thou shalt know that the LORD of hosts hath sent me unto you. 10 For who hath despised the day of small things? for they shall rejoice, and shall see the plummet in the hand of Zerubbabel with those seven; they are the eyes of the LORD, which run to and fro through the whole earth.\r\n\r\nFOUNDATION laid will be finished ... **Phil. 1:6-8** ..he they has begun a good work in you will finish it\r\n\r\n- The eyes of the Lord\r\n\r\nEyes of the Lord ... To asa the king ... A fuller quote ... Don't you know the eyes of the Lord go to and fro ... ---> to show himself strong on behalf this ehise heard are perfect towards him ...whose heart despite the failures past are set on God's ideal\r\nHaving d having discovered that we can't do it is a good thing because it's not by might that's the first part of the lesson the second part of the lesson and still are and that it's by the spirit\r\n\r\n- The Lord saw it BEFORE it happened\r\n- Zurrababel by faith sees it BEFORE it happened\r\n- IF Zurrabel does, then others will rejoice in seeing the plummet in his hand\r\n\r\n[plummet: a plumb line]\r\n\r\n## 4. The Two Anointed Ones, vs. 11-14\r\n\r\n> 11 Then answered I, and said unto him, What are these two olive trees upon the right side of the candlestick and upon the left side thereof? 12 And I answered again, and said unto him, What be these two olive branches which through the two golden pipes empty the golden oil out of themselves? 13 And he answered me and said, Knowest thou not what these be? And I said, No, my lord. 14 Then said he, These are the two anointed ones, that stand by the LORD of the whole earth.\r\n\r\n### A. Immediate Interpration\r\n\r\n- Joshua the high priest and Zerrubabel the governor ...??? Ecclesiastic all and civil\r\n- Zerubbabel the civil ruler, must first be anointed with grace themselves, so as to be the instruments of furnishing it to others \r\n\r\n### B. Far Off Interpretation\r\n\r\n- Two Witnesses  in Revelation\r\n\r\n> Revelation 11:3,4 &mdash; And I will give power unto my two witnesses, and they shall prophesy a thousand two hundred and threescore days, clothed in sackcloth. 4 These are the two olive trees, and the two candlesticks standing before the God of the earth.\r\n\r\n### C. Ultimate Interpretation\r\n\r\nThe vision is declaring \"\"how the work of God is to be done.\"\r\n\r\n#### The Gold\r\n\r\nIsaiah 13:12 more precious than goldI will make a man more precious than fine gold; even a man than the golden wedge of Ophir.\r\nPure gold is scarce\r\n\r\n#### Two Olive Trees\r\n- If the trees are the son and the Spirit what is the bowl? The word???\r\n- The Source of the OIL?\r\n- The Spirit and the Son = the bowl the WORD = Both OLd and NEw Teastment\r\n\r\n> 1 John 5:7 &mdash; For there are three that bear record in heaven, the Father, the Word, and the Holy Ghost: and these three are one.\r\n\r\n\r\nPsalm 119:105 thy word\r\n\r\nThis oil is anointing oil, call, position, authority, emissary, representative, holy ghost,\r\n\r\nthe message is \"by my spirit\" therefore the oil is the holy Ghost. As the primary message is the ministry of the holy ghost. **THE OIL**\r\n\r\n#### Golden Candlesticks\r\n\r\nRevelation 1:13; Revelation 2:1, and, it is said, “the seven candlesticks are the seven Churches\r\nMatthew 5:14-15, compare Philemon 2:15). Cyril: “The golde\r\n\r\nPurpose of a lamp? Bring light to the world. In ot it was ... You are theIsrael in nt it is the church\r\nYou are the light of the world\r\n\r\nMissionaries more interested in bringing a western culture to the heathen than a revival by the spirit of God\r\n\r\n> 1 John 2:20 &mdash; But ye have an unction from the Holy One, and ye know all things.\r\n> 1 John 2:27 &mdash;  But the anointing which ye have received of him abideth in you, and ye need not that any man teach you: but as the same anointing teacheth you of all things, and is truth, and is no lie, and even as it hath taught you, ye shall abide in him.\r\n\r\n- Where do we get it?\r\n\r\nThe PIPES\r\n\r\n## The Flow - Worldliness\r\n\r\nEccl\r\n\r\nGambling -cards -\r\nSwimming separate from girls\r\nShirts\r\nLanguage\r\n\"Dangerously specific\"\r\n\r\n\r\n> I John 2:15-17 1Jo 2:15 Love not the world, neither the things that are in the world. If any man love the world, the love of the Father is not in him.\r\n 16 For all that is in the world, the lust of the flesh, and the lust of the eyes, and the pride of life, is not of the Father, but is of the world.\r\n 17 And the world passeth away, and the lust thereof: but he that doeth the will of God abideth for ever.\r\n\r\n> Jude 23 And others save with fear, pulling them out of the fire; hating even the garment spotted by the flesh."},"type":"READ_MD_FILE"}