{"id":1140,"courseId":"stephen-reynolds-jr-sermon-outlines","tasks":[],"title":"20181007 ADULT BIBLE CLASS","fileType":"md","value":{"path":"C:\\sites\\github\\courses\\stephen-reynolds-jr-sermon-outlines/20181007_adult-bible-class.md","raw":"<style>h2 {color: red; font-weight: bold;} body {max-width: 800px;}</style>\r\n\r\n# Gospel Memorials\r\n\r\nTEXT: Joshua 4:6-7 \r\n\r\n- What Mean Ye By These Stones?\r\n\r\n> Joshua 4:6-7 &mdash; That this may be a sign among you, that when your children ask their fathers in time to come, saying, What mean ye by these stones? Then ye shall answer them, That the waters of Jordan were cut off before the ark of the covenant of the Lord ; when it passed over Jordan, the waters of Jordan were cut off: and these stones shall be for a memorial unto the children of Israel for ever.\r\n\r\n## Introduction\r\n\r\n- The Human Memory\r\n\r\nHuman memory is not as simple and direct a design and formerly thought. Memory is now understood to be the calculated sum of all the impressions in every area of our brains.\r\n\r\nWhen God designed the memory function in our brains, he created two complementary processes:\r\n\r\n1. The first process was learning something new\r\n2. The second was later on recalling the experience.\r\n\r\nYou cannot remember something you have not EXPERIENCED.\r\n\r\n- Memorials\r\n\r\nMemorials help us communicate the experiences of one generation to the next. They are a \"pile of stones in a river bread\" needing both:\r\n\r\n\t- 1. Someone with an experience to leave a mark and able to give the meaning.\r\n\t- 2. Somemone to see the pile of rocks and earnest enough to ask \"What mean ye by these stones?\".\r\n\r\n- The Dangers of a Pastless Church (A church Where EVERYTHING is \"new\")\r\n\r\n\t- Does not have the foundation of things PROVEN.\r\n\t- Does not have the direction of things LEARNED.\r\n\t- Does not have the humility needed of things TESTED.\r\n\r\n> Proverbs 22:28 &mdash; Remove not the ancient landmark, which thy fathers have set.\r\n\r\n## Memorials in Scripture\r\n\r\nAs we look at a few memorials left to us in Scripture, consider: \r\n\t- A Memorial Left\r\n\t- A Memorial Kept\r\n\t- A Memorial Explained\r\n\r\n### A. The Lord’s Supper\r\n\r\n> Luke 22:19-20 &mdash; And he took bread, and gave thanks, and brake it, and gave unto them, saying, This is my body which is given for you: this do in remembrance of me. 20 Likewise also the cup after supper, saying, This cup is the new testament in my blood, which is shed for you.\r\n\r\n### B. The Rainbow\r\n\r\n> Genesis 9:12-17 &mdash; And God said, This is the token of the covenant which I make between me and you and every living creature that is with you, for perpetual generations: 13 I do set my bow in the cloud, and it shall be for a token of a covenant between me and the earth. 14 And it shall come to pass, when I bring a cloud over the earth, that the bow shall be seen in the cloud: 15 And I will remember my covenant, which is between me and you and every living creature of all flesh; and the waters shall no more become a flood to destroy all flesh. 16 And the bow shall be in the cloud; and I will look upon it, that I may remember the everlasting covenant between God and every living creature of all flesh that is upon the earth. 17 And God said unto Noah, This is the token of the covenant, which I have established between me and all flesh that is upon the earth.\r\n\r\n### C. The Passover\r\n\r\n> Exodus 12:11-14 &mdash; \r\n\r\n#### 1. God’s separation of His people from the Gentiles.\r\n#### 2. God’s protection of His people.\r\n#### 3. God’s deliverance of His people.\r\n#### 4. God’s requirements of His people.\r\n#### 5. God’s commandment to them to keep the feast annually to remind them of all God had done for them.\r\n\r\nThe Passover pointed towards another memorial. \r\n\r\n### D. Feast of the Tabernacles\r\n\r\n> Leviticus 23:39-43 &mdash; \r\n\r\nThe Feast of the Tabernacles fell in the Autumn when the full harvest of corn, wine and oil had been gathered in. It was the last great feast of the year. It was a time of rejoicing and thanksgiving when Israel showed their gratitude to God and remembered that He had delivered them from Egyptian bondage and brought them into a land which produced so many good things. It came five days after the Day of Atonement when the sin of the people had been removed.\r\n\r\nDuring the seven days of the feast Israel dwelt in booths or tents made from the boughs of trees. It would remind them of the 40 years in the wilderness when they dwelt in tents.\r\n\r\nThe feast pointed forward to the FULL harvest and the COMPLETE result of Christ’s work.\r\n\r\n### E. Brass Censer Beaten into a Cover for the Altar\r\n\r\nNumbers 16:36-40 is given after the rebellion of Korah, Dathan and Abiram. Israel had been condemned to spend 40 years in the wilderness. During this time the unrest mounted, and the disappointment of the people at not being able to enter the Promised Land, became a ground for rebellion to develop.\r\n\r\nIn rebellion against the priesthood ordainend by God, Korah with Dathan and Abiram of the tribe of Reuben and 250 princes rose up against Moses and Aaron and accused them of taking too much upon themselves. Korah, with the 250 princes, came as directed to the Tabernacle carrying censers having fire in them. Dathan and Abiram with their families stood at their tents. God sent fire and an earthquake that completely destroyed the arch rebels and their followers.\r\n\r\n> Numbers 16:36-40 &mdash; 36 And the LORD spake unto Moses, saying, 37 Speak unto Eleazar the son of Aaron the priest, that he take up the censers out of the burning, and scatter thou the fire yonder; for they are hallowed. 38 The censers of these sinners against their own souls, let them make them broad plates for a covering of the altar: for they offered them before the LORD, therefore they are hallowed: and they shall be a sign unto the children of Israel. 39 And Eleazar the priest took the brazen censers, wherewith they that were burnt had offered; and they were made broad plates for a covering of the altar: 40 To be a memorial unto the children of Israel, that no stranger, which is not of the seed of Aaron, come near to offer incense before the LORD; that he be not as Korah, and as his company: as the LORD said to him by the hand of Moses.\r\n\r\n### F. Some Other Memorials:\r\n\r\n1. 12 stones from the Jordan River\r\n\r\nIn Joshua 4:6-7, These twelve stones were set up at Gilgal as a memorial to future generations to teach them that God had dried up the waters of the Jordan, as He had the Red Sea, for His people. Later in Joshua 4,  we read of a second memorial of 12 stones being set up in the midst of the river where the priests had stood. These memorials were a witness and a lasting testimony to the fact that they were God’s people who should fear the Lord forever. These passed through the waters.\r\n\r\n2. The Sabbath day, Deut. 5:15\r\n3. Manna in the Ark of the Covenant, Exodus 16:31-33\r\n4. The Feast of Purim, Esther 9:28\r\n5. The Anointing of Jesus head by Mary, Matthew 26:6-13\r\n\r\n> Matthew 26:13 &mdash; Verily I say unto you, Wheresoever this gospel shall be preached in the whole world, there shall also this, that this woman hath done, be told for a memorial of her.\r\n\r\n## Some Modern Memorials Left To Us\r\n\r\n1. Our Hymnals\r\n\r\n2. Structures\r\n\r\n3. Biographies of Men and Women of Faith\r\n\r\n## What Memorials are we Leaving?\r\n\r\n1. Do we keep the Memorials of the Gospel Left to us?\r\n\r\n2. Are we leaving Memorials to the Gospel?\r\n\r\n- What will be remembered? What Should be rememberred?\r\n- What are we passing on to the next generation?\r\n- Is the love for the gospel being communicated? Is saying it, the same as communicating it?\r\n- So much is lost in the translation.\r\n\r\n- How we conduct ourselves in Home, Community and Church\r\n- Our LOVE for one another\r\n- Our selfless and sacrificial acts of devotion to Christ\r\n\r\n3. Are we ready to explain?\r\n\r\n- It's more than just a river rock.\r\n- Will they ever ask, what does this mean, again? Memorials when symbolism is ridiculed. \"Enlightened\" now.\r\n\r\n> ... What mean ye by these stones?\r\n\r\nHow Ready Are We to Leave and Explain:\r\n\t- True Worship\r\n\t- True Anointing\r\n\t- Walking in the Spirit\r\n\t- Gifts of the Spirit\r\n\r\n"},"type":"READ_MD_FILE"}