{"id":1141,"courseId":"stephen-reynolds-jr-sermon-outlines","tasks":[],"title":"20181118 ABC THANKSGIVING","fileType":"md","value":{"path":"C:\\sites\\github\\courses\\stephen-reynolds-jr-sermon-outlines/20181118_abc_thanksgiving.md","raw":"# Ecclesiastes Reminds us to Fulfill Our Duty of Gratefulness\r\n\r\nTEXT: Ecclesiastes\r\n\r\n## Introduction\r\n\r\n### 1. Duty?\r\n\r\nIt is Our Duty to Give Thanks, and Therefore It is Our Duty to Appreciate All God's Benefits!\r\n\r\nAmong the Duties of a Levite Were To **To stand every morning and evening to thank and praise the LORD**.\r\n\r\nSingers (Nehemiah 12:43-46; Psalm 92:4; Psalm 96:1,2; 1 Chronicles 23:24-32:David's Last Input on Temple Worship).\r\nHas made me glad!\r\n\r\nZeal for the Things of God (**LEAD TO TRUE WORSHIP**)This is My Joy! (Psalm 84:10)\r\n\r\nIn dedication to God, Beginning of Something, Even the end of Something, We ought to be zealous to Give God thanks.\r\n\r\n### 2. Grateful?\r\n\r\n- (M-W Dictionary) appreciative of benefits received; expressing gratitude; grateful thanks\r\n\r\nIn order to genuinely express \"thanks\" for something, we need to be able to SEE/APPRECIATE its BENEFIT (an advantage or profit gained from something.).\r\n\r\n### 3. Ecclesiastes?\r\n\r\nOther than the fact we have been studying the book of Ecclesiastes for weeks, what can we find to be grateful for in reading a book famous for, \"Vanity of vanities, saith the Preacher, vanity of vanities; all is vanity.\" (Ecclesiastes 1:2)?\r\n\r\nWhat BENEFITS do we find directly and indirectly expressed in its lines?\r\n\r\n## (1:14) Grateful God has Allowed us to See the Vanity.\r\n\r\n- all is vanity, endless cycles (worthless)\r\n\r\n> Ecclesiastes 1:14 &mdash; I have seen all the works that are done under the sun; and, behold, all is vanity and vexation of spirit.\r\n\r\nPilgrim's progress Vanity Fair:\r\n\r\n> Vanity Fair is the setting for one of the longest stops on Christian's journey, the place where Faithful is martyred, and is one of Beelzebub's special real estate holdings. Bunyan's describes the allure of the place with it's glamour, glitz, fashion, and power, and **everything is buyable**. \r\n\r\n> The people of Vanity Fair think Christian and Faithful are completely insane, calling them \"bedlams\" (Bedlam was the name of a notorious insane asylum). The pilgrims' clothing and speech make them really stick out in Vanity Fair. \r\n\r\n> \"Here is the Britain Row, the French Row, the Italian Row, the Spanish Row, the German Row, where several sorts of vanities are to be sold\". Bunyan also talks about the \"the ware of Rome\" with the Roman Catholic church being described as just as \"vain\" and greedy as any power-hungry nation. \r\n\r\n> The opposition of Vanity Fair and the pilgrims is dramatized in the trial of Faithful and Christian. To Lord Hategood, Faithful owns up to the accusations brought against him. Like the Gospel accounts of Jesus's own trial and crucifixion, Faithful makes no attempt to justify himself and keeps his calm.\r\n\r\n> (QUOTE) They therefore brought him out, to do with him according to their law; and first they scourged him, then they buffeted him, then they lanced his flesh with knives; after that, they stoned him with stones, then pricked him with their swords; and last of all, they burned him to ashes at the stake. Thus came Faithful to his end. Now I saw, that there stood behind the multitude a chariot and a couple of horses waiting for Faithful, who (so soon as his adversaries had dispatched him) was taken up into it, and straightway was carried up through the clouds with sound of trumpet, the nearest way to the celestial gate.\r\n\r\n> This final moment underlines the vanity of Vanity Fair, literally demonstrating that there is a very real life after death that outlasts all the money, pleasure, and power of all the Vanity Fair merchants combined.\r\n\r\n## (2:24-26) Grateful for joy in our labor. (versus the travail of the sinner)\r\n\r\n> Ecclesiastes 2:24-26 &mdash; There is nothing better for a man, than that he should eat and drink, and that he should make his soul enjoy good in his labour. This also I saw, that it was from the hand of God. 25 For who can eat, or who else can hasten hereunto, more than I? 26 For God giveth to a man that is good in his sight wisdom, and knowledge, and joy: but to the sinner he giveth travail, to gather and to heap up, that he may give to him that is good before God. This also is vanity and vexation of spirit.\r\n\r\n- Enjoy seeing a job done, and done well.\r\n\r\n## (3:14) Grateful that what God does is forever!\r\n\r\n> Ecclesiastes 3:14 &mdash; I know that, whatsoever God doeth, it shall be for ever: nothing can be put to it, nor any thing taken from it: and God doeth it, that men should fear before him.\r\n\r\n## (4:7-12) Grateful for companionship.\r\n\r\n> Ecclesiastes 4:7-12 &mdash; Then I returned, and I saw vanity under the sun. 8 There is one alone, and there is not a second; yea, he hath neither child nor brother: yet is there no end of all his labour; neither is his eye satisfied with riches; neither saith he, For whom do I labour, and bereave my soul of good? This is also vanity, yea, it is a sore travail. 9 Two are better than one; because they have a good reward for their labour. 10 For if they fall, the one will lift up his fellow: but woe to him that is alone when he falleth; for he hath not another to help him up. 11 Again, if two lie together, then they have heat: but how can one be warm alone? 12 And if one prevail against him, two shall withstand him; and a threefold cord is not quickly broken.\r\n\r\n## (5) Grateful for a Sincere and Tender Heart Toward God.\r\n\r\n> Ecclesiastes 5:1,4 &mdash; Keep thy foot when thou goest to the house of God, and be more ready to hear, than to give the sacrifice of fools: for they consider not that they do evil. 4 When thou vowest a vow unto God, defer not to pay it; for he hath no pleasure in fools: pay that which thou hast vowed.\r\n\r\n## (6:1,2) Grateful God Enables us to Enjoy His Blessings!\r\n\r\n> Ecclesiastes 6:1,2 &mdash; There is an evil which I have seen under the sun, and it is common among men: 2 A man to whom God hath given riches, wealth, and honour, so that he wanteth nothing for his soul of all that he desireth, yet God giveth him not power to eat thereof, but a stranger eateth it: this is vanity, and it is an evil disease.\r\n\r\n## (7:14) Grateful for God's Ways, in both prosperity and adversity. \r\n\r\n> Ecclesiastes 7:14 In the day of prosperity be joyful, but in the day of adversity consider: God also hath set the one over against the other, to the end that man should find nothing after him.\r\n\r\n## (8:2) Grateful for a Submitted Disposition toward God's Authority.\r\n\r\n> Ecclesiastes 8:2 &mdash; I counsel thee to keep the king's commandment, and that in regard of the oath of God.\r\n\r\n- Many live their lives in miserable rebellion.\r\n\r\n## (9:1) Grateful to be in God's hands.\r\n\r\n> Ecclesiastes 9:1 &mdash; For all this I considered in my heart even to declare all this, that the righteous, and the wise, and their works, are in the hand of God: no man knoweth either love or hatred by all that is before them.\r\n\r\n- This fact is not a disappointment to me!\r\n\r\n## (10:17) Grateful for Reprieves in Leadership granted by God.\r\n\r\n> Ecclesiastes 10:17 &mdash; Blessed art thou, O land, when thy king is the son of nobles, and thy princes eat in due season, for strength, and not for drunkenness!\r\n\r\n## (11:8-9) Grateful for every year and even each day we live.\r\n\r\n> Ecclesiastes 11:8-9 &mdash; But if a man live many years, and rejoice in them all; yet let him remember the days of darkness; for they shall be many. All that cometh is vanity. 9 Rejoice, O young man, in thy youth; and let thy heart cheer thee in the days of thy youth, and walk in the ways of thine heart, and in the sight of thine eyes: but know thou, that for all these things God will bring thee into judgment.\r\n\r\n## (12:1) Grateful God has granted me the grace to be mindful of my duty to Him!\r\n\r\n> Ecclesiastes 12:1,13 &mdash; Remember now thy Creator in the days of thy youth, while the evil days come not, nor the years draw nigh, when thou shalt say, I have no pleasure in them; 13 ¶ Let us hear the conclusion of the whole matter: Fear God, and keep his commandments: for this is the whole duty of man."},"type":"READ_MD_FILE"}