{"id":1143,"courseId":"stephen-reynolds-jr-sermon-outlines","tasks":[],"title":"20181223 CHRISTMAS","fileType":"md","value":{"path":"C:\\sites\\github\\courses\\stephen-reynolds-jr-sermon-outlines/20181223_christmas.md","raw":"# Celebrating Christ's Appearing\r\n\r\n> 2 Timothy 4:8 Henceforth there is laid up for me a crown of righteousness, which the Lord, the righteous judge, shall give me at that day: and not to me only, but unto all them also that love his appearing.\r\n\r\n## His Appearing\r\n\r\n- Is the day of His appearing precious?\r\n\r\n1. Until His Appearing\r\n\r\n> 1Ti 6:14 That thou keep this commandment without spot, unrebukeable, until the appearing of our Lord Jesus Christ:\r\n\r\n2 Timothy 4:1; Titus 2:13; 1 Peter 1:7\r\n\r\n2. Having Appeared\r\n\r\n> 2 Timothy 1:10 &mdash; But is now made manifest by the appearing of our Saviour Jesus Christ, who hath abolished death, and hath brought life and immortality to light through the gospel:\r\n\r\n> Titus 2:11-13 &mdash; For the grace of God that bringeth salvation hath appeared to all men, 12 Teaching us that, denying ungodliness and worldly lusts, we should live soberly, righteously, and godly, in this present world; 13 Looking for that blessed hope, and the glorious appearing of the great God and our Saviour Jesus Christ;\r\n\r\n- As a Baby in a manger:\r\n\r\nPossibly in September which would make his conception around December 25th.\r\n\r\n>  Luke 2:7 &mdash; And she brought forth her firstborn son, and wrapped him in swaddling clothes, and laid him in a manger; because there was no room for them in the inn.\r\n\r\n3. Day of Visitation\r\n\r\n1 Peter 2:12; Luke 19:44\r\n\r\n## Our Celebration\r\n\r\n- Prodigal Has Returned! Luke 15:23-24\r\n\r\n- Praise God in His Sanctuary! (Not a silent occasion) (Psalm 150:1-6)\r\n\r\n- [Eat or drink?] Do to the Glory of God (1 Corinthians 10:31)\r\n\r\n- Celebrate in Time, (Ecclesiastes 3:4)\r\n\r\n- My Joy Remain in You\r\n\r\n> John 15:11 &mdash; These things have I spoken unto you, that my joy might remain in you, and that your joy might be full.\r\n\r\n(Let's celebrate!)\r\n\r\n- THIS is the day!\r\n\r\n> Psalm 118:24 &mdash;  This is the day which the LORD hath made; we will rejoice and be glad in it.\r\n\r\n- a period distinguished by God's favor above all others.\r\n\r\n>  Matthew 2:11 &mdash; And when they were come into the house, they saw the young child with Mary his mother, and fell down, and worshipped him: and when they had opened their treasures, they presented unto him gifts; gold, and frankincense, and myrrh.\r\n\r\n## Keep the Feast\r\n\r\nPRIORITY: \"Keep the Feast\" (Spiritual: Leading the Christian life of joy in Christ's finished work.)\r\n\r\n> 1 Corinthians 5:7 &mdash; Purge out therefore the old leaven, that ye may be a new lump, as ye are unleavened. For even Christ our passover is sacrificed for us: 8 Therefore let us keep the feast, not with old leaven, neither with the leaven of malice and wickedness; but with the unleavened bread of sincerity and truth.\r\n\r\n> Proverbs 15:15 ¶ All the days of the afflicted are evil: but he that is of a merry heart hath a continual feast.\r\n\r\n> 1 Corinthians 13:1-13 \r\n\r\nThe early church had times of food and fellowship much as we do today, and it seems that these times were called \"love feasts.\" \r\n\r\n\r\n## Memorialize with Scripture\r\n\r\n- Read, Mediate, Respond\r\n- Favorite passage?\r\n\r\n- Isaiah 7:14 <!-- scripture: Isaiah 7:14 -->\r\n\r\n- Isaiah 9:6 <!-- scripture: Isaiah 9:6 -->\r\n\r\n- Luke 1:35\r\n<!-- scripture: Luke 1:35 -->\r\n\r\n- Matthew 1:18-25 <!-- scripture: Matthew 1:18-25 -->\r\n\r\n- Luke 2:1-14 <!-- scripture: Luke 2:1-14 -->\r\n\r\n- Luke 2:1-14 (visit of the shepherds) <!-- scripture: Luke 2:15-20 -->\r\n\r\n- Matthew 2:1-12 (visit of the wisemen) <!-- scripture: Matthew 2:1-12 -->\r\n\r\n- PEACE ON EARTH\r\nLuke 2:14 <!-- scripture: Luke 2:14-->\r\n\r\n\r\n- THE GIFT OF ETERNAL LIFE\r\n    - 1 John 5:11 <!-- scripture: 1 John 5:11-->\r\n\r\n    - Romans 6:23 <!-- scripture: Romans 6:23 -->\r\n\r\n    - John 3:16 <!-- scripture: John 3:16 -->\r\n\r\n    - Titus 3:4-7 <!-- scripture: Titus 3:4-7 -->\r\n\r\n    - John 10:27-28 <!-- scripture: John 10:27-28-->\r\n\r\n    - 1 Timothy 1:15-17 <!-- scripture: 1 Timothy 1:15-17-->"},"type":"READ_MD_FILE"}