{"id":1147,"courseId":"stephen-reynolds-jr-sermon-outlines","tasks":[],"title":"20190505 HOLDING FORTH THE WORD OF LIFE","fileType":"md","value":{"path":"C:\\sites\\github\\courses\\stephen-reynolds-jr-sermon-outlines/20190505_holding-forth-the-word-of-life.md","raw":"# Holding Forth the Word of Life\r\n\r\n> Philippians 2:15‭-‬16 &mdash; That ye may be blameless and harmless, the sons of God, without rebuke, in the midst of a crooked and perverse nation, among whom ye shine as lights in the world; Holding forth the word of life; that I may rejoice in the day of Christ, that I have not run in vain, neither laboured in vain.\r\n\r\n- Blameless, Harmless, Without rebuke\r\n- In the midst of a crooked and perverse nation\r\n- Among whom ye shine as lights (Distinctly Christian)\r\n- Holding forth the Word of Life\r\n\r\n## The Word of Life\r\n\r\nWord of life acts 5:20, John 6:68, 1 john 1:1,\r\n\r\n> Acts 5:20 &mdash; Ac 5:20 Go, stand and speak in the temple to the people all the words of this life. (an eternal life rejected by the Saducees)\r\n\r\n> John 6:68 &mdash; Then Simon Peter answered him, Lord, to whom shall we go? thou hast the words of eternal life.\r\n\r\n> 1 John 1:1 &mdash; That which was from the beginning, which we have heard, which we have seen with our eyes, which we have looked upon, and our hands have handled, of the Word of life;\r\n\r\n## Holding Forth\r\n\r\n- Fixing your gaze on the word\r\n- hold your position in the Word\r\n- hold fast, firmly. \r\n- possessing (the words that bring life)\r\n\r\n“Holding fast” translates a word that means hold your position or hold your gaze. \r\n- In 1 Timothy 4:16, it’s translated, “Keep a close watch on yourself and on the teaching.” \r\n- In Acts 3:5, it’s translated, “He fixed his attention on them, expecting to receive something from them.” \r\n- In Acts 19:22, it’s translated, “Paul himself stayed (held his place) in Asia for a while.”\r\n\r\nBookmarks in a bible ... hold your position\r\n\r\n**What's your position... not just what's your opinion on this passage ... but where is your life in relation to this word**\r\n\r\nOpinions and arguments are a dime a dozen but a life lived is a powerful witness.\r\n\r\n\"You are here\" on sign at niagara\r\n\r\n## Application\r\n\r\nTime and carnal pressures cause some to lose their grip on the Word: (SLIPPING)\r\n\r\n1. The Bible is the infallible inerrant only Word of God. Written revelation of his will to men.\r\n\r\n2. Do not make merchandise of the Gospel. And said unto them that sold doves, Take these things hence; make not my Father's house an house of merchandise.\r\nJohn 2:16 this is a exclusively a house of prayer.\r\n\r\n3. Following after gain and worshipping materialism. Careful ... love not the world neither the things that are in the world ... clear and present danger that the pleasures iis this life would get a hold of us. Phil 4:13 and contentment\r\n\r\n4. We don't bring the fire, we bring the sacrifice. On MT Carmel, (1 Kings 18:33) Elijah brought the sacrifice and (1 Kings 18:38) God brought the fire."},"type":"READ_MD_FILE"}