{"id":1148,"courseId":"stephen-reynolds-jr-sermon-outlines","tasks":[],"title":"20190512 MOTHERS DAY","fileType":"md","value":{"path":"C:\\sites\\github\\courses\\stephen-reynolds-jr-sermon-outlines/20190512_mothers-day.md","raw":"# Mother's House\r\n\r\nAdult Bible Class - Mother's Day 2019\r\n\r\n**TEXT**: Genesis 24:10-28\r\n\r\n*   23 And said, <u>**Whose daughter art thou?**</u> tell me, I pray thee: is there room in <u>**thy father's house**</u> for us to lodge in?\r\n\r\n*   24 And she said unto him, I am the daughter of <u>**Bethuel the son of Milcah, which she**</u> bare unto Nahor.\r\n\r\n*   28 And the damsel ran, and told them of her <u>**mother's house**</u> these things.\r\n\r\n## Explanation of \"Mother's House\" in Genesis 24\r\n\r\n- Elieazer asks in v. 23 is there room in \"THY FATHER's HOUSE\"?\r\n- Rebekah leaves Eliezar to tell them of \"HER MOTHER's HOUSE\"\r\n\r\nRebekah running to tell her mother and not her father is an interesting puzzle. \r\n\r\nIn a similar story, when Jacob comes to Haran and introduces himself to Rachel (Gen 29:12), she “runs to tell her father”.\r\n\r\nOne Jewish writer, Saadi Gaon, tried to unravel the mystery with 2 possible explanations: A. It is embarrassing to tell this to men and she would find it more comfortable talking to her mother. B. Women are more discerning at first with jewelry and will ask about it.\r\n\r\n\"Mother's House\"/\"Mother's Household\" being understood as a special building where woman did their daily work and as a direct result of concubine relationships, seems inconsistent with the account the continuation of the story makes it clear that “mother’s house” is not a building only for women and that Rebekah did not tell this privately to her mother, since her brother Laban is the one who runs out (after hearing Rebekah himself) to the well to officially welcome Abraham’s emissary in v. 29, 30.\r\n\r\nAs Rebekah told the story to her mother and brother, it would seem that “the mother’s household” is a general term for everyone in the family.\r\n\r\n**But where was her father?** \r\n\r\nThe simple explanation is that her father was no longer alive, leaving the house nominally in the charge of her mother. But in this patriarchal society, it would be her mother’s household only in name; a grown up son would be in actual charge of the household, or at least in joint charge. As the story continues Elieazer speaks directly with Laban (her brother) in the negotiations which would seem rude if his father Bethuel were present.\r\n\r\n**Until v.50! When Bethuel suddenly appears**\r\n\r\n> Genesis 24:50 &mdash; Then Laban and Bethuel answered and said, The thing proceedeth from the LORD: we cannot speak unto thee bad or good\r\n\r\nHe's not dead?\r\n\r\nBethuel appears out of nowhere. The text makes no effort to explain where he was when the servant arrived or why Laban acted as if he were in charge up until this point or why the household is referred to as her mother’s and not her father’s, if he is alive. Moreover, why would Laban be listed before his father?\r\n\r\nBetuel Disappears Again\r\nThe story continues with Abraham’s servant giving out gifts:\r\n\r\n> Gen 24:53 And the servant brought forth jewels of silver, and jewels of gold, and raiment, and gave them to Rebekah: he gave also to **her brother and to her mother** precious things.\r\n\r\nSome suggestions have been made:\r\n\r\n- Noting the sudden disappearance of Betuel after v. 50, a number of traditional commentaries suggest that he died in the middle of negotiations. (several jewish commentaries offer accounts along the line of how the members of Rebekah’s family attempted to interfere with the servant’s mission by delaying, or even preventing, her going with him, but God frustrated their designs.)\r\n- An editorial mistake, as this was normally the fathers role. Perhaps original read \"Laban and her mother\" as in v. 55 \"her brother and her mother said\". [But why replace v. 50 and no v.55?]\r\n\r\n**Could Bethuel Be the Mother's Name/Title?**\r\n\r\n We are misunderstanding who Bethuel is. When Laban speaks in this story with some else, it is with his and Rebekah’s mother (v. 55). When Abraham’s servant wants to express gratitude for agreeing to the match by giving gifts, it is to Rebekah’s brother and mother (v. 53). It only seems logical that the people who agree to the match in vv. 50-51 are Laban and Rebekah’s mother. Thus it could be suggested that Bethuel is the name of Rebekah and Laban’s mother. If it is assumed that \"Bethuel\" is a woman's name, the translation of an otherwise difficult to translate name is straightforward, “Daughter of El.” \r\n\r\n## **SCRIPTURES ON MOTHER**\r\n\r\n<u>**Pr 9:1**</u> Wisdom hath builded her house, she hath hewn out her seven pillars:\r\n\r\n<u>**Pr 14:1**</u> Every wise woman buildeth her house: but the foolish plucketh it down with her hands.\r\n\r\n<u>**Song 3:4**</u> It was but a little that I passed from them, but I found him whom my soul loveth: I held him, and would not let him go, until I had brought him into my mother's house, and into the chamber of her that conceived me.\r\n\r\n<u>**Lu 10:38**</u> Now it came to pass, as they went, that he entered into a certain village: and a certain woman named Martha received him into her house.\r\n\r\n<u>**Ac 16:15**</u> And when she was baptized, and her household, she besought us, saying, If ye have judged me to be faithful to the Lord, come into my house, and abide there. And she constrained us.\r\n\r\n<u>**What are mothers?**</u>\r\n\r\nWell, mothers are teachers. Mothers are disciplinarians. Mothers are cleaning ladies. Some mothers are gardeners & mowers of lawns. Mothers are nurses & doctors & psychologists & counselors & chauffeurs & coaches.\r\n\r\nMothers are developers of personalities, molders of vocabularies, & shapers of attitudes. Mothers are soft voices saying, \"I love you.\" And mothers are a link to God, a child's first impression of God's love. Mothers are all these things & much, much more.\r\n\r\n## **Biblical Motherhood is an ideal!**\r\n\r\n(a person or thing regarded as \"perfect\")\r\n\r\n1.  **Set the Tone of the Home**\r\n\r\nPr 31:30 Favour is deceitful, and beauty is vain: but a woman that feareth the LORD, she shall be praised.\r\n\r\n2.  **Daily Education and Instruction**\r\n\r\nBoth Practical and Spiritual\r\n\r\n3.  **Manager & Upkeep**\r\n\r\nWhat did your mother do? What do you do? [DISCUSSION]"},"type":"READ_MD_FILE"}