{"id":1150,"courseId":"stephen-reynolds-jr-sermon-outlines","tasks":[],"title":"20190622A WOULD WE KNOW IT IF GOD WAS NOT IN IT","fileType":"md","value":{"path":"C:\\sites\\github\\courses\\stephen-reynolds-jr-sermon-outlines/20190622A_Would We Know It if God was Not In It.md","raw":"# When God is In It\r\n\r\nTEXT: Isaiah 5:1-4, 13\r\n\r\n## INTRODUCTON - The Presence of God\r\n\r\n- Our desire is His presence\r\n\r\n> Ps 27:4 One thing have I desired of the LORD, that will I seek after; that I may dwell in the house of the LORD all the days of my life, to behold the beauty of the LORD, and to enquire in his temple. \r\n\r\n## 1. When God is In It\r\n\r\n### a. Makes Inspection\r\n\r\n>  and he looked that it should bring forth grapes, and it brought forth wild grapes. 3 And now, O inhabitants of Jerusalem, and men of Judah, judge, I pray you, betwixt me and my vineyard. >  4 What could have been done more to my vineyard, that I have not done in it? wherefore, when I looked that it should bring forth grapes, brought it forth wild grapes?\r\n\r\n### b. Our Beloved's Care\r\n\r\n- Isaiah 1:18 \"REASON\"; Isaiah 5:1 \"A SONG\"\r\n- Planted the vineyard in a Fruitfull Hill\r\n- he fenced it\r\n- gathered out the stones thereof,\r\n- planted it with the choicest vine (SOREK, anciently famous)\r\n- built a tower in the midst of it\r\n- made a winepress therein:\r\n\r\nWhat he knows about her, versus what she knows about him.\r\n\r\n## 2. When God Is Not In It \r\n\r\nv. 2 wild grapes - poisonous berries -  (Arabs call them \"wolf grapes\") - - offensive rottenness -   not only no fruit at all, but bad fruit, worse than none, ** grapes of Sodom, De 32:32**. \r\n\r\n- I will take away the hedge (Taking away his word and ministers.)\r\n- it shall not be pruned, nor digged; but there shall come up briers and thorns:\r\n- I will also command the clouds that they rain no rain upon it.\r\n\r\n-  he looked for judgment, but behold oppression; \r\n-  for righteousness, but behold a cry.\r\n-  Oppression of the Poor (v.8)\r\n-  rise up early in the morning, that they may follow strong drink\r\n-  they regard not the work of the LORD, neither consider the operation of his hands.\r\n- JUDGMENT: desolate, Low Yield\r\n \r\n## Would I Know if God wasn't In It?\r\n \r\n> Isaiah 5:13 &mdash; Therefore my people are gone into captivity, because they have no knowledge: and their honourable men are famished, and their multitude dried up with thirst.\r\n\r\n> Judges 16:20 &mdash;  And she said, The Philistines be upon thee, Samson. And he awoke out of his sleep, and said, I will go out as at other times before, and shake myself. And he wist not that the LORD was departed from him.\r\n\r\n### HOW DID WE GET HERE?\r\n\r\n\"I KNEW IT NOT\"\r\n\r\n- Regard not the Work of the Lord, (busy with other things)\r\n- Call Evil Good and Good evil\r\n- Mighty drink wine\r\n- Have despised the word of the holy One\r\n- LACK OF KNOWLEDGE \"HE WIST NOT THAT THE LORD WAS DEPARTED FROM HIM\"\r\n\t- Mechanics vs. Feeling AFter Him\r\n\t- Its Not Just what we do, but HOW we do it that God is interested in.\r\n\t\r\n### What we KNOW God is not interested in.\r\n\r\n#### 1.  Anything that glorifies the flesh. (no steps to the altar, nakedness covered)\r\n\r\nAre we becomingn more INTUNE with carnal things than spiritual? Filled with flesh all week and then expected to offer a spiritual sacrifice?\r\n\r\nGod won't share his glory with the flesh.\r\n\r\n#### 2. God Has No Repect for a Bloodless Sacrifice (Cain brought of the ground cursed)\r\n\r\n#### 3. God Won't Bless Disobedience\r\n\r\n#### 4. Freindship wiht the world is enmity wiht God\r\n\r\nWe get entangled with the things, a child of God has no business getting involved with.\r\n\r\n## Conclusion\r\n\r\nIf God's not in it, we don't need it.\r\n\r\nComing Home --- seeing evidence that my wife has been home all day! CLEAN"},"type":"READ_MD_FILE"}