{"id":1154,"courseId":"stephen-reynolds-jr-sermon-outlines","tasks":[],"title":"20190707P NOW","fileType":"md","value":{"path":"C:\\sites\\github\\courses\\stephen-reynolds-jr-sermon-outlines/20190707P-now.md","raw":"# Spiritual Urgency\r\n\r\nA key element to spiritual awakening and personal revival is the grave and present sense of THE NEED. So long as Christiandom markets itself as a \"SELF HELP\" strategy of a people idly waiting on a hillside for our Lord's return --- WE WILL BE VICTIM TO LUKEWARMNESS and UNREADINESS.\r\n\r\n-  Ps 40:8 **I delight TO DO thy will,** O my God: yea, thy law is within my heart. \r\n\r\n>  **Re 3:15-16** I know thy works, that thou art neither cold nor hot: I would thou wert cold or hot. 16 So then because thou art lukewarm, and neither cold nor hot, I will spue thee out of my mouth.\r\n\r\n> Isaiah 49:8 Thus saith the LORD, In an acceptable time have I heard thee, and in a day of salvation have I helped thee: and I will preserve thee, and give thee for a covenant of the people, to establish the earth, to cause to inherit the desolate heritages;\r\n>\r\n> **READ 2 Corinthians 5:20-6:2**\r\n\r\n- 5:20 **we are ambassadors for Christ**, as though God did beseech you by us: we pray you in Christ's stead, \r\n- **be ye reconciled to God**. <!-- **a ministry of reconciliation is needed**\r\n\r\n- 2Co 6:1 ¶ We then, as workers together with him,\r\n-  beseech you also that ye **receive not the grace of God in vain**. \r\n\r\n## The Urgency of the Hour\r\n\r\n### 1. the SPIRITUAL CONDITION\r\n\r\nverse 12, It's not our love or heart that is \"STRAIGHTENED\" (restrained/withheld) but theirs toward God's ministers. How was their heart's straightened?\r\n\r\n- Unequally Yoked with Unbelievers\r\n\r\n- Admitting False Teachers Among them\r\n\r\n- Paul WARNS in the remaining verses against compromise: \"WHAT FELLOWSHIP HATH LIGHT WITH DARKNESS?\"\r\n\r\n### 2. NOW\r\n\r\n> behold, now is the accepted time; behold, now is the day of salvation.\r\n\r\n- importance requiring swift action; an earnest and persistent quality; insistence.\r\n- They say \"now\" is about 7 seconds long.\r\n- As a Day that WILL SOON pass.\r\n- As a day that may foolishly be wasted.\r\n- As the grace we benefit from may be wasted ... **Lest you received the grace of God in vain** ... <u>6:1</u>\r\n\r\n> Jeremiah 8:20 &mdash; The harvest is past, the summer is ended, and we are not saved.\r\n\r\n- The moving of the Spirit of God among us is not a COMMON thing.\r\n\r\n## The trouble with contrived emotionalism\r\n\r\n- Pressure People - ARTIFICAL URGENCY\r\n- Workup a setting and atmosphere - Lights and Music\r\n- Short timespan of influence\r\n\r\n- How is the necessary sense of AWARENESS and URGENCY to come to us?\r\n- Not just a temporary \"WORKING UP OF EMOTIONS\".\r\n\r\n##  What Measures Are Taken?\r\n\r\nWhat will bring about the SPIRITUAL URGENCY that is  NEEDED?\r\n\r\nAs those convinced of the truth we ARE LABORORS WITH GOD and having received GRACE (God's Enabling POWER) that we must not allow to be wasted. NOT TREAT IT **EMPTILY** but labor for the furthering of the Gospel. **SIEZE THE OPPORTUNITY to minister PRESENT NOW**.\r\n\r\n- 3 Giving no offence in any thing, **that the ministry be not blamed**: (We should act so as to bring no disgrace on the Gospel - WATCH YOUR STEP CHRISTIAN)\r\n- 4 But in all things approving ourselves as the ministers of God, in much patience, in afflictions, in necessities, in distresses, 5 In stripes, in imprisonments, in tumults, in labours, in watchings, in fastings; 6 By pureness, by knowledge, by longsuffering, by kindness, by the Holy Ghost, by love unfeigned, 7 By the word of truth, by the power of God, by the armour of righteousness on the right hand and on the left, 8 By honour and dishonour, by evil report and good report: as deceivers, and yet true; 9 As unknown, and yet well known; as dying, and, behold, we live; as chastened, and not killed; 10 As sorrowful, yet alway rejoicing; as poor, yet making many rich; as having nothing, and yet possessing all things.\r\n- **DEATH**: "},"type":"READ_MD_FILE"}