{"id":1159,"courseId":"stephen-reynolds-jr-sermon-outlines","tasks":[],"title":"20190901 FOR LOVES SAKE","fileType":"md","value":{"path":"C:\\sites\\github\\courses\\stephen-reynolds-jr-sermon-outlines/20190901_for-loves-sake.md","raw":"# For Love's Sake\r\n\r\ntext: Philemon 1:8-18; v.9 &mdash; Yet for love's sake I rather beseech thee, being such an one as Paul the aged, and now also a prisoner of Jesus Christ.\r\n\r\n## INTRODUCTION: Gospel Methods\r\n\r\n- There is a **Biblical Method/Gospel Method** along with the **message**. In the epistle of Philemon we see an illustraiton of the Gospel method.\r\n- John 2:15, Jesus made a scourge of cords.\r\n- It is God's will that His people remain undivided.\r\n- How to properly love people?\r\n- v.1 \"prisoner\" - Paul a prisoner at Rome. meaning \"bound with a chain\". Tethered to a guard day and night.\r\n- Paul doesn't address himself in this epistle as an apostle as the nature of the letter is largely personal.\r\n- In this letter we have a remarkable account: A **slave** whose case captures the attention of an **Apostle**.\r\n- v. 9 \"aged man\" Paul is just **56 years old** but also only **4 years** from his martyrdom.\r\n\r\n## Love Toward Christ\r\n\r\n> Philemon 1:5 &mdash; Hearing of thy love and faith, which thou hast toward the Lord Jesus, and toward all saints;\r\n\r\nWilliam R. Featherston  (1848–1875)  wrote the poem \"My Jesus, I Love Thee\" soon following his conversion at the age of 16. Featherston died prior to his 27th birthday, and is not known to have written any other songs. In 1876 Adoniram Gordon used the poem as lyrics for a hymn. Not much is known about Featherston, except that he attended a Methodist church in Montreal, that he was young when he wrote the poem (12 or 16 years old), and that he died at just 27 years of age. One story about how the poem became public is that Featherston mailed it to his aunt in Los Angeles who, upon reading it, quickly sought its publication. It wasn’t until  after Featherston’s death that Adoniram Judson Gordon (founder of Gordon College and Gordon-Conwell Theological Seminary) added a melody and published it in his book of hymns, thus forever transforming this poem to a song.\r\n\r\n> 1 John 4:19 &mdash; We love him, because he first loved us.\r\n\r\n1. My Jesus, I love Thee, I know Thou art mine;\r\n   For Thee all the follies of sin I resign;\r\n   My gracious Redeemer, my Savior art Thou;\r\n   If ever I loved Thee, my Jesus, ’tis now.\r\n2. I love Thee because Thou hast first loved me,\r\n   And purchased my pardon on Calvary’s tree;\r\n   I love Thee for wearing the thorns on Thy brow;\r\n   If ever I loved Thee, my Jesus, ’tis now.\r\n3. I’ll love Thee in life, I will love Thee in death,\r\n   And praise Thee as long as Thou lendest me breath;\r\n   And say when the death dew lies cold on my brow,\r\n   If ever I loved Thee, my Jesus, ’tis now.\r\n4. In mansions of glory and endless delight,\r\n   I’ll ever adore Thee in heaven so bright;\r\n   I’ll sing with the glittering crown on my brow,\r\n   If ever I loved Thee, my Jesus, ’tis now.\r\n\r\n## v.8 \"I Have Much Authority\" , but v.9 \"for love's sake\"\r\n\r\n- on account of my love for thee, I entreat thee.\r\n\r\n> Philemon 1:8,9 &mdash; Wherefore, though I might be much bold in Christ to enjoin thee that which is convenient, 9 Yet for love's sake I rather beseech thee, being such an one as Paul the aged, and now also a prisoner of Jesus Christ.\r\n\r\n## v.10-19 \"Onesimus\" a Runaway Slave\r\n\r\n- v.10 name \"onesimus\" means \"profitable, useful\" from a root meaning \"to help\".\r\n- v.12 Justice appeared to demand that Onesimus return to Philemon, but Love inspired a letter.\r\n\r\n## Thoughts\r\n\r\n- Rebuke not an elder, but entreat as a father. 1 Timothy 5:1\r\n- Entreat; Beseech [parakaleo] \"to call near; \"\r\n- We are moved to action for the sake OF A LOT OF THINGS. Not all things equally important.\r\n- I'm right, Its right, I have a right\r\n- Fear of failure\r\n- fear and anticipation of rejection and judgment of others\r\n\r\n## Private Letter of Intercession\r\n\r\n1. v.10,11 Testimony of Onesimus' Change of Character\r\n2. v.12-19 Appeal for Forgiveness\r\n3. v.18,19 A Promise to Make Good Any Lossess\r\n4. v.20,21 Great Humility and Wisdom used.\r\n\r\n##  The Gospel Method\r\n\r\nIn the epistle of Philemon we see an illustration of the Gospel method.\r\n\r\n1. A Challenge to be a Servant like Jesus was. (in Pauls)\r\n2. A Challenge to be a Brother of Servants. (in Onesimus)\r\n3. A Challenge to be a Fellow Servant. (in Philemon)\r\n\r\n## Four Wonderful Blessings of Practical Christianity\r\n\r\n1. v.7 Great joy and consolation in thy love\r\n2. v.17 Great affections for friends\r\n3. v.15  Great inner-peace results when one trusts in God's Providential care to bring men together.\r\n4. v.20 There is constant benefits from Christian friendship\r\n\r\n## Conclusion \r\n\r\n> Revelation 2:4 &mdash; Nevertheless I have somewhat against thee, because thou hast left thy first love."},"type":"READ_MD_FILE"}