{"id":1166,"courseId":"stephen-reynolds-jr-sermon-outlines","tasks":[],"title":"CREATION OF MAN","fileType":"md","value":{"path":"C:\\sites\\github\\courses\\stephen-reynolds-jr-sermon-outlines/creation-of-man.md","raw":"# Creation of Man\r\n\r\n## What is Man?\r\n\r\n> Psalms 8:4 &mdash; What is man, that thou art mindful of him? and the son of man, that thou visitest him? [compare: Job 7:17; Job 15:14; Psalm 144:3; Hebrews 2:6]\r\n\r\n## Fearfully and Wonerfully Made\r\n\r\n> Psalms 139:14 &mdash; I will praise thee; for I am fearfully and wonderfully made: marvellous are thy works; and that my soul knoweth right well.\r\n\r\n### Complex\r\n\r\n> Darwin :\"The eye to this day gives me a cold shudder.\"\r\n\r\nImagine walking past the fanciest sports car you ever saw. Would your first assumption be that evolution was responsible for its existence? It is man-made and not derived from a series of mutations.\r\n\r\n### Accident?\r\n\r\nAll accidents in nature are either silet, useless or extremely challenging, deforming or incompatible with life. \"Accidents\" are  not capable of creating complex individuals can write stories, perform surgery, debate political issues and invent.\r\n\r\n### Genes\r\n\r\nEverything that happens in the Human body is controlled  by the 3 billion base pairs that make up the 100,000 genes that form the 23 paired chromosomes within the nucleus of nearly every cell.\r\n\r\nThe information contained within a single neclues is equal to a library 1,000 encyclopedias each with a 1,000 pages. Multiply that by the 10 or more trillion cells in a body and the amount of information becomes astronomical.\r\n\r\nThe relative position of each gene is vital, as well.\r\n\r\n### All or None\r\n\r\nExample: The body's ability to fight infection.\r\n\r\nA dirty wound might contain  billions of microorganisms, yet every step in the body's system for protecting us from intruders - even those never encountered before - has to have been in place beforehand.\r\n\r\n### Purposeful Function\r\n\r\nWhy:\r\n\r\n- Thickest Skin on the bottom of our feet\r\n- Most Sensitive skin on fingertips and lips\r\n- Thinnest most transparent skin in our eyelids\r\n- Chemically different tears for crying, happiness and lubrication\r\n- Adrenaline for sudden energy bursts\r\n- A Nose situtation above the mouth so it can assess food for eating it\r\n- Taste buds to catch a poison before it goes down or vomiting  aided by gagging if the bad stuff slips through\r\n\r\n## In the Image of God\r\n\r\n> Gen:1:26a &mdash; And God said, Let us make man in our image, after our likeness: &hellip;\r\n\r\n> Col:1:14,15: In whom we have redemption through his blood, even the forgiveness of sins: 15 Who is the image of the invisible God, the firstborn of every creature:\r\n\r\n> Ezek:28:15: Thou wast perfect in thy ways from the day that thou wast created, till iniquity was found in thee.\r\n\r\n> Mal:2:10: Have we not all one father?  hath not one God created us?  why do we deal treacherously every man against his brother, by profaning the covenant of our fathers?\r\n\r\n## Dominion of Man\r\n\r\n> Gen:1:26b-31 &mdash; &hellip; and let them have dominion over the fish of the sea, and over the fowl of the air, and over the cattle, and over all the earth, and over every creeping thing that creepeth upon the earth. 27 So God created man in his own image, in the image of God created he him; male and female created he them. 28 And God blessed them, and God said unto them, Be fruitful, and multiply, and replenish the earth, and subdue it: and have dominion over the fish of the sea, and over the fowl of the air, and over every living thing that moveth upon the earth. 29 And God said, Behold, I have given you every herb bearing seed, which is upon the face of all the earth, and every tree, in the which is the fruit of a tree yielding seed; to you it shall be for meat. 30 And to every beast of the earth, and to every fowl of the air, and to every thing that creepeth upon the earth, wherein there is life, I have given every green herb for meat: and it was so. 31 And God saw every thing that he had made, and, behold, it was very good. And the evening and the morning were the sixth day.\r\n\r\n## Their Name\r\n\r\n> Gen:5:1: This is the book of the generations of Adam.  In the day that God created man, in the likeness of God made he him; 2: Male and female created he them; and blessed them, and called their name Adam, in the day when they were created.\r\n\r\n## Was Man a Mistake?\r\n\r\n> Gen:6:7: And the LORD said, I will destroy man whom I have created from the face of the earth; both man, and beast, and the creeping thing, and the fowls of the air; for it repenteth me that I have made them.\r\n\r\n> Isa:45:18: For thus saith the LORD that created the heavens; God himself that formed the earth and made it; he hath established it, he created it not in vain, he formed it to be inhabited: I am the LORD; and there is none else.\r\n\r\n## Purpose\r\n\r\n> Ps:102:18: This shall be written for the generation to come: and the people which shall be created shall praise the LORD.\r\n\r\n> Ps:148:5: Let them praise the name of the LORD: for he commanded, and they were created.\r\n\r\n> Isa:43:7: Even every one that is called by my name: for I have created him for my glory, I have formed him; yea, I have made him.\r\n\r\n> Eph:2:10: For we are his workmanship, created in Christ Jesus unto good works, which God hath before ordained that we should walk in them.\r\n\r\n> Col:1:16: For by him were all things created, that are in heaven, and that are in earth, visible and invisible, whether they be thrones, or dominions, or principalities, or powers: all things were created by him, and for him:\r\n\r\n> Rv:4:11: Thou art worthy, O Lord, to receive glory and honour and power: for thou hast created all things, and for thy pleasure they are and were created.\r\n\r\n## First Fruits\r\n\r\n> James 1:18: Of his own will begat he us with the word of truth, that we should be a kind of firstfruits of his creatures.\r\n\r\n> 2 Cor:5:17: Therefore if any man be in Christ, he is a new creature: old things are passed away; behold, all things are become new.\r\n\r\n> Eph:4:24: And that ye put on the new man, which after God is created in righteousness and true holiness.\r\n\r\n> Heb:4:13: Neither is there any creature that is not manifest in his sight: but all things are naked and opened unto the eyes of him with whom we have to do.\r\n\r\nThe first fruits belongs to God:\r\n\r\n> Proverbs 3:9 &mdash; Honour the LORD with thy substance, and with the firstfruits of all thine increase:\r\n\r\n> Jeremiah 2:3 Israel was holiness unto the LORD, and the firstfruits of his increase: all that devour him shall offend; evil shall come upon them, saith the LORD.\r\n\r\n> 1 Corinthians 15:20 &mdash; But now is Christ risen from the dead, and become the firstfruits of them that slept.\r\n\r\n> 1 Corinthians 15:23 &mdash; But every man in his own order: Christ the firstfruits; afterward they that are Christ's at his coming.\r\n\r\nThe 144,000 with the Lamb on Mount Zion:\r\n\r\n> Revelation 14:4 &mdash; These are they which were not defiled with women; for they are virgins. These are they which follow the Lamb whithersoever he goeth. These were redeemed from among men, being the firstfruits unto God and to the Lamb. \r\n\r\n"},"type":"READ_MD_FILE"}