{"id":1167,"courseId":"stephen-reynolds-jr-sermon-outlines","tasks":[],"title":"FALL CONVENTION BIBLE CLASS","fileType":"md","value":{"path":"C:\\sites\\github\\courses\\stephen-reynolds-jr-sermon-outlines/fall-convention-bible-class.md","raw":"# God's Work God's Way, Cannot Not Be Undone\r\n\r\n## Introduction: READ Matthew 13:24\r\n\r\nWe need wisdom that sees through the noise of circumstances to the effect our responses are having on the work of God.\r\n\r\n>  Philippians 1:6 Being confident of this very thing, that he which hath begun a good work in you will perform it until the day of Jesus Christ: [complete]\r\n<!-- -->\r\n> Mt 13:24 ¶ Another parable put he forth unto them, saying, The kingdom of heaven is likened unto a man which sowed good seed in his field: 25 But while men slept, his enemy came and sowed tares among the wheat, and went his way. 26 But when the blade was sprung up, and brought forth fruit, then appeared the tares also. 27 So the servants of the householder came and said unto him, Sir, didst not thou sow good seed in thy field? from whence then hath it tares? 28  He said unto them, An enemy hath done this. The servants said unto him, Wilt thou then that we go and gather them up? 29 But he said, Nay; lest while ye gather up the tares, ye root up also the wheat with them. 30 Let both grow together until the harvest: and in the time of harvest I will say to the reapers, Gather ye together first the tares, and bind them in bundles to burn them: but gather the wheat into my barn.\r\n\r\n- (Another parable put he forth unto them, saying,)\r\n- (The kingdom of heaven is likened)\r\n\r\n## I. God has a Field and He Sows Good Seed in It\r\n\r\n> unto a man which sowed good seed in his field: \r\n\r\n- The Seed is Good\r\n- The Seed is the Word of God (Luke 8:11)\r\n- The Seed is Sown by the Lord and His Servants (1 Corinthians 3:9 For we are labourers together with God: ye are God's husbandry, ye are God's building.)\r\n\r\nHow is the Seed Sown?\r\n\r\n- Walking in the Light -- our testimony\r\n\r\n > 1 Peter 2:12 Having your conversation honest among the Gentiles: that, whereas they speak against you as evildoers, they may by your good works, which they shall behold, glorify God in the day of visitation. \r\n\r\n- Talking about the Truth -- our witness\r\n- Yielded and Obedient in the midst of the Test\r\n\r\n## II. God has Servants with Responsibility\r\n\r\n> 25 But while men slept, his enemy came and sowed tares among the wheat, and went his way.\r\n\r\n- God is not asleep (Psalm 121:4)\r\n\r\n> Psalm 121:4 Behold, he that keepeth Israel shall neither slumber nor sleep.\r\n\r\n<!-- -->\r\n\r\n>  Proverbs 10:5 ¶ He that gathereth in summer is a wise son: but he that sleepeth in harvest is a son that causeth shame.\r\n\r\n- (Side 1) Don't be foolish enough to assume the devil not is as lazy as I am (don't be so trusting of the devil).\r\n- (Side 2) \r\n\r\n## III. The Enemy Will Sow His Tares\r\n\r\n> 26 But when the blade was sprung up, and brought forth fruit, then appeared the tares also. 27 So the servants of the householder came and said unto him, Sir, didst not thou sow good seed in thy field? from whence then hath it tares? 28  He said unto them, An enemy hath done this. \r\n\r\nIt is the enemies desire to UNDO the Work of God &mdash; to prevent the harvest.\r\n\r\n- He Cannot Read Your Mind (just seeing if it sticks)\r\n- Just cause the boat springs a leak, doesn't mean you should jump out of the boat.\r\n\r\n## IV. God has Concern for When Tares are Sown in His Field\r\n\r\n> The servants said unto him, Wilt thou then that we go and gather them up? 29 But he said, Nay; lest while ye gather up the tares, ye root up also the wheat with them. \r\n\r\n- The Lord's Concern when Tares Are Sown : DON'T ROOT UP THE WHEAT\r\n- The Lord Will Have His Harvest!\r\n\r\n## V. God Has a Method for Dealing with What Concerns His Field\r\n\r\nThe Lord Will Carry Out the Sentence\r\n\r\n11. 30 Let both grow together until the harvest: and in the time of harvest I will say to the reapers, Gather ye together first the tares, and bind them in bundles to burn them: but gather the wheat into my barn."},"type":"READ_MD_FILE"}