{"id":1171,"courseId":"stephen-reynolds-jr-sermon-outlines","tasks":[],"title":"PRAYER FOR REVIVAL AND VISITATION","fileType":"md","value":{"path":"C:\\sites\\github\\courses\\stephen-reynolds-jr-sermon-outlines/Prayer for Revival and Visitation.md","raw":"# Revival and Visitation\r\n\r\nTEXT: Song of Solomon 4:16\r\n\r\n> Song of Solomon 4:16 &mdash; Awake, O north wind; and come, thou south; blow upon my garden, that the spices thereof may flow out. Let my beloved come into his garden, and eat his pleasant fruits.\r\n\r\n## Introduction\r\n\r\n- The prayer is \"BLOW\" - \"Blow upon my garden\"\r\n- The result is \"FLOW\" - \"That the spices thereof may flow out\"\r\n\r\n## The Prayer is for the Wind of the Holy Ghost\r\n\r\n(It brings refreshing)\r\n\r\n> John 3:8 &mdash; The wind bloweth where it listeth, and thou hearest the sound thereof, but canst not tell whence it cometh, and whither it goeth: so is every one that is born of the Spirit.\r\n\r\n1. **The Wind Removes**\r\n\t- the dead stale air\r\n\t- A lot of things not needed (not raking leaves, our leaves blowing into neighbor's yard)\r\n\r\n> Acts 2:1,2 &mdash; And when the day of Pentecost was fully come, they were all with one accord in one place. 2 And suddenly there came a sound from heaven as of a rushing mighty wind, and it filled all the house where they were sitting.\r\n\r\n> SOS 4:16 &mdash; Awake, O north wind; and come, thou south;  blow upon my garden,...\r\n\r\n2. **The North Wind Brings Cold Air**\r\n\r\n- It brings an awakening\r\n- We have a tendancy to settle down and sleep (are we still PRESSING ON?)\r\n- We were not born again to SLEEP\r\n\r\n> 1 Thessalonians 5:6 &mdash; Therefore let us not sleep, as do others; but let us watch and be sober.\r\n\r\n- It takes the rushing wind of the Holy Ghost to AWAKEN - AROUSE - cause to be ALERT\r\n\r\n3. **The South Wind Brings Warm Air**\r\n\r\n- The South Wind and the warm rain causes GROWTH\r\n- \"that the spices thereof may flow out\"\r\n\r\n4. **Notice the Order**: North Wind, then the South Wind\r\n\r\n- A Planting then a Harvest: Harvest Time, There needs to be Maturity\r\n- **Desert of Maine** - Rock, Sand - no life - Overplanting and abuse - the wind blows\r\n\r\n5. **That the spices thereof may flow out\"**\r\n\r\n(a) Spices of Faith - Real Faith - No known until a trial - though he slay me, yet I'll trust him\r\n(b) Spices of Love - If we KNOW Him we WILL LOVE Him! - Know about HIM is different from knowing Him\r\n(c) Spices of Joy - salvation should be a joy - (if other things are coming out, not pleasing to Him)\r\n\r\n## The Prayer is for the Beloved to Visit\r\n\r\n(speaks of fellowship and acceptance)\r\n\r\n> Song of Solomon 4:16 &mdash;  ...  Let my beloved come into his garden, and eat his pleasant fruits.\r\n\r\n1. Notice it was HER garden, Now it is HIS garden\r\n\r\n- The moving and ministry of the Holy Ghost makes a change: We are not our own, we are His\r\n- It is His grace that makes us what we ought to be\r\n\r\n2. Let Him Eat\r\n\r\n- Let Him find satisfaction in what His grace has done in us.\r\n- Does He find pleasant fruits?\r\n- He will purge that it may bring forth MORE fruit!\r\n"},"type":"READ_MD_FILE"}