{"id":1175,"courseId":"stephen-reynolds-jr-sermon-outlines","tasks":[],"title":"WHEN THE LORD ASKS WHY","fileType":"md","value":{"path":"C:\\sites\\github\\courses\\stephen-reynolds-jr-sermon-outlines/when-the-lord-asks-why.md","raw":"# When the Lord Asks \"Why?\"\"\r\n\r\n## Introduction\r\n\r\n1. Men Ask Why\r\n \t- Of the Lord\r\n\r\n> Psalms 10:1 &mdash; Why standest thou afar off, O LORD? why hidest thou thyself in times of trouble?\r\n\r\n\r\n> Mark 15:34 &mdash; And at the ninth hour Jesus cried with a loud voice, saying, Eloi, Eloi, lama sabachthani? which is, being interpreted, My God, my God, why hast thou forsaken me?\r\n\r\n \t- Of Each Other\r\n\r\n > Exodus 14:5 &mdash; And it was told the king of Egypt that the people fled: and the heart of Pharaoh and of his servants was turned against the people, and they said, Why have we done this, that we have let Israel go from serving us?\r\n\r\n > Joshua 7:25 &mdash; And Joshua said, Why hast thou troubled us? the LORD shall trouble thee this day. And all Israel stoned him with stones, and burned them with fire, after they had stoned them with stones. [ASKING ACHAN]\r\n\r\n\tMy Children asking me Why - its an annoyance sometimes\r\n\t\r\n\t- Of Ourself\r\n\tWhy do we do what we do? Stop and Think\r\n\r\n> 2 Corinthians 13:5 &mdash; Examine yourselves, whether ye be in the faith; prove your own selves. Know ye not your own selves, how that Jesus Christ is in you, except ye be reprobates?\r\n\r\n2. The Lord Already Knows\r\n\r\n> John 2:23-25 &mdash; Now when he was in Jerusalem at the passover, in the feast day, many believed in his name, when they saw the miracles which he did. 24 But Jesus did not commit himself unto them, because he knew all men, 25 And needed not that any should testify of man: for he knew what was in man.\r\n\r\n\tIs it a hard question when God asks why?\r\n\tWhen God asks a question, it isn't for him but for me!\r\n\r\n3. Can I answer with the Word? (defended by the Word)\r\n\r\n\t- If I can't then its just an excuse\r\n\t- A people of principle, truth\r\n\t- The Very pillar and ground of the truth is the church\r\n\r\n> 1 Timothy 3:15 &mdash; But if I tarry long, that thou mayest know how thou oughtest to behave thyself in the house of God, which is the church of the living God, the pillar and ground of the truth.\r\n\r\n## I. Why Did You Lie to the Holy Ghost\r\n\r\n> Acts 5:3,4 &mdash; But Peter said, Ananias, **why** hath Satan filled thine heart to lie to the Holy Ghost, and to keep back part of the price of the land? 4. Whiles it remained, was it not thine own? and after it was sold, was it not in thine own power? **why hast thou conceived this thing in thine heart?** thou hast not lied unto men, but unto God.\r\n\r\n- Have I lied to the Holy Ghost?\r\n- \r\n\r\n## II. Why are you angry?\r\n\r\nAnd the Lord said unto Cain, Why art thou wroth? and why is thy countenance fallen? Genesis 4:6 KJV\r\n\r\nLeads to: what have you done?\r\n\r\n> Genesis 4:10 &mdash; And he said, What hast thou done? the voice of thy brother's blood crieth unto me from the ground.\r\n\r\n## III. Why are You Sliding Back?\r\n\r\n> Jeremiah 8:5 &mdash; Why then is this people of Jerusalem slidden back by a perpetual backsliding? they hold fast deceit, they refuse to return.\r\n\r\n## IV. Why are you troubled (Jesus)?\r\n\r\nJesus appeared to the 11 after his Resurrection?\r\n\r\n> Luke 24:38 &mdash; And he said unto them, Why are ye troubled? and why do thoughts arise in your hearts? \r\n\r\nJohn 14:1 &mdash; Let not your heart be troubled: ye believe in God, believe also in me."},"type":"READ_MD_FILE"}