{"id":123,"courseId":"book-of-revelation","tasks":[],"title":"REV 057 BINDING AND LOOSING OF SATAN","fileType":"md","value":{"path":"C:\\sites\\github\\courses\\book-of-revelation/rev-057-binding-and-loosing-of-satan.md","raw":"#Binding for 1000 Years and Loosing of Satan\r\n\r\ntext: Revelation 20:1-3, 7-10\r\n\r\n##Satan Sealed in a Bottomless Pit (vs. 1-3)\r\n\r\nRe 20:1 And I saw an angel come down from heaven, having the key of the bottomless pit and a great chain in his hand.\r\n2 And he laid hold on the dragon, that old serpent, which is the Devil, and Satan, and bound him a thousand years,\r\n3 And cast him into the bottomless pit, and shut him up, and set a seal upon him, that he should deceive the nations no more, till the thousand years should be fulfilled: and after that he must be loosed a little season.\r\n\r\n##Souls Living and Reigning with Christ 1000 Years (vs. 4-6)\r\n\r\n(covered in future lesson)\r\n\r\n##Following the 1000 Years (vs. 7-10)\r\n\r\nAfter the 1000 year reign, the devil be released, deceive the nations and finally face his doom.\r\n\r\n### Satan will be released for a season (vs. 7)\r\n\r\nSatan is loose, will then be bound, but released again and then punished. It seems like a great pity after 1,000 year of peace for the devil to be released, but it will be necessary. Verse 3 says that he \"MUST BE LOOSED\". There are three perspectives to consider when tackling this mystery.\r\n\r\n####The Perspective of the Devil\r\n\r\nIt will prove that no matter how much time goes by and opportunity given him, he will always be the devil. He doesn't improve. It will be righteous to judge him eternally.\r\n\r\n####The Perspective of Humanity\r\n\r\nThe nations during this 1,000 years need the grace and help of God, just as much as anyone. The loosing of the devil will prove that man's hasn't changed. The devil will still be deceiving and humanity that does not lean hard on God will still be deceived.\r\n\r\n####The Perspective of God\r\n\r\nGod will have exhausted every measure of grace throughout the dispensations of time. An eternal hell would not be justified for a loving God, unless He first extended every possible invitation. (He tried everything and gave His best.) There will be no regrets or \"what if God had done something differently\" in eternity.\r\n\r\n### Satan will deceive the nations (vs. 8)\r\n\r\nHe deceives the nations and terrible disaster ensues. It is the devil who has opened \"Pandora's Box\".\r\n\r\n### Satan will face his doom (vs. 9-10)\r\n\r\nHell was specially prepared for the devil. Mathew 25:41\r\n\r\n##Great White Throne Judgment (vs. 11-15)\r\n\r\n(covered in future lesson)"},"type":"READ_MD_FILE"}