{"id":1256,"courseId":"tabernacle","tasks":[],"title":"110 BRAZEN ALTAR 1","fileType":"md","value":{"path":"C:\\sites\\github\\courses\\tabernacle/110_brazen-altar-1.md","raw":"# Lesson #11 Altar of Burnt Offering, Exodus 27:1-8\r\n\r\n## Introduction\r\n\r\n> Exodus 27:1-8 &mdash; And thou shalt make an altar of shittim wood, five cubits long, and five cubits broad; the altar shall be foursquare: and the height thereof shall be three cubits. 2 And thou shalt make the horns of it upon the four corners thereof: his horns shall be of the same: and thou shalt overlay it with brass. 3 And thou shalt make his pans to receive his ashes, and his shovels, and his basins, and his fleshhooks, and his firepans: all the vessels thereof thou shalt make of brass. 4 And thou shalt make for it a grate of network of brass; and upon the net shalt thou make four brazen rings in the four corners thereof. 5 And thou shalt put it under the compass of the altar beneath, that the net may be even to the midst of the altar. 6 And thou shalt make staves for the altar, staves of shittim wood, and overlay them with brass. 7 And the staves shall be put into the rings, and the staves shall be upon the two sides of the altar, to bear it. 8 Hollow with boards shalt thou make it: as it was showed thee in the mount, so shall they make it.\r\n\r\n(Exodus 38:1-7; Leviticus 17:11; Hebrews 9:22)\r\n\r\nThe Brazen Altar was the foundation of the whole worship of Israel. There was no approach to God and no worship accepted by by way of the Altar of the blood Atonement. The Brazen Altar was the first object seen upon entering the Outer Court of the Tabernacle. It is a remarkable type of Jesus Christ in His person and His sacrificial work.\r\n\r\n## Names Given to the Altar\r\n\r\n1. Altar of Shittim Wood, Exodus 27:1\r\n2. The Brazen/Bronze Altar, Exodus 38:30\r\n3. \"The Altar\" by way of pre-eminance, Exodus 29:12\r\n4. Altar of Burnt Offering, Exodus 35:16\r\n5. The Altar that is by the Door of the Tabernacle, Leviticus 1:5\r\n6. My Altar, The Table of the Lord, Malachi 1:7; Lev. 21:6,22\r\n7. Altar of the Lord, Malachi 2:13\r\n\r\n## Materials Used in the Construction of the Altar\r\n\r\nBoth Shittim Wood and Brass (explained later) were used in constructing the Brazen Altar. (Exodus 27:1,2)\r\n\r\n1. Shittim Wood\r\n\r\nShittim or Acacia was a desert growth. This is a type of the flesh and humanity.\r\n\r\n> Isaiah 53:2 &mdash; For he shall grow up before him as a tender plant, and as a root out of a dry ground: he hath no form nor comeliness; and when we shall see him, there is no beauty that we should desire him. \r\n\r\nIt was necessary that Christ should become incarnate.\r\n\r\n> Hebrews 10:5,10 &mdash; Wherefore when he cometh into the world, he saith, Sacrifice and offering thou wouldest not, but a body hast thou prepared me: 10 By the which will we are sanctified through the offering of the body of Jesus Christ once for all. \r\n\r\n2. Brass/Bronze\r\n\r\n- Brass\r\n\r\n> Deuteronomy 8:7-9 &mdash; For the LORD thy God bringeth thee into a good land, a land of brooks of water, of fountains and depths that spring out of valleys and hills; 8 A land of wheat, and barley, and vines, and fig trees, and pomegranates; a land of oil olive, and honey; 9 A land wherein thou shalt eat bread without scarceness, thou shalt not lack any thing in it; a land whose stones are iron, and out of whose hills thou mayest dig brass.\r\n\r\n> Job 28:1,2 &mdash; Surely there is a vein for the silver, and a place for gold where they fine it. 2 Iron is taken out of the earth, and brass is molten out of the stone. \r\n\r\nWhen the children of Israel were asked to give in the building of the Tabernacle, they gave from what they had received from the spoils given them by the Egyptians, and they had given so much that they were commanded to stop giving. Out of the abundance of what they gave was Bronze. A total of 6,700 lbs. of bronze was given.\r\n\r\n- BRASS (or is it BRONZE?) IN THE BIBLE\r\n\r\nIn ancient Israel there was no such metal known as brass. During Bible times bronze was an alloy of copper and tin and was used to an enormous extent.\r\n\r\nAT THE PRESENT: The term BRASS is applied to an alloy having copper (55%-90%) and zinc (10%-45%) as its essential components. Modern Bronze is an alloy of copper, tin, zinc, phosphorus, and sometimes small amounts of other elements. Bronzes are harder than brasses.\r\n\r\nIN THE KING JAMES VERSION:  The term translated BRASS could be more accurately translated BRONZE, since the alloy used was copper and tin (Ex 27:4). In some Scriptures just copper is meant (as in Deut 8:9 where a mineral not an alloy is intended). The one Hebrew word for copper and bronze was rendered brass by the King James translators because at that time the word BRONZE had not yet been introduced into the English language. BRASS appears in the English Bible, referring to either pure copper or to an alloy of copper and tin.\r\n\r\n- Judgment\r\n\r\nThe main use for the 6,700 lbs. of bronze was in the tabernacle furniture within the outer court, in the places where exceptional strength and heat resistance was important. Bronze has a melting point of 1,985 degrees. Since the altar was a place where intense heat was present it was overlaid with bronze. \r\n\r\nBronze represents Divine judgment. When Moses raised the bronze serpent (Numbers 21:9) it spoke of the power of the serpent being judged through the raising of the Son of God (John 3:14).\r\n\r\n- Firm and Enduring\r\n\r\n\"Bronze,\" is used in Scripture as the symbol of what is firm, stubborn, strong and enduring, thus we see \"gates of bronze\" (Ps 107:16), \"hoofs of bronze\" (Mic 4:13), etc. Is is mentioned in reference to people and cities.\r\n\r\nBronze typifies the divine character of Christ who took upon Himself the fire of God's wrath, holiness and justice by becoming a sin offering.\r\n\r\n> 2 Cor 5:21 &mdash; For he hath made him to be sin for us, who knew no sin; that we might be made the righteousness of God in him.\r\n\r\n> Matthew 27:46 &mdash; And about the ninth hour Jesus cried with a loud voice, saying, Eli, Eli, lama sabachthani? that is to say, My God, my God, why hast thou forsaken me? \r\n\r\ncontinued next: \r\n\r\n## Dimensions of the Altar\r\n## Horns of the Altar\r\n## Vessels of the Altar\r\n## Grate of the Altar\r\n## Fire of the Altar"},"type":"READ_MD_FILE"}