{"id":1258,"courseId":"tabernacle","tasks":[],"title":"112 BRAZEN ALTAR 3","fileType":"md","value":{"path":"C:\\sites\\github\\courses\\tabernacle/112_brazen-altar-3.md","raw":"# Lesson #11 Altar of Burnt Offering, Exodus 27:1-8\r\n\r\n## Introduction (REVIEW)\r\n\r\nThere was no approach to God and no worship accepted but by way of the Altar of the blood Atonement. It is a remarkable type of Jesus Christ in His person and His sacrificial work.\r\n\r\n## Names Given to the Altar (REVIEW)\r\n\r\n## Materials Used in the Construction of the Altar (REVIEW)\r\n\r\n1. Shittim Wood (This is a type of the flesh and humanity. It was necessary that Christ be made flesh.)\r\n2. Brass/Bronze (Judgment of God and the Endurance of Christ to Withstand the heat.)\r\n\r\n## Dimensions of the Altar (REVIEW)\r\n\r\nThe Altar of Burnt Offering was seven and a half feet in length and breadth and four and a half feet in height. It was twice the length and height of the Ark of the Covenant. **It had capacity enough to contain all the other vessels of the sanctuary**.\r\n\r\n## Horns of the Altar (REVIEW)\r\n\r\n- Might, The Gospels Influence, For Binding the Sacrifice, Refuge for the Sincere (not the presumptous, Outward ordinances will avail nothing)\r\n\r\n## Vessels of the Altar\r\n\r\n> Exodus 27:3 &mdash; And thou shalt make his pans to receive his ashes, and his shovels, and his basins, and his fleshhooks, and his firepans: all the vessels thereof thou shalt make of brass.\r\n\r\nAll of the vessels of the altar were made of Brass &mdash; a type of judgment. \r\n\r\n- 1. The **Pans** to receive the ashes\r\n\r\nGreat care was bestowed upon these ashes. They were not taken outside the camp and thrown anywhere, but only in a clean place. They were precious because they spoke of Gods acceptance.\r\n\r\nAshes are also a symbol of complete destruction, that is why people would sit in ashes and pour ashes on their head, or clothe themselves in sackcloth and ashes as a sign of grief and mourning.\r\n\r\nAshes were also for cleansing and purification:\r\n\r\n> Numbers 19:17 &mdash;  And for an unclean person they shall take of the ashes of the burnt heifer of purification for sin, and running water shall be put thereto in a vessel:\r\n\r\n- 2. The **Shovels** were used to clear away the ashes from the altar and place them into the pan and to remove the fire from the Brazen Altar to censers or fire pans.\r\n\r\n- 3. The **Basins** to Receive the Blood from the sacrifice offered.\r\n\r\nThe priest would catch the blood in a basin and used it for the sprinkling and for the pouring out at the bottom of the altar.\r\n\r\n- 4. The **Flesh Hooks** for placing the pieces of the offering in order on the altar and arranging them so as to be consumed. (1 Samuel 2:13)\r\n\r\n- 5. The **Censers**  or **Fire Pans** were used to hold the burning coals from the Altar of the Burnt Offering to be carried to the Altar of Incense in the Holy Place.\r\n\r\n## Grate of the Altar\r\n\r\n> Exodus 27:4,5 &mdash; 4 And thou shalt make for it a grate of network of brass; and upon the net shalt thou make four brazen rings in the four corners thereof. 5 And thou shalt put it under the compass of the altar beneath, that the net may be **even to the midst of the altar**. \r\n\r\nThe Brazen Altar was hollow, but on the inside half way from the top was a grating or network of Brass upon which the sacrifices were laid. The grating was the exact height of the Mercy Seat (Half way of 3 cubits = 1.5 cubits). There can be no mercy ministered to us apart from the blood sacrifice. The vilest sinner can obtain mercy through the blood. Even the \"good person\", if they reject the blood, can claim no mercy. \r\n\r\nGod is Equal in Mercy and Judgment (Ps 101:1; Rom 11:22).\r\n\r\n## Fire of the Altar\r\n\r\n- The fire on the Altar was first kindled by God.\r\n\r\n> Leviticus 9:24 &mdash; And there came a fire out from before the LORD, and consumed upon the altar the burnt offering and the fat: which when all the people saw, they shouted, and fell on their faces.\r\n\r\n- Strange Fire is a Counterfeit fire that emanates from some other source than God. Divine Fire consumes all such other fires!\r\n\r\nNadab and Abihu offered strange fire in Leviticus 10:1,2.\r\n\r\n- It was never to go out as a type of Christ our continual sacrifice.\r\n\r\n> Leviticus 6:12,13 &mdash; And the fire upon the altar shall be burning in it; it shall not be put out: and the priest shall burn wood on it every morning, and lay the burnt offering in order upon it; and he shall burn thereon the fat of the peace offerings. 13 The fire shall ever be burning upon the altar; it shall never go out. \r\n\r\n- Fire is a symbol of God's Holiness. \r\n\r\nFire symbolical of God's Holiness is expressed in 3 ways:\r\n\r\n1. CONDEMNATION - Genesis 19:24\r\n2. PURIFICATION - Mal. 3:2,3; Matthew 3:11,12\r\n3. APPROVAL - Exodus 3:3; Lev. 9:24; 1 Kings 18:38; Acts 2:3"},"type":"READ_MD_FILE"}