{"id":126,"courseId":"book-of-revelation","tasks":[],"title":"REV 060 CHAPTER 21","fileType":"md","value":{"path":"C:\\sites\\github\\courses\\book-of-revelation/rev-060-chapter-21.md","raw":"# New Heaven and New Earth\r\n\r\nTEXT: Revelation 21\r\n\r\n>Revelation 21:1&mdash;And I saw a new heaven and a new earth: for the first heaven and the first earth were passed away; and there was no more sea.\r\n\r\n## Introduction\r\n\r\nJohn sees that there will be a new heaven and a new earth and then he describes in awesome detail, \"New Jerusalem\".\r\n\r\nJohn applies the descriptions of walls, gates, a tabernacle and foundations and even calls what he sees in a lot of places a \"city\". But, John also compares what he sees with \"a bride adorned\" and names it in one place \"the lamb's wife\".\r\n\r\nJohn describes what he sees coming out of heaven from God as a \"holy city\", \"new Jerusalem\", \"as a bride adorned\", \"tabernacle of God\", \"great city\", \"holy Jerusalem\", \"the Bride\" and \"the Lamb's Wife\".\r\n\r\nWho or what is this \"city\" like? Is it a place or a person? (vs. 9) In order to understand this \"great city\", we must carefully consider the details as John laid them out for us.\r\n\r\n## The End and The Beginning (vs. 1-8)\r\n\r\nThe \"end\" John sees is not an \"extinction\" but a transition&mdash; made new!\r\n\r\n### First Glimpse (vs. 1,2)\r\n\r\nHeaven and Earth. John's first impression is that he is seeing something somewhat familiar, and yet it is altogether different. He says he sees a \"new earth\" and yet it is an earth with no sea. He says he sees a \"new heaven\" and yet it is a heaven where the veil between it and earth is removed.\r\n\r\nThen John sees another \"new\" thing. It is New Jerusalem coming down from God out of heaven like as if it were a \"young married or betrothed woman\" who is ready for her husband as she has put everything in proper order and is beautifully decorated. \r\n\r\n### A Proclamation (vs. 3-8)\r\n\r\nThe great voice (THE Voice!) proclaims what God is going to do.\r\n\r\n#### Dwell with Men (vs. 3)\r\n\r\nNotice that New Jerusalem comes \"down from God\" and from \"out of heaven\" in verse 2. This is not a description of God's people finally going to heaven to be with God or \"men with God\". What John sees is more accurately understood as \"God with men\".\r\n\r\n> Revelation 21:3&mdash;Behold, the tabernacle of God is with men, and he will dwell with them, and they shall be his people, and God himself shall be with them, and be their God.\r\n\r\n#### Bring an End to Former Things (vs. 4-8)\r\n\r\n> Revelation 21:6&mdash;And he said unto me, **It is done**. I am Alpha and Omega, the beginning and the end&hellip; \r\n\r\nThere are many awesome advantages to this new arrangement:\r\n\r\n1. No More Tears\r\n2. No More Death\r\n3. No More Sorrow or Crying\r\n4. No More Pain\r\n5. No More Thirst\r\n6. No More Battles\r\n7. No More Unbelief\r\n\r\n## A Tour of New Jerusalem (vs. 9-27)\r\n\r\n> 9 And there came unto me one of the seven angels which had the seven vials full of the seven last plagues, and talked with me, saying, Come hither, \r\n\r\nI will shew thee the bride, the Lamb's wife.\r\n\r\n### The Vantage Point (vs. 10)\r\n\r\n#### In the Spirit\r\n\r\n> And he carried me away in the spirit\r\n\r\n#### A Great and High Mountain\r\n\r\n> to a great and high mountain, \r\n\r\n### The Descriptions (vs. 10-\r\n\r\n1. A City (vs. 10)\r\n\r\nand shewed me that great city, the holy Jerusalem, \r\n\r\n2. Comes out of Heaven from God (vs. 10)\r\ndescending out of heaven from God,\r\n\r\n3. Having the Glory of God (vs. 11)\r\n11 Having the glory of God: and her light was like unto a stone most precious, even like a jasper stone, clear as crystal;\r\n\r\n4. 12 Gates, 12 Angels and 12 Names (vs 12,13,21, 25-27)\r\n\r\nand had twelve gates, and at the gates twelve angels, and names written thereon, which are the names of the twelve tribes of the children of Israel:\r\n 13 On the east three gates; on the north three gates; on the south three gates; and on the west three gates.\r\n\r\n21 And the twelve gates were twelve pearls; every several gate was of one pearl: and the street of the city was pure gold, as it were transparent glass.\r\n\r\nALL MAY BE SAVED\r\n\r\n25 And the gates of it shall not be shut at all by day: for there shall be no night there.\r\n 26 And they shall bring the glory and honour of the nations into it.\r\n 27 And there shall in no wise enter into it any thing that defileth, neither whatsoever worketh abomination, or maketh a lie: but they which are written in the Lamb's book of life.\r\n\r\n5. A Wall with 12 Foundations (vs. 12,14-20)\r\n12 And had a wall great and high, \r\n\r\n- 12 Foundations\r\n\r\n 14 And the wall of the city had twelve foundations, and in them the names of the twelve apostles of the Lamb.\r\n\r\n- Measuring the Wall\r\n\r\n 15 And he that talked with me had a golden reed to measure the city, and the gates thereof, and the wall thereof.\r\n 16 And the city lieth foursquare, and the length is as large as the breadth: and he measured the city with the reed, twelve thousand furlongs. The length and the breadth and the height of it are equal.\r\n 17 And he measured the wall thereof, an hundred and forty and four cubits, according to the measure of a man, that is, of the angel.\r\n\r\n 18 And the building of the wall of it was of jasper: and the city was pure gold, like unto clear glass.\r\n 19 And the foundations of the wall of the city were garnished with all manner of precious stones. \r\n\r\n> In the heavenly city we have harmony, not monotony; variety, not sameness; unity, not uniformity. The stones are not arranged in the order of the high priest&apos;s breastplate, but according to their various shades of colour, beginning from the foundation.&mdash;Ellicott's Commentary for English Readers \r\n\r\nNOTE: The following are merely educated guesses as to the actual gems referred to in Revelation 21.\r\n\r\n1.**Jasper**, dark opaque green.\r\n\r\n2.**Sapphire**, Lapis-lazuli, opaque blue.\r\n\r\n3.**Chalcedony**, an Emerald of a greenish hue.\r\n\r\n4.**Emerald/Smaragdus**, bright transparent green.\r\n\r\n5.**Sardonyx**, white and red.\r\n\r\n6.**Sardius**, bright red.\r\n\r\n7.**Chrysolite**, our Topaz, bright yellow.\r\n\r\n8.**Beryl**, bluish green.\r\n\r\n9.**Topaz**, or Peridot, yellowish green.\r\n\r\n10.**Chrysoprasus**, a darker shade of the same colour.\r\n\r\n11.**Jacinth/Hyacinthus**, Sapphire, sky blue.\r\n\r\n12.**Amethyst**, violet.\r\n \r\n6. The Lamb of God\r\n\r\nThe Lamb is the Temple\r\n\r\n> 22 And I saw no temple therein: for the Lord God Almighty and the Lamb are the temple of it.\r\n\r\nThe Lamb is the Light\r\n\r\n> 23 And the city had no need of the sun, neither of the moon, to shine in it: for the glory of God did lighten it, and the Lamb is the light thereof. 24 And the nations of them which are saved shall walk in the light of it: and the kings of the earth do bring their glory and honour into it."},"type":"READ_MD_FILE"}