{"id":1262,"courseId":"tabernacle","tasks":[],"title":"ALTAR OF INCENSE","fileType":"md","value":{"path":"C:\\sites\\github\\courses\\tabernacle/altar-of-incense.md","raw":"# Oil for the Lamp , Exodus 27:20,21\r\n\r\n> Exodus 27:20,21 And thou shalt command the children of Israel, that they bring thee pure oil olive beaten for the light, to cause the lamp to burn always. 21 In the tabernacle of the congregation without the vail, which is before the testimony, Aaron and his sons shall order it from evening to morning before the LORD: it shall be a statute for ever unto their generations on the behalf of the children of Israel.\r\n\r\n# High Preists Garments, Exodus 28:1-39\r\n\r\n# Aaron's Sons Garments, Exodus 28:40-43\r\n\r\n# Priests Hallowed for Service, Exodus 29:1-37\r\n\r\n# A Daily and Continual Burnt Offering, Exodus 29:38-46\r\n\r\n# Altar of Incense, Exodus 30:1-10; 37:25-29\r\n\r\n## Introduction\r\n\r\n> Revelation 8:4 And the smoke of the incense, which came with the prayers of the saints, ascended up before God out of the angel's hand.\r\n\r\nSometimes called \"smoke\", but \"fragrance\" and \"aroma\" better describe the presence of the incense.\r\n\r\n> Psalm 141:1-2 &mdash; Lord, I cry unto thee: make haste unto me; give ear unto my voice, when I cry unto thee. 2 Let my prayer be set forth before thee as incense; and the lifting up of my hands as the evening sacrifice.\r\n\r\nThe sweet aroma of prayer. The Altar of incense was located in the Holy Place which was 15' wide by 15' high by 30' deep.\r\n\r\n> Exodus 30:1-10 &mdash; 1 And thou shalt make an altar to burn incense upon: of shittim wood shalt thou make it. 2 A cubit shall be the length thereof, and a cubit the breadth thereof; foursquare shall it be: and two cubits shall be the height thereof: the horns thereof shall be of the same. 3 And thou shalt overlay it with pure gold, the top thereof, and the sides thereof round about, and the horns thereof; and thou shalt make unto it a crown of gold round about. 4 And two golden rings shalt thou make to it under the crown of it, by the two corners thereof, upon the two sides of it shalt thou make it; and they shall be for places for the staves to bear it withal. 5 And thou shalt make the staves of shittim wood, and overlay them with gold. 6 And thou shalt put it before the vail that is by the ark of the testimony, before the mercy seat that is over the testimony, where I will meet with thee. 7 And Aaron shall burn thereon sweet incense every morning: when he dresseth the lamps, he shall burn incense upon it. 8 And when Aaron lighteth the lamps at even, he shall burn incense upon it, a perpetual incense before the LORD throughout your generations. 9 Ye shall offer no strange incense thereon, nor burnt sacrifice, nor meat offering; neither shall ye pour drink offering thereon. 10 And Aaron shall make an atonement upon the horns of it once in a year with the blood of the sin offering of atonements: once in the year shall he make atonement upon it throughout your generations: it is most holy unto the LORD. \r\n\r\n## Structure & Dimensions\r\n\r\nIt is called the \"golden altar\" as it was overlaid with gold and not to be confused with the much larger Altar of Burnt Offering located in the outer court which was overlaid with brass.\r\n\r\nThe Altar of incense  was made of acacia wood overlaid with pure gold. On top of the altar stood a censer or pan of pure gold which the \"burning coals\" from off the Brazen altar were placed.\r\n\r\n............\r\n\r\nThe horns at each corner were symbolic of power and the efficacy of prayer and worship. The horns pointed in four different directions: north, south, east, and west. (Jacob at Peniel Genesis 32:23-32; Moses Plead on behalf of Israel Exodus 32:11-13; Ezekiel prayed for Israel while among the captives.)\r\n\r\nIt was 18 inches by 18 inches by 36 inches tall to the base. \r\n\r\n\r\n\r\n## Two-Fold Type\r\n\r\n## The Incense\r\n\r\n# Atonement Money, Exodus 30:11-16\r\n"},"type":"READ_MD_FILE"}