{"id":1266,"courseId":"tabernacle","tasks":[],"title":"COURT AND GATE PROGRESSIVE EXPERIENCE","fileType":"md","value":{"path":"C:\\sites\\github\\courses\\tabernacle/court and gate progressive-experience.md","raw":"<!-- ### A Progressive Experience - Christian Growth -->\r\n\r\nTracing the Steps of a priest entering the tabernacle, we see a parrallell to the progressive experience (growth) of the Believer.\r\n\r\n1. At the Door (Seeker, Matthew 7:7 - Only Entrance)\r\n2. Brazen Altar (Saved, Ephesians 2:8)\r\n3. Laver (Sanctified, Ephesians 5:26)\r\n4. Holy Place (Service, Hebrews 9:6)\r\n5. Holy of Holies (Satisfaction, Hebrews 10:19)\r\n\r\nThe Christian experience is progressive.\r\n\r\n> Ephesians 4:11-16 &mdash; And he gave some, apostles; and some, prophets; and some, evangelists; and some, pastors and teachers; 12 For the perfecting of the saints, for the work of the ministry, for the edifying of the body of Christ: 13 Till we all come in the unity of the faith, and of the knowledge of the Son of God, unto a perfect man, unto the measure of the stature of the fulness of Christ: 14 That we henceforth be no more children, tossed to and fro, and carried about with every wind of doctrine, by the sleight of men, and cunning craftiness, whereby they lie in wait to deceive; 15 But speaking the truth in love, may grow up into him in all things, which is the head, even Christ: 16 From whom the whole body fitly joined together and compacted by that which every joint supplieth, according to the effectual working in the measure of every part, maketh increase of the body unto the edifying of itself in love.\r\n\r\nA Warning is given in Isiah 28:\r\n\r\n- Both Priest and People Drunk\r\n\r\nThe Instruction of those Drunk on Pleasure, and the Learning of the Rebellious\r\n\r\n> Isaiah 28:7 &mdash; But they also have erred through wine, and through strong drink are out of the way; the priest and the prophet have erred through strong drink, they are swallowed up of wine, they are out of the way through strong drink; they err in vision, they stumble in judgment. 8 For all tables are full of vomit and filthiness, so that there is no place clean.\r\n\r\nIn verses 9 & 10, the simple message is mocked. They complain that his instructions had been like a short lesson constantly repeated, as we instruct children -- By the PROPHETS. It is with scorn they speak of God's word. (Thus speak the ungodly to the godly prophet Isaiah...)\r\n\r\n> Isaiah 28:9-10 &mdash; Whom shall he teach knowledge? and whom shall he make to understand doctrine? them that are weaned from the milk, and drawn from the breasts. 10 For precept must be upon precept, precept upon precept; line upon line, line upon line; here a little, and there a little:\r\n\r\n> Gill's &mdash;  In the Hebrew text, is in a rhyming form, and were sung and drawled out by them, \"Tsau lotsau, Tsau lotsau, Kau lakau, Kau lakau\": this is all he can say to us, and we have from him:\r\n\r\n- BECAUSE THEY WOULD NOT HEAR\r\n- They responded sarcastically to Isaiah's rebukes\r\n- We are so smart and spiritually sophisticated and advanced that we can go on to deeper things\r\n- In their mocking of Isaiah's message, they actually pay him a great compliment. It is a beautiful thing for God's truth to be presented precept upon precept … line upon line … here a little, there a little. When the word of God is properly presented, there is something for both the simple and immature to receive, and also something for the great saint to rejoice in and be fed.\r\n- They will not profit from that which is intended for good, but will be ultimately taken captive.\r\n\r\n> Isaiah 28:11-13 &mdash; 11 For with stammering lips and another tongue will he speak to this people. 12 To whom he said, This is the rest wherewith ye may cause the weary to rest; and this is the refreshing: yet they would not hear. 13 But the word of the LORD was unto them precept upon precept, precept upon precept; line upon line, line upon line; here a little, and there a little; that they might go, and fall backward, and be broken, and snared, and taken.\r\n\r\nCONTRAST: \r\n- (stammering, another tongue) As the straightforward message is rejected, God will find another way to communicate to the hard-hearted. He will send unusual messengers to bring the word.\r\n- In verses 12 & 13, The Lord says he will continue to instruct them as they had said (line upon line), but now by JUDGMENT (Babylon) &mdash; instead of by the word of the PROPHET). \r\n- And not an overwhelming judgment all at once, but \"here a little and there a little.\" \r\n\r\n> 2 Timothy 3:7 &mdash; Ever learning, and never able to come to the knowledge of the truth. "},"type":"READ_MD_FILE"}