{"id":127,"courseId":"book-of-revelation","tasks":[],"title":"REV 061 HEAVEN","fileType":"md","value":{"path":"C:\\sites\\github\\courses\\book-of-revelation/rev-061-heaven.md","raw":"# Heaven\r\n\r\nText: Revelation 22:1-5\r\n\r\n> Revelation 22:1 And he shewed me a pure river of water of life, clear as crystal, proceeding out of the throne of God and of the Lamb. 2 In the midst of the street of it, and on either side of the river, was there the tree of life, which bare twelve manner of fruits, and yielded her fruit every month: and the leaves of the tree were for the healing of the nations. 3 And there shall be no more curse: but the throne of God and of the Lamb shall be in it; and his servants shall serve him: 4 And they shall see his face; and his name shall be in their foreheads. 5 And there shall be no night there; and they need no candle, neither light of the sun; for the Lord God giveth them light: and they shall reign for ever and ever.\r\n\r\n> John 14:1-3&mdash;Let not your heart be troubled: ye believe in God, believe also in me. 2 In my Father's house are many mansions: if it were not so, I would have told you. I go to prepare a place for you. 3 And if I go and prepare a place for you, I will come again, and receive you unto myself; that where I am, there ye may be also.\r\n\r\n## What is Heaven?\r\n\r\nHeaven is a Real Place. God created it as a place of His own beauty and perfect design.\r\n\r\n> Genesis 1:1&mdash;In the beginning God created the heaven and the earth.\r\n\r\nHeaven is not a state or condition of mind, heaven is not a myth or fairy tale, heaven is not imagination heaven is not fiction. Heaven is Real!\r\n\r\nJesus said it is is a \"**place**\" in John 14:2.\r\n\r\n- John 21:2 \"coming out of Heaven\"\r\n\r\n- Genes 28:17 Jacob\r\n- Deuteronomy 10:14 Moses\r\n\r\n## Where is Heaven?\r\n\r\nGenesis 1:1 -- HEBREW: meaning to be lofty; the sky (as aloft; the dual perhaps alluding to the visible arch in which the clouds move, as well as to the higher ether where the celestial bodies revolve\r\n\r\n> Psalm 103:11&mdash;Ps 103:11 For as the heaven is high above the earth, so great is his mercy toward them that fear him.\r\n\r\nHeaven is high above the earth.\r\nJob 26:7\r\n\r\nHeaven is in the north place. Isaiah 14:13\r\n\r\nHeaven is where God is. 1 Kings 8:30, Isiah 66:1\r\n\r\n## What is Heaven Like?\r\n\r\nHeaven belongs to God. (Genesis 14:19,22)\r\n\r\nRomans 14:17\r\n\r\n<!-- -->\r\n\r\n> Revelation 21:4 And God shall wipe away all tears from their eyes; and there shall be no more death, neither sorrow, nor crying, neither shall there be any more pain: for the former things are passed away.\r\n\r\n<!-- -->\r\n\r\nIsaiah 66:1&mdash;Thus saith the LORD, The heaven is my throne, and the earth is my footstool: where is the house that ye build unto me? and where is the place of my rest?\r\n\r\n<!-- -->\r\n\r\n> Job 3:17 There the wicked cease from troubling; and there the weary be at rest.\r\n\r\nno wicked, no sin, weary at rest Rev. 7:16-17; 21:4; 22:3\r\n\r\n<!-- -->\r\nHeaven is a happy place.\r\nPsalm 16:11\r\nLuke 15:7 Joy in heaven\r\n1 Cor. 2:9\r\n\r\nHeaven is a place of rewards. Matthew 5:12\r\n\r\nHeaven is a beautiful place (notice our text).\r\n\r\n## Who Will Go to Heaven?\r\n\r\nMatthew 5:3 the poor in spirit\r\nRomans 8:17\r\nRevelation 22:14\r\n\r\nNot Everyone is Going to Heaven Matthew 7:21; John 3:3; 1 Corinthians 6:9-10\r\n\r\n1Co 15:50 Now this I say, brethren, that flesh and blood cannot inherit the kingdom of God; neither doth corruption inherit incorruption.\r\n\r\nPhil. 3:21\r\n\r\n## Will We Know Anyone in Heaven?\r\n\r\n1 Corinthians 13:12 (different but yes)\r\n\r\n> Heaven wouldn't be home if we didn't know anyone. &mdashJames Reynolds, Sr.\r\n\r\nHeaven is a mystery now, but not then!\r\n\r\n## How do we Get to Heaven?\r\n\r\n> Matthew 18:3&mdash;And said, Verily I say unto you, Except ye be converted, and become as little children, ye shall not enter into the kingdom of heaven.\r\n\r\n<!-- -->\r\n\r\n> Matthew 19:23 hardly a rich man\r\n\r\n<!-- -->\r\n\r\n> John 14:6&mdash;Jesus saith unto him, I am the way, the truth, and the life: no man cometh unto the Father, but by me.\r\n\r\n## Hymn: THERE&apos;s NO DISAPPOINTMENT IN HEAVEN\r\n\r\n**Words**: Frederick M. Lehman, 1914; he wrote these words in Chicago, Illinois, while suffering financial reverses.\r\n\r\n**Music**: Frederick Lehman, harmony by his daughter Claudia L. Mays\r\n\r\n&quot;There&apos;s no disappointment in heaven,\r\n No weariness, sorrow or pain;\r\nNo hearts that are bleeding and broken,\r\n No song with a minor refrain.\r\nThe clouds of our earthly horizon\r\n Will appear in the sky,\r\nFor all will be sunshine and gladness,\r\n With never a tear nor a sigh.\r\nWe&apos;ll never pay rent for our mansion,\r\n The taxes will never come due;\r\nOur garments will never grow threadbare,\r\n But always be fadeless and new.\r\nWe&apos;ll never be hungry nor thirsty,\r\n Nor languish in poverty there,\r\nFor all the rich bounties of heaven\r\n His sanctified children will share.\r\nThere&apos;ll never be crepe on the door-knob,\r\n No funeral train in the sky;\r\nNo graves on the hillside of glory,\r\n For there we shall never more die.\r\nThe old will be young there forever,\r\n Transformed in a moment of time;\r\nImmortal we&apos;ll stand in his likeness\r\n The stars and the sun to outshine.\r\nI&apos;m bound for the beautiful city\r\n My Lord has prepared for His own;\r\nWhere all the redeemed of all ages\r\n Sing &quot;Glory&quot; around the white throne;\r\nSometimes I grow homesick for heaven,\r\n And the glories I there shall behold,\r\nWhat a joy it will be when My Savior I see,\r\n In that beautiful city of gold!&quot;\r\n"},"type":"READ_MD_FILE"}