{"id":1272,"courseId":"tabernacle","tasks":[],"title":"OIL AND INCENSE","fileType":"md","value":{"path":"C:\\sites\\github\\courses\\tabernacle/oil-and-incense.md","raw":"# Holy Anointing Oil, Exodus 30:22-33\r\n\r\n22 Moreover the LORD spake unto Moses, saying,\r\n23 Take thou also unto thee principal spices, of pure myrrh five hundred shekels, and of sweet cinnamon half so much, even two hundred and fifty shekels, and of sweet calamus two hundred and fifty shekels,\r\n24 And of cassia five hundred shekels, after the shekel of the sanctuary, and of oil olive an hin:\r\n25 And thou shalt make it an oil of holy ointment, an ointment compound after the art of the apothecary: it shall be an holy anointing oil.\r\n26 And thou shalt anoint the tabernacle of the congregation therewith, and the ark of the testimony,\r\n27 And the table and all his vessels, and the candlestick and his vessels, and the altar of incense,\r\n28 And the altar of burnt offering with all his vessels, and the laver and his foot.\r\n29 And thou shalt sanctify them, that they may be most holy: whatsoever toucheth them shall be holy.\r\n30 And thou shalt anoint Aaron and his sons, and consecrate them, that they may minister unto me in the priest's office.\r\n31 And thou shalt speak unto the children of Israel, saying, This shall be an holy anointing oil unto me throughout your generations.\r\n32 Upon man's flesh shall it not be poured, neither shall ye make any other like it, after the composition of it: it is holy, and it shall be holy unto you.\r\n33 Whosoever compoundeth any like it, or whosoever putteth any of it upon a stranger, shall even be cut off from his people.\r\n\r\n- Bezaleel's craftsmanship was called in, both for the composition of the holy oil and of the holy incense (Exodus 37:29).\r\n- To show the excellency of holiness, there was this spiced oil in the tabernacle, which was grateful to the sight and to the smell. \r\n\r\n- Ingredients: The holy anointing oil described in Exodus 30:22-25 was created from:\r\n\r\nPure myrrh (מר דרור mar deror) 500 shekels (about 6 kg)\r\nSweet cinnamon (קינמון בשם kinnemon besem) 250 shekels (about 3 kg)\r\nKaneh bosem (קְנֵה-בֹשֶׂם kaneh bosm) 250 shekels (about 3 kg)\r\nCassia (קדה kiddah) 500 shekels (about 6 kg)\r\nOlive oil (שמן זית shemen zayit) one hin (about 5 quarts according to Adam Clarke; about 4 liters according to Shiurei Torah, 7 liters according to the Chazon Ish)\r\n\r\n\r\n- Upon Man's flesh not poured \r\n\r\n- Matthew 7:6 Give not holy to dogs\r\n- Upon man's flesh shall it not be poured--i.e., it shall not be in ordinary use as an unguent--a mere \"man,\" who is not a priest, shall not apply it to his private use. It shall be reserved altogether for holy purposes.\r\n- Neither shall ye make any other like it, after the composition of it--i.e., after the recipe given -- no secular employment\r\n\r\nWhat about Aaron?\r\n\r\n- Upon man's flesh shall it not be poured,.... That is, not upon common men, or on men's flesh in common, as was usual at feasts and entertainments in the eastern countries, see Psalm 23:5 but this was not to be used on such occasions, otherwise it was poured on the flesh of some men, as Aaron and his sons, on whose head it was poured and ran down to the beard: \r\n\r\n- James 5:13,14\r\n- 1 John 2:27; John 14:26; 1 Thessalonians 4:9\r\n- 2 Corinthians 1:21\r\n\r\n# Holy Incense, Exodus 30:34-38\r\n\r\n34 And the LORD said unto Moses, Take unto thee sweet spices, stacte, and onycha, and galbanum; these sweet spices with pure frankincense: of each shall there be a like weight:\r\n35 And thou shalt make it a perfume, a confection after the art of the apothecary, tempered together, pure and holy:\r\n36 And thou shalt beat some of it very small, and put of it before the testimony in the tabernacle of the congregation, where I will meet with thee: it shall be unto you most holy.\r\n37 And as for the perfume which thou shalt make, ye shall not make to yourselves according to the composition thereof: it shall be unto thee holy for the LORD.\r\n38 Whosoever shall make like unto that, to smell thereto, shall even be cut off from his people.\r\n\r\n\r\n> Song of Solomon 1:3 1 &mdash;\r\n\r\n<!-- -->\r\n\r\n> Exodus 7:1 &mdash;\r\n\r\n-  A confection after the art of the apothecary ( in the manner they beat, compound, and mix several ingredients together: ). Like the holy oil, the incense was to be artistically compounded by one accustomed to deal with such ingredients. It was actually, in the first instance, the work of Bezaleel (Exodus 27:29).\r\n\r\n- in all sacrifices salt was used, and every spiritual sacrifice of ours should be seasoned with grace: (Colossians 4:6)\r\n\r\n# Craftsmen Called to Make, Exodus 31:1-11\r\n\r\n# Sabbaths, Exodus 31:13-17\r\n\r\n# Tables of Stone & Communicating God's Will, Exodus 31:18; 32; 33; 34; 35:1-19\r\n\r\n# The People Giving, Exodus 35:20-29\r\n\r\n# Bezaleel and Aholiab, Exodus 35:30-35; 36; 37; 38; 39\r\n\r\n# First Time the Tabernacle is Set Up, Exodus 40:1-33\r\n \r\n# Glory of the Lord Filled the Tabernacle, Exodus 40:34-38"},"type":"READ_MD_FILE"}