{"id":1293,"courseId":"through-the-bible-for-beginners","tasks":[],"title":"01 ASSESSMENT","fileType":"md","value":{"path":"C:\\sites\\github\\courses\\through-the-bible-for-beginners/01_assessment.md","raw":"# General Assessment\r\n\r\n::: quiz General Quiz of the Bible\r\n\r\n1. Who wrote the first four books of the New Testament?\r\n\tMatthew, Mark, Luke, and John.\r\n\r\n2. Who wrote the first five books of the Old Testament?\r\n\tMost conservative scholars hold that the Pentateuch was written by Moses.\r\n\r\n3. What two Old Testament books are named after women?\r\n\tEsther and Ruth.\r\n\r\n4. What are the Ten Commandments?\r\n\tHave no other gods before Me. Do no make idols. Do not misuse the name of the Lord your God. Remember the Sabbath day by keeping it holy. Honor your father and your mother. Do not murder. Do not commit adultery. Do not steal. Do not give false testimony. Do not covet. Exodus 20:2-17\r\n\r\n5. What is the Greatest Commandment?\r\n\t'Love the Lord your God with all your heart and with all your soul and with all your mind.' (Matthew 22:37,38)\r\n\r\n6. What is the second Greatest Commandment?\r\n\t'Love your neighbor as yourself.' (Matthew 22:39)\r\n\r\n7. What is the Golden Rule?\r\n\t'Do unto others as you would have them do unto you.' (Matthew 7:12)\r\n\r\n8. What is the Great Commission?\r\n\t'Therefore, go and make disciples of all nations, baptizing them in the name of the Father and of the Son and of the Holy Spirit, and teaching them to obey everything I have commanded you. And surely I will be with you always, to the very end of the age.' (Matthew 28:19,20)\r\n\t\r\n9. What was the test of a prophet, to know that he was truly from God?\r\n\tHe had to be 100% accurate in his prophecies. The penalty for a false prophet was death by stoning. (Deuteronomy 18:20-22)\r\n\r\n10. To whom did God give the 10 Commandments?\r\n\tMoses. (Exodus 20)\r\n\r\n11. Which two people did not die in the Bible?\r\n\tEnoch and Elijah. Genesis 5:24 says that Enoch, who was Noah’s great-grandfather, 'walked with God; then he was no more, because God took him away.' The other was the Old Testament prophet Elijah, who was taken up to heaven in a whirlwind with a chariot and horses of fire. (2 Kings 2:11)\r\n\t\r\n12. What is the root of all kinds of evil?\r\n\tThe love of money. (1 Timothy 6:10)\r\n\r\n13. What is the beginning of wisdom?\r\n\tThe fear of the Lord. (Psalm 111:10)\r\n\r\n14. Who delivered the Sermon on the Mount?\r\n\tThe Lord Jesus. (Matthew 5-7)\r\n\r\n15. How did sickness and death enter the world?\r\n\tRomans 5:12 says that sin entered the world though one man, and death through sin. The fall of man is recorded in Genesis 3, where God's perfect creation was spoiled by Adam's sin.\r\n\r\n16. Who was the Roman governor who sentenced Christ to death?\r\n\tPontius Pilate. (Matthew 27:26)\r\n\r\n17. Who are the major prophets?\r\n\tIsaiah, Jeremiah, Ezekiel, and Daniel.\r\n\r\n18. What group of people is the Old Testament about?\r\n\tThe Hebrews, who became the nation of Israel. They were descendants of Abraham though Isaac.\r\n\r\n19. What happened while the Lord Jesus was in the desert for 40 days? He was tempted by the devil.\r\n\t(Matthew 4:1) Hebrews 4:15 tells us that He was tempted in every way, just as we are - yet was without sin.\r\n\r\n20. How many people were on Noah’s ark?\r\n\tEight: Noah and his wife, his three sons Shem, Ham, and Japheth, and their wives. (Genesis 7:13, 1 Peter 2:5)\r\n\r\n21. Who was the first murderer?\r\n\tCain, who killed his brother Abel. (Genesis 4:8)\r\n\r\n22. Which person was afflicted with terrible trials but trusted God through it all?\r\n\tJob\r\n\r\n23. Who was Israel’s most well-known and well-loved king?\r\n\tDavid. (1 Chronicles 29:28)\r\n\r\n24. Who was 'the weeping prophet?' \r\n\tJeremiah.\r\n\r\n25. Who was thrown into the lion’s den?\r\n\tDaniel. (Daniel 6)\r\n\r\n26. Who were the two people in the famous fight with a stone and a sling?\r\n\tDavid and Goliath. (1 Samuel 17)\r\n\r\n27. What is the book of Acts about?\r\n\tThe early years of the church, as the gospel begins to spread throughout the world. \"The Acts of the Holy Ghost Through the Apostles\".\r\n\r\n28. What are epistles?\r\n\tLetters.\r\n\r\n29. On what occasion was the Holy Spirit given to the church?\r\n\tPentecost. (Acts 2:1-4)\r\n\r\n30. Whom did God command to sacrifice his only son?\r\n\tAbraham. (Genesis 22:2)\r\n\r\n31. What was the Old Testament feast that celebrated God’s saving the firstborn of Israel the night they left Egypt?\r\n\tPassover. (Exodus 12:27)\r\n\r\n32. Who was the Hebrew who became prime minister of Egypt?\r\n\tJoseph. (Genesis 41:41)\r\n\r\n33. Who was the Hebrew woman who became Queen of Persia?\r\n\tEsther. (Esther 2:17)\r\n\r\n34. Who was the pagan woman who became David’s great-grandmother?\r\n\tRuth. (Ruth 4:17)\r\n\r\n35. Which angel appeared to Mary?\r\n\tGabriel. (Luke 1:26)\r\n\r\n36. How did the Lord Jesus die?\r\n\tHe gave up His life while being crucified. (John 19:18)\r\n\r\n37. What happened to Him three days after He died?\r\n\tHe was raised from the dead. (John 20)\r\n\r\n38. What happened to the Lord Jesus 40 days after His resurrection?\r\n\tHe ascended bodily into heaven. (Acts 1:9-11)\r\n\r\n39. What should we do when we sin, in order to restore our fellowship with God?\r\n\t1 John 1:9 tells us, 'If we confess our sins, He is faithful and just to forgive us our sins, and to cleanse us from all unrighteousness.'\r\n\r\n40. How did the universe and world get here?\r\n\tGenesis 1:1 tells us, 'In the beginning, God created the heavens and the earth.' We are told further in Colossians 1:16 and 17 that the Lord Jesus Christ was the one who did the creating.\r\n\r\n41. Where did Satan and the demons come from?\r\n\tSatan was originally the best and the brightest angel, but he sinned in his pride, wanting to be God. Some of the angels followed him, and these 'fallen angels' were cast out of heaven. (Isaiah 14, Ezekiel 28)\r\n\r\n42. Who directed the writing of the Bible?\r\n\tThe Holy Ghost. (2 Timothy 3:16, 2 Peter 1:21) About 40 people wrote the Bible as inspirited by the Holy Ghost.\r\n\r\n43. Where was the Lord Jesus before He was conceived in Mary?\r\n\tIn heaven. (Philippians 2:6-11, 1 Corinthians 15:49)\r\n\r\n44. What is sin?\r\n\tSin is disobeying God. ( 1 John 3:4)\r\n\r\n45. What are parables?\r\n\tA short, simple story with a spiritual point. The Lord Jesus taught in parables. (Matthew 13:3)\r\n\r\n46. Which two animals talked with human speech?\r\n\tThe serpent in the Garden of Eden (Genesis 3:3) and Balaam’s donkey (Numbers 22:28).\r\n\r\n48. Which one of his sons succeeded David as king?\r\n\tSolomon. (2 Samuel 12:24)\r\n\r\n49. Who was the female judge of Israel?\r\n\tDeborah. (Judges 4:4)\r\n\r\n50. Who was the wisest man in the world?\r\n\tSolomon. (1 Kings 3:12)\r\n\r\n51. Who was the first man?\r\n\tAdam. (Genesis 2:20)\r\n\r\n51. Who was the most meekest man on earth? \r\n\tMoses. (Numbers 12:3)\r\n\r\n52. Who was the strongest man on earth? \r\n\tSamson. (Judges 13-16)\r\n\r\n53. Where were the two nations of God’s people taken into captivity? Israel to ... ? and Judah to ... ?\r\n\tIsrael was taken into Assyria (2 Kings 17:23), and Judah into Babylon (2 Chronicles 36:20).\r\n\r\n54. Which cupbearer to a foreign king rebuilt the wall of Jerusalem?\r\n\tNehemiah. (Nehemiah 2:5)\r\n\r\n55. Who were the two Old Testament prophets who worked miracles?\r\n\tElijah and Elisha. (1 Kings 17 – 2 Kings 6)\r\n\r\n56. Which Old Testament prophet spent three days in the belly of a great fish?\r\n\tJonah. (Jonah 1:17)\r\n\r\n57. What is the last book of the Old Testament?\r\n\tMalachi.\r\n\r\n58. For which Israelite commander did the sun stand still?\r\n\tJoshua. (Joshua 10)\r\n\r\n59. Who was the first king of Israel? \r\n\tSaul. (1 Samuel 13:1)\r\n\r\n60. Who built the temple in Israel? \r\n\tSolomon. (1 Kings 6)\r\n\r\n61. Which of the twelve tribes of Israel served as priests? \r\n\tLevites. (Deuteronomy 10:8)\r\n\r\n62. Which city fell after the Israelites marched around it daily for seven days?\r\n\tJericho. (Joshua 6:20)\r\n\r\n63. What did God give the Israelites to eat in the wilderness? \r\n\tManna and quail. (Exodus 16)\r\n\r\n64. Which two people walked on water? \r\n\tJesus and Peter. (Matthew 14:29)\r\n\r\n65. Who was the first martyr? \r\n\tStephen. (Acts 7)\r\n\r\n66. Who betrayed Jesus to the priests, and for how much? \r\n\tJudas betrayed Him for 30 pieces of silver, the price of a slave. (Matthew 26:14-15)\r\n\r\n67. What is the Lord’s Prayer?  \r\n\tOur Father which art in heaven, Hallowed be thy name. 10 Thy kingdom come. Thy will be done in earth, as it is in heaven.  11 Give us this day our daily bread.  12 And forgive us our debts, as we forgive our debtors.  13 And lead us not into temptation, but deliver us from evil: For thine is the kingdom, and the power, and the glory, for ever. Amen. (Matthew 6:9-13)\r\n\r\n68. Who was the first person to see Jesus after his Resurrection? \r\n\tMary Magdalene. (John 20:16)\r\n\r\n69. Which prophet and cousin of the Lord was beheaded? \r\n\tJohn the Baptist. (John 14:10)\r\n\r\n70. To what country did the young Jesus and His parents escape when Herod was threatening His life?\r\n\tEgypt. (Matthew 2:13-15)\r\n\r\n71. What was Christ’s first miracle? \r\n\tHe turned water into wine at the wedding at Cana. (John 2:11)\r\n\r\n72. Which one of the Lord’s personal friends did He raise from the dead?\r\n\tLazarus. (John 11)\r\n\r\n73. Who was the greatest missionary of the New Testament?\r\n\tPaul. (see book of Acts)\r\n\r\n74. Who was Paul’s first partner? \r\n\tBarnabas. (Acts 13:2)\r\n\r\n75. Whom did an angel release from prison? \r\n\tPeter. (Acts 12)\r\n\r\n76. Which event caused God to splinter human language into many tongues? \r\n\tThe building of the Tower of Babel. (Genesis 11)\r\n\r\n77. Which chapter of an Old Testament prophet’s book gives a detailed prophecy of the Messiah’s death by crucifixion? \r\n\tIsaiah 53.\r\n\r\n78. Who wrestled all night with the Lord and was left with a permanent limp? \r\n\tJacob. (Genesis 32:22-32)\r\n\r\n79. Who was hailed as a god when he was bitten by a snake but nothing bad happened?\r\n\tPaul. (Acts 28:5-6)\r\n\r\n80. Which two New Testament writers were brothers of the Lord Jesus?\r\n\tJames and Jude. (Matthew 13:55)\r\n\r\n81. Which two New Testament books were written by a doctor?\r\n\tLuke and Acts. (2 Timothy 4:11)\r\n\r\n82. Who had a coat of many colors?\r\n\tJoseph. (Genesis 37:3)\r\n\r\n83. In what sin did Aaron lead the Israelites while his brother Moses was up on the mountain talking to God?\r\n\tThey made an idol in the form of a golden calf. (Exodus 32)\r\n\r\n84. How many books are there in the entire Bible?\r\n\t66: 39 in the Old Testament, and 27 in the New Testament.\r\n\r\n85. What’s the difference between John the Baptist and the John who wrote several New Testament books?\r\n\tJohn the Baptist was a prophet who proclaimed the kingdom of God was near in preparation for his cousin Jesus’ ministry. The John who wrote the gospel of John, the epistles—1, 2 and 3 John—and Revelation, was one of the twelve apostles and one of those closest to the Lord, along with Peter and James. He called himself 'the disciple whom Jesus loved.'\r\n\r\n86. Who saw the Lord appear to him in a burning bush? \r\n\tMoses. (Exodus 3)\r\n\r\n87. How many sons did Jacob have? Twelve. \r\n\tThey were the ancestors of the twelve tribes of Israel. (Genesis 35:22)\r\n\r\n88. Who gave up his birthright for a bowl of stew? \r\n\tEsau. (Genesis 25:33)\r\n\r\n89. Which Psalm starts out, 'The Lord is my shepherd, I shall not want?' \r\n\tPsalm 23.\r\n\r\n90. Who disowned the Lord Jesus three times before a cock crowed?\r\n\tPeter. (Matthew 26:69-75)\r\n\r\n91. What did the Lord do just after the Last Supper to demonstrate His love and humility?\r\n\tHe washed the disciples’ feet. (John 13:5)\r\n\r\n92. Where is the New Testament 'Hall of Faith?'\r\n\tHebrews 11.\r\n\r\n93. Who appeared with the Lord Jesus in glory on the Mount of Transfiguration?\r\n\tElijah and Moses. (Mark 9:4)\r\n\r\n94. Who is the second Adam?\r\n\tThe Lord Jesus Christ. (1 Corinthians 15:45-49)\r\n\r\n95. Which Old Testament prophet married a prostitute because God told him to?\r\n\tHosea. (Hosea 1:2)\r\n\r\n96. What are the two sacred ordinances that the Lord commanded us to observe?\r\n\tBaptism (Matthew 28:19,20) and Communion, or the Lord’s Table (1 Corinthians 11:23-26).\r\n\r\n97. What are supernatural enablings that allow a believer to serve the Body of Christ with ease and effectiveness?\r\n\tSpiritual gifts. (Romans 12:6-8, 1 Corinthians 12, Ephesians 4:8-13, 1 Peter 4:10-11)\r\n\r\n98. Whose tomb was Christ buried in?\r\n\tJoseph of Arimathea. (Matthew 27:57-60)\r\n\r\n99. Who wrote the book of Hebrews?\r\n\tNobody knows for sure, but quite possibly Paul.\r\n\r\n100. What is the book of Revelation about?\r\n\tThe end of the world.\r\n\r\n101. Who is the bride of Christ?\r\n\tThe bride is a remnant of The Church. A part of the Body who are ready when he calls to the wedding. (Matthew 25)\r\n\t\r\n:::"},"type":"READ_MD_FILE"}