{"id":1349,"courseId":"through-the-psalms","tasks":[],"title":"08 CLASSIFICATION WISDOM","fileType":"md","value":{"path":"C:\\sites\\github\\courses\\through-the-psalms/08_classification_wisdom.md","raw":"&nbsp;\r\n<div class=\"fancy\"><span>Deliverance Center House of Prayer</span></div>\r\n\r\n# Psalms of Wisdom\r\n\r\n<p class=\"fancy\"><span>June 17, 2018</span></p>\r\n\r\n## Introduction\r\n\r\nIncluded in the Psalms of Wisdom are psalms: 1, 14, 37, 49, 52, 53, 73, 75, 91, 112, 119, 127, 128, 133, 139.\r\n\r\n**Psalms of Wisdom** emphasize:\r\n\r\n1. The teaching of the wise men of Israel\r\n2. meditation of the law\r\n3. the way of the righteous versus the way of the wicked\r\n4. The necessity of practical righteousness \r\n\r\nThese psalms are similar to Job, Proverbs,  and Ecclesiastes in terms of (1) literary structures, (2) vocabulary, and (3) concepts. They frequently deal with topics such as the injustices of life and the justice of God, the responsibilities of choosing the correct path or manner of living, the relative value of riches, and the fact that man is only a pilgrim or traveler passing through this life.\r\n\r\n(1) Literary Structure\r\n\r\nLament, acrostic structures, numerical sayings, and parrellism are all literary stuctures used in the psalms of wisdom and the other Biblical books of poetry. Parrellelism is one example of literary structure the psalms of wisdom share with the other Biblical books of poetry. Parallelism is a major characteristic of Hebrew poetry that can be understood as a balanced repetition:\r\n\r\n> Psalm 37:2 &mdash; For they shall soon be cut down like the grass, <br> and wither as the green herb.\r\n<!-- --- -->\r\n> Psalm 139:23 &mdash; Search me, O God, and know my heart: try me, and know my thoughts:\r\n\r\n(2) Vocabulary\r\n\r\nCommon vocabulary expressing lament, thanksgiving, and praise. As well as words related to wisdom, justice, truth, mercy and creation theology.\r\n\r\nShared truth concerning creation includes:\r\n\r\n1) God comes first. 2) God speaks. 3) God made everything. 4) There is one God who is good, and he made everything good. 5)  human beings are accountable to God and should praise Him as we are made by Him and for Him. 6) Hints of God’s complexity 7) human begins are introduced as made in the image of God. 8) there is stewardship over creation. 9) There is a kind of ordering and structure. 10) There is the doctrines of last things that is anticipated by the first things. 11) The beginning of Sabbath is bound up with God’s rest. 12) the greatness of God is testified by his creation. \r\n\r\n> Psalm 33:6 &mdash; By the word of the LORD were the heavens made; and all the host of them by the breath of his mouth.\r\n<!-- --- -->\r\n> Psalm 19:1,2 &mdash; The heavens declare the glory of God; and the firmament sheweth his handywork. 2 Day unto day uttereth speech, and night unto night sheweth knowledge.\r\n<!-- --- -->\r\n\r\n> Job 38:1,4 &mdash; Then the LORD answered Job out of the whirlwind, and said, 4 Where wast thou when I laid the foundations of the earth? declare, if thou hast understanding.\r\n \r\n<!-- --- -->\r\n> Proverbs 8:22 &mdash; 22 The LORD possessed me in the beginning of his way, before his works of old. 23 I was set up from everlasting, from the beginning, or ever the earth was.\r\n<!-- --- -->\r\n> Ecclesiastes 12:1 &mdash; Remember now thy Creator in the days of thy youth, while the evil days come not, nor the years draw nigh, when thou shalt say, I have no pleasure in them;\r\n\r\n(3) Concepts in Common\r\n\r\n- The Importance of Wisdom\r\n> Psalm 90:12 &mdash; So teach us to number our days, that we may apply our hearts unto wisdom.\r\n<!-- --- -->\r\n> Psalm 39:4 &mdash; \r\n<!-- --- -->\r\n> Proverbs 4:7 &mdash; \r\n<!-- --- -->\r\n> Job 28:28 &mdash;\r\n\r\n- Wisdom is a Walk\r\n> Psalm 139:24 &mdash; And see if there be any wicked way in me, and lead me in the way everlasting.\r\n <!-- --- -->\r\n> Psalm 143:10 &mdash; \r\n<!-- --- -->\r\n> Proverbs 28:26 &mdash; \r\n\r\n- Why a just God allows the innocent to suffer\r\n\r\nAs seen in Job and Psalms 49:73.\r\n\r\n\r\n## 1\r\n\r\n> 1 Blessed is the man that walketh not in the counsel of the ungodly, nor standeth in the way of sinners, nor sitteth in the seat of the scornful.\r\n2 But his delight is in the law of the LORD; and in his law doth he meditate day and night.\r\n3 And he shall be like a tree planted by the rivers of water, that bringeth forth his fruit in his season; his leaf also shall not wither; and whatsoever he doeth shall prosper.\r\n4 The ungodly are not so: but are like the chaff which the wind driveth away.\r\n5 Therefore the ungodly shall not stand in the judgment, nor sinners in the congregation of the righteous.\r\n6 For the LORD knoweth the way of the righteous: but the way of the ungodly shall perish.\r\n\r\n## 14\r\n\r\n> 1 The fool hath said in his heart, There is no God. They are corrupt, they have done abominable works, there is none that doeth good.\r\n2 The LORD looked down from heaven upon the children of men, to see if there were any that did understand, and seek God.\r\n3 They are all gone aside, they are all together become filthy: there is none that doeth good, no, not one.\r\n4 Have all the workers of iniquity no knowledge? who eat up my people as they eat bread, and call not upon the LORD.\r\n5 There were they in great fear: for God is in the generation of the righteous.\r\n6 Ye have shamed the counsel of the poor, because the LORD is his refuge.\r\n7 Oh that the salvation of Israel were come out of Zion! when the LORD bringeth back the captivity of his people, Jacob shall rejoice, and Israel shall be glad.\r\n\r\n## 37\r\n\r\n> 1 Fret not thyself because of evildoers, neither be thou envious against the workers of iniquity.\r\n2 For they shall soon be cut down like the grass, and wither as the green herb.\r\n3 Trust in the LORD, and do good; so shalt thou dwell in the land, and verily thou shalt be fed.\r\n4 Delight thyself also in the LORD: and he shall give thee the desires of thine heart.\r\n5 Commit thy way unto the LORD; trust also in him; and he shall bring it to pass.\r\n6 And he shall bring forth thy righteousness as the light, and thy judgment as the noonday.\r\n7 Rest in the LORD, and wait patiently for him: fret not thyself because of him who prospereth in his way, because of the man who bringeth wicked devices to pass.\r\n8 Cease from anger, and forsake wrath: fret not thyself in any wise to do evil.\r\n9 For evildoers shall be cut off: but those that wait upon the LORD, they shall inherit the earth.\r\n10 For yet a little while, and the wicked shall not be: yea, thou shalt diligently consider his place, and it shall not be.\r\n11 But the meek shall inherit the earth; and shall delight themselves in the abundance of peace.\r\n12 The wicked plotteth against the just, and gnasheth upon him with his teeth.\r\n13 The LORD shall laugh at him: for he seeth that his day is coming.\r\n14 The wicked have drawn out the sword, and have bent their bow, to cast down the poor and needy, and to slay such as be of upright conversation.\r\n15 Their sword shall enter into their own heart, and their bows shall be broken.\r\n16 A little that a righteous man hath is better than the riches of many wicked.\r\n17 For the arms of the wicked shall be broken: but the LORD upholdeth the righteous.\r\n18 The LORD knoweth the days of the upright: and their inheritance shall be for ever.\r\n19 They shall not be ashamed in the evil time: and in the days of famine they shall be satisfied.\r\n20 But the wicked shall perish, and the enemies of the LORD shall be as the fat of lambs: they shall consume; into smoke shall they consume away.\r\n21 The wicked borroweth, and payeth not again: but the righteous sheweth mercy, and giveth.\r\n22 For such as be blessed of him shall inherit the earth; and they that be cursed of him shall be cut off.\r\n23 The steps of a good man are ordered by the LORD: and he delighteth in his way.\r\n24 Though he fall, he shall not be utterly cast down: for the LORD upholdeth him with his hand.\r\n25 I have been young, and now am old; yet have I not seen the righteous forsaken, nor his seed begging bread.\r\n26 He is ever merciful, and lendeth; and his seed is blessed.\r\n27 Depart from evil, and do good; and dwell for evermore.\r\n28 For the LORD loveth judgment, and forsaketh not his saints; they are preserved for ever: but the seed of the wicked shall be cut off.\r\n29 The righteous shall inherit the land, and dwell therein for ever.\r\n30 The mouth of the righteous speaketh wisdom, and his tongue talketh of judgment.\r\n31 The law of his God is in his heart; none of his steps shall slide.\r\n32 The wicked watcheth the righteous, and seeketh to slay him.\r\n33 The LORD will not leave him in his hand, nor condemn him when he is judged.\r\n34 Wait on the LORD, and keep his way, and he shall exalt thee to inherit the land: when the wicked are cut off, thou shalt see it.\r\n35 I have seen the wicked in great power, and spreading himself like a green bay tree.\r\n36 Yet he passed away, and, lo, he was not: yea, I sought him, but he could not be found.\r\n37 Mark the perfect man, and behold the upright: for the end of that man is peace.\r\n38 But the transgressors shall be destroyed together: the end of the wicked shall be cut off.\r\n39 But the salvation of the righteous is of the LORD: he is their strength in the time of trouble.\r\n40 And the LORD shall help them, and deliver them: he shall deliver them from the wicked, and save them, because they trust in him.\r\n\r\n, 49, 52, 53, 73, 75, 91, 112, 119, 127, 128, 133, \r\n\r\n\r\n## 139\r\n\r\n> 1 O lord, thou hast searched me, and known me.\r\n2 Thou knowest my downsitting and mine uprising, thou understandest my thought afar off.\r\n3 Thou compassest my path and my lying down, and art acquainted with all my ways.\r\n4 For there is not a word in my tongue, but, lo, O LORD, thou knowest it altogether.\r\n5 Thou hast beset me behind and before, and laid thine hand upon me.\r\n6 Such knowledge is too wonderful for me; it is high, I cannot attain unto it.\r\n7 Whither shall I go from thy spirit? or whither shall I flee from thy presence?\r\n8 If I ascend up into heaven, thou art there: if I make my bed in hell, behold, thou art there.\r\n9 If I take the wings of the morning, and dwell in the uttermost parts of the sea;\r\n10 Even there shall thy hand lead me, and thy right hand shall hold me.\r\n11 If I say, Surely the darkness shall cover me; even the night shall be light about me.\r\n12 Yea, the darkness hideth not from thee; but the night shineth as the day: the darkness and the light are both alike to thee.\r\n13 For thou hast possessed my reins: thou hast covered me in my mother's womb.\r\n14 I will praise thee; for I am fearfully and wonderfully made: marvellous are thy works; and that my soul knoweth right well.\r\n15 My substance was not hid from thee, when I was made in secret, and curiously wrought in the lowest parts of the earth.\r\n16 Thine eyes did see my substance, yet being unperfect; and in thy book all my members were written, which in continuance were fashioned, when as yet there was none of them.\r\n17 How precious also are thy thoughts unto me, O God! how great is the sum of them!\r\n18 If I should count them, they are more in number than the sand: when I awake, I am still with thee.\r\n19 Surely thou wilt slay the wicked, O God: depart from me therefore, ye bloody men.\r\n20 For they speak against thee wickedly, and thine enemies take thy name in vain.\r\n21 Do not I hate them, O LORD, that hate thee? and am not I grieved with those that rise up against thee?\r\n22 I hate them with perfect hatred: I count them mine enemies.\r\n23 Search me, O God, and know my heart: try me, and know my thoughts:\r\n24 And see if there be any wicked way in me, and lead me in the way everlasting."},"type":"READ_MD_FILE"}