{"id":1687,"courseId":"through-the-psalms","tasks":[],"title":"PSALM 9","fileType":"md","value":{"path":"C:\\sites\\github\\courses\\through-the-psalms/psalm-9.md","raw":"# Pslam 9\r\n\r\n## Occasion of this Psalm\r\n\r\n> Title. To the Chief Musician upon Muth-labben, a Psalm of David.\r\n\r\nMuth-labben is translated with difficulty but may be translated as: \"on the death of Labben\" or \"on the death of ben (the son)\" or \"on the death of the fool\".\r\n\r\nPerhaps Signifying:\r\n- the death of Goliath\r\n- the death of Nabal\r\n- the death of Absalom\r\n- David's defeat of are the Philistines, and the other neighbouring nations that opposed his settlement in the throne  in the beginning of his reign\r\n- some tone (for women voices)\r\n- some musical instrument unknown to us now\r\n\r\n## Praise the Lord for His Marvelous Works, vv. 1-5\r\n\r\n> Psalm 9:1-5 &mdash; 1 I will praise thee, O Lord, with my whole heart; I will shew forth all thy marvellous works. 2 I will be glad and rejoice in thee: I will sing praise to thy name, O thou most High. 3 When mine enemies are turned back, they shall fall and perish at thy presence. 4 For thou hast maintained my right and my cause; thou satest in the throne judging right. 5 Thou hast rebuked the heathen, thou hast destroyed the wicked, thou hast put out their name for ever and ever. \r\n\r\n- marvelous: to wonder; to amaze; wonderful\r\n- \"marvelous works\" (Exodus 3:3; Joshua 3:5; 1 Chronicles 16:24; Psalm 98:1)\r\n- \"marvelous things\" (Job 5:9; 10:16; Psalms 31:21; 118:23; Isaiah 29:14; Daniel 11:36; Zechariah 8:6); \r\n- \"marvelous lovingkindness\" (Psalm 17:7)\r\n\r\n## Praise the Lord for His Righteous Judgment, vv. 6-8\r\n\r\n> Psalm 9:6-8 &mdash; 6 O thou enemy, destructions are come to a perpetual end: and thou hast destroyed cities; their memorial is perished with them. 7 But the Lord shall endure for ever: he hath prepared his throne for judgment. 8 And he shall judge the world in righteousness, he shall minister judgment to the people in uprightness.\r\n\r\n- We are Witnesses even to the wicked.\r\n\r\n## Praise the Lord as a Refuge for the Oppressed, vv. 9-12\r\n\r\n> Psalm 9:9-12 &mdash; 9 The Lord also will be a refuge for the oppressed, a refuge in times of trouble. 10 And they that know thy name will put their trust in thee: for thou, Lord, hast not forsaken them that seek thee. 11 Sing praises to the Lord, which dwelleth in Zion: declare among the people his doings. 12 When he maketh inquisition for blood, he remembereth them: he forgetteth not the cry of the humble.\r\n\r\n## Praise the Lord for He is My Salvation, vv. 13-14\r\n\r\n> Psalm 9:13-14 &mdash; 13 Have mercy upon me, O Lord; consider my trouble which I suffer of them that hate me, thou that liftest me up from the gates of death: 14 That I may shew forth all thy praise in the gates of the daughter of Zion: I will rejoice in thy salvation.\r\n\r\n- We will face opposition in our witness\r\n\r\n> Matthew 24:9 &mdash; Then shall they deliver you up to be afflicted, and shall kill you: and ye shall be hated of all nations for my name's sake. (Mark 13:9; Lu 12:11; 21:12; Ac 5:40; )\r\n\r\n## Praise the Lord for He is the Champion of the Needy, vv. 15-20\r\n\r\n> Psalm 9:15-20 &mdash; 15 The heathen are sunk down in the pit that they made: in the net which they hid is their own foot taken. 16 The Lord is known by the judgment which he executeth: the wicked is snared in the work of his own hands. Higgaion. Selah. 17 The wicked shall be turned into hell, and all the nations that forget God. 18 For the needy shall not always be forgotten: the expectation of the poor shall not perish for ever. 19 Arise, O Lord; let not man prevail: let the heathen be judged in thy sight. 20 Put them in fear, O Lord: that the nations may know themselves to be but men. Selah.\r\n\r\n### Enemies Plan Backfired, vs. 15,16\r\n\r\nThe last word belongs to God!\r\n\r\n> Psalm 37:10-13 &mdash; For yet a little while, and the wicked shall not be: yea, thou shalt diligently consider his place, and it shall not be. 11 But the meek shall inherit the earth; and shall delight themselves in the abundance of peace. 12 The wicked plotteth against the just, and gnasheth upon him with his teeth. 13 The Lord shall laugh at him: for he seeth that his day is coming.\r\n\r\n- Lucifer's Rebellion\r\n- Israel Spoiling the Egyptions\r\n- Haman Hung on His Own Gallows\r\n- Jesus Death on the Cross\r\n- Stephen Stoned\r\n- Saul's Persecution of the Church\r\n\r\n### HIGGAION &amp; SELAH, v. 16\r\n\r\n - Higgaion: it is a musical sign, denoting probably a pause in the instrumental interlude.\r\n - Selah: to measure or weigh in the balances; pause or rest and meditate; Perhaps also, \"pause and praise\"\r\n\r\n### HELL, v. 17\r\n\r\n> Isaiah 5:14 &mdash; Therefore hell hath enlarged herself, and opened her mouth without measure: and their glory, and their multitude, and their pomp, and he that rejoiceth, shall descend into it. (Ps. 86:13; 27:20; Isa 14:15; Mt 5:29; 8:12; Luke 16:23)\r\n                                                                                                                      \r\n\r\n\r\n\r\n"},"type":"READ_MD_FILE"}