{"id":2,"courseId":"a-students-commentary-on-romans","tasks":[],"title":"002 CHAPTER 2","fileType":"html","value":{"path":"C:\\sites\\github\\courses\\a-students-commentary-on-romans/002_chapter-2.html","raw":"<p align=\"center\" style=\"margin-bottom: 0in; line-height: 100%; orphans: 2; widows: 2\">\r\n<font color=\"#800000\"><font face=\"Times New Roman, serif\"><font size=\"4\" style=\"font-size: 14pt\"><b>Chapter\r\nTwo</b></font></font></font></p>\r\n<p style=\"text-indent: 0.25in; margin-bottom: 0in; line-height: 100%; orphans: 2; widows: 2\">\r\n<br/>\r\n\r\n</p>\r\n<p align=\"center\" style=\"margin-bottom: 0in; line-height: 100%; orphans: 2; widows: 2\">\r\n<font color=\"#800000\"> &quot;<font face=\"Times New Roman, serif\"><font size=\"3\" style=\"font-size: 12pt\">Knowledge\r\nof the Law&quot;</font></font></font></p>\r\n<p style=\"text-indent: 0.25in; margin-bottom: 0in; line-height: 100%; orphans: 2; widows: 2\">\r\n<br/>\r\n\r\n</p>\r\n<p style=\"text-indent: 0.25in; margin-bottom: 0in; line-height: 100%; orphans: 2; widows: 2\">\r\n<font face=\"Times New Roman, serif\"><font size=\"3\" style=\"font-size: 12pt\">The\r\nman that condemns another for breaking the law while at the same time\r\nhe as well breaks the law is without a defense. This man condemns\r\nhimself with the words he intends to condemn another. We see here the\r\ninconsistency of human judgment and man&apos;s biased decision-making,\r\nbut in verse two it is declared that God&apos;s judgment is according to\r\ntruth against not just this group or that group, but against those\r\nthat commit &quot;such things.&quot; God&apos;s judgment is according to\r\ntruth, unbiased, and absolute. A man may feel self-confident and sure\r\nof his own place at the time he judges another, but without a doubt\r\nhe is without a defense--inexcusable--when the judgment of God comes.</font></font></p>\r\n<p style=\"text-indent: 0.25in; margin-bottom: 0in; line-height: 100%; orphans: 2; widows: 2\">\r\n<font face=\"Times New Roman, serif\"><font size=\"3\" style=\"font-size: 12pt\">Men\r\ntoo often respond so vainfully to the mercy of God. When God does not\r\nbring instantaneous judgment men often imagine they have escaped and\r\nhave &quot;gotten away&quot; with it, but in so doing they despise God&apos;s\r\ngoodness, forbearance, and longsuffering patience. They are without a\r\nflicker of understanding that the reprieve they enjoy is the goodness\r\nof God to lead them to and provide space for REPENTANCE. God is not\r\ninterested in simply destroying men in anger, but His desire is that\r\nmen would be saved and that could mean for some by as it were fire. </font></font>\r\n</p>\r\n<p style=\"text-indent: 0.25in; margin-bottom: 0in; line-height: 100%; orphans: 2; widows: 2\">\r\n<font face=\"Times New Roman, serif\"><font size=\"3\" style=\"font-size: 12pt\">Paul\r\nclearly explains that while the hard and impenitent heart imagines\r\nvainly that he has escaped instead of taking advantage of the mercy\r\nand goodness of God he to the opposite effect stores up, treasures\r\nup, against himself the wrath of God. In a time when pardon is\r\nprovided, the hard hearted and impenitent store up only more wrath\r\nand condemnation. They heap up treasures of destruction over a\r\npromise of treasures of righteousness. For God is not blind and\r\nneither has He gone soft. God is longsuffering, but He also will\r\njudge righteously EVERY man according to HIS DEEDS.</font></font></p>\r\n<p style=\"text-indent: 0.25in; margin-bottom: 0in; line-height: 100%; orphans: 2; widows: 2\">\r\n<font face=\"Times New Roman, serif\"><font size=\"3\" style=\"font-size: 12pt\">The\r\nrighteous judgment of God will reward the obedient with eternal life,\r\nbut will judge the disobedient with tribulation and anguish. Again,\r\nwe see here were Paul emphasises that there is no difference between\r\nJew or Greek in regards to God. God will not judge the Jew one way\r\nand the Greek another, but will judge every MAN (Jew or Gentile)\r\nACCORDING TO HIS DEEDS for &quot;there is no respect of persons with\r\nGod.&quot;</font></font></p>\r\n<p style=\"text-indent: 0.25in; margin-bottom: 0in; line-height: 100%; orphans: 2; widows: 2\">\r\n <font face=\"Times New Roman, serif\"><font size=\"3\" style=\"font-size: 12pt\">Paul\r\npresents a truth in verse twelve that he later explains in his\r\nletter. Those that have not the law will die without the law, but the\r\nlaw will judge those that have sinned in the law. It is not enough to\r\nknow about the law, but you must DO it. Does this mean that a Gentile\r\ncannot be justified because he has not been given the law that he may\r\nobey it as the Jews have? Absolutely not. The Gentile may do by\r\nnature the things contained in the law without ever having it because\r\nGod has placed in every man a conscience whereas long as men guard it\r\nand keep it are a law unto themselves in the proper and true sense of\r\nthe phrase. This law is written in their HEARTS and their conscience\r\nbears witness to it.</font></font></p>\r\n<p style=\"text-indent: 0.25in; margin-bottom: 0in; line-height: 100%; orphans: 2; widows: 2\">\r\n<font face=\"Times New Roman, serif\"><font size=\"3\" style=\"font-size: 12pt\">The\r\nJew that boasts in the law because he knows so much and is confident\r\nas a guide for the blind is blind himself. That is, he believes he\r\nknows the way, and no one else does. He stands in this place of great\r\nself-confidence because he KNOWS the law, but THERE IS NO\r\nRIGHTEOUSNESS IN KNOWING THE LAW. Paul speaks directly to emphasize\r\nhis point, &quot;Thou that preachest a man should not steal, dost thou\r\nsteal?&quot; Paul is clearly presenting that just as the Gentile is\r\nguilty because he DOES NOT the law and not that because he has not\r\nthe law as the Jews do, so also are the Jews not pardoned from their\r\nguilt because they have and know the law, but they as well are judged\r\nfor not DOING the law. Their self-confidence is fool hearty for they\r\nare as the blind leading the blind. They who are known in the world\r\nabroad as God&apos;s chosen people bring their God dishonor and the\r\nGentiles blaspheme God through them. Their testimony is evil for they\r\nboast in KNOWING the law, but dishonor God in BREAKING the law. The\r\nissue for justification is not over if a man was born Jew or Gentile,\r\nwhether he has been circumcised or not, or if he has the law or not,\r\nbut has his HEART been circumcised? Has the hardness, impenitence,\r\nand sin been cut out of his heart? </font></font>\r\n</p>\r\n<p style=\"text-indent: 0.25in; margin-bottom: 0in; line-height: 100%; orphans: 2; widows: 2\">\r\n<font face=\"Times New Roman, serif\"><font size=\"3\" style=\"font-size: 12pt\">In\r\nconclusion, the Jew that boasts in the Law and condemns the Gentile\r\nis without a defense for he has broken the law himself. For he is not\r\na Jew which is one OUTWARDLY (born of the seed and line of Abraham),\r\nbut he is a Jew which is one INWARDLY whose circumcision is that of\r\nthe heart and whose praise is not of men, but of God. Here we can see\r\nhow that a Gentile may be grafted in, not as an earthly Jew, but as a\r\nspiritual Jew who is a DOER and not a hearer only. We as well see how\r\nthat a Jew&apos;s justification rests not in his bloodline or knowledge\r\nof the law, but he as well must be a DOER of the law. Every Jew needs\r\nto add to his physical circumcision a circumcision of the heart\r\nthrough repentance and a changed life. </font></font>\r\n</p>\r\n"},"type":"READ_HTML_FILE"}