{"id":205,"courseId":"cults","tasks":[],"title":"002 INTRODUCTION","fileType":"md","value":{"path":"C:\\sites\\github\\courses\\cults/002_introduction.md","raw":"<h1>INTRODUCTION</h1><h2>Class Purpose &amp; Explanation</h2><p>The Purpose of this course is to identify the errors of our day and is not an in&ndash;depth study of the cults. NO CULT deserves that much of your attention. It is important to be careful when investigating the cults because you could be influenced by the false spirit that has inspired them.</p><p>We need to put our emphasis on knowing the truth. The Bible is God&apos;s Word&#44; the supreme authority and life. II Peter 1:2&ndash;4; 16&ndash;21; II Timothy 3:13&ndash;17; Philippians 2:16</p><ul><li>We must STUDY the Truth. 2 Timothy 2:15</li><li>We must KNOW the Truth. John 8:32</li><li>We must LOVE the Truth. II Thessalonians 2:10</li><li>We must RESTRAIN iniquity. II Thessalonians 2:7</li></ul><p>Speak the Truth in love:</p><ul><li>Ephesians 4:14&ndash;15</li><li>2 Corinthians 2;14&ndash;15</li><li>I Corinthians 2:1&ndash;16</li><li>Galatians 4:16</li></ul><blockquote>Psalms 15:2&mdash;He that walketh uprightly&#44; and worketh righteousness&#44; and speaketh the truth in his heart.</blockquote><h2>Be sure to begin to MEMORIZE the book of Jude as you take this course.</h2><p>Read I Corinthians 2:1&ndash;15.</p><blockquote>1 Cor. 2:12&mdash;Now we have received&#44; not the spirit of the world&#44; but the spirit which is of God; that we might know the things that are freely given to us of God.</blockquote><blockquote>I Cor. 2:14&#44; 15 But the natural man receiveth not the things of the Spirit of God: for they are foolishness unto him: neither can he know them&#44; because they are spiritually discerned.15 But he that is spiritual judgeth all things&#44; yet he himself is judged of no man.</blockquote><p>Only a real Believer in Jesus Christ&#44; who has remained in the Word of God&#44; who has been taught by the Holy Spirit is able to understand the truth and is able to identify the false.</p><h2>The Definition of a Cult</h2><p>A cult is a religious movement where faith is distorted and truth is perverted into a lie. (I Cor.2:15; Gal. 1:6&ndash;7; Col. 2:8)</p><ul><li>A religious perversion</li><li>An organized heresy</li><li>Strange beliefs and practices centered around false doctrine</li></ul><ol><li>A Cult is a False Religion. A system of religious or spiritual beliefs&#44; especially an informal and transient belief system regarded by others as misguided&#44; unorthodox&#44; extremist&#44; or false&#44; and directed by a charismatic&#44; authoritarian leader.</li><li>Warnings about Cults. Cults feed their system of belief to people for the purpose of control rather than to feed for spiritual growth and good fruit to Glorify God. Cults idolize leaders&#44; teachings and programs. A Cult can arise out of going off track and trying to appropriate even the promises of God through carnal thinking. You can hurt somebody even with the truth by a wrong motive&#44; self&ndash;righteous spirit or an unwise approach. Cultic practices are spreading like wild fire because of the lukewarmness in the church. When the church is strong in the Lord and militant in God&apos;s power&#44; the gates of hell cannot prevail.</li></ol><blockquote>Mathew 16:18&#44;19&mdash;And I say also unto thee&#44; That thou art Peter&#44; and upon this rock I will build my church; and the gates of hell shall not prevail against it. 19 And I will give unto thee the keys of the kingdom of heaven: and whatsoever thou shalt bind on earth shall be bound in heaven: and whatsoever thou shalt loose on earth shall be loosed in heaven.</blockquote><p>Paul&apos;s advice to the elders in regard to taking care of the church was the same as Christ advice to Peter.</p><blockquote>Acts 20:28&ndash;32&mdash;Take heed therefore unto yourselves&#44; and to all the flock&#44; to feed the church of God.</blockquote><blockquote>John 21:15&ndash;17&mdash; Jesus saith to Simon Peter&#44; Simon&#44; son of Jonas feed my lambs. 16 He saith to him again the second time feed my sheep. 17 He saith unto him the third time feed my sheep.</blockquote><p>Matt. 7:15&ndash;23; John 10:10&ndash;38; I Tim. 4:1&ndash;3; II Tim. 3:1&ndash;4:5; II Peter 2:1&ndash;22; Jude 1&ndash;2</p><h2>Exhortations &ndash; Examine your life by the Word.</h2><p>Every man should make careful examination of his life before he studies any kind of cultic practices. Paul&apos;s admonitions and warnings should be cause enough for each of us to make careful doctrinal examination&#44; as well.</p><p>II Cor. 13:5; I Cor. 11:28&#44; 31&ndash;32; I Tim. 4:15&ndash;16; II Timothy 2:15; 3:13&ndash;15</p><p>The only way to avoid chastening or shorten spiritual correction is to Repent and correct your path immediately!</p>"},"type":"READ_MD_FILE"}