{"id":207,"courseId":"cults","tasks":[],"title":"004 THE MARKS OF A CULT","fileType":"md","value":{"path":"C:\\sites\\github\\courses\\cults/004_the-marks-of-a-cult.md","raw":"<h1>The Marks of a Cult</h1><h2>Extra-Biblical Revelations</h2><p>People that get involved with revelations that are not in the bible are rebelling against the Supreme Authority. They do not believe that the bible is the only authority for revelation. Extra-Biblical Revelations are not of God. All revelation must be substantiated by the Scriptures. Divine Revelation must be absolutely equal to the scripture without altering one principle.</p><blockquote>1 Cor.2:13&mdash;Which things also we speak&#44; not in the words which man&apos;s wisdom teacheth&#44; but which the Holy Ghost teacheth; comparing spiritual things with spiritual.</blockquote><blockquote>The Holy Ghost reveals truth to the righteous and we place no limit on further revelation. We do not have faith in anything that contradicts or is not in the Bible.</blockquote><blockquote>Deut. 4:2&mdash;Ye shall not add unto the word which I command you&#44; neither shall ye diminish ought from it&#44; that ye may keep the commandments of the LORD your God which I command you.</blockquote><blockquote>Deut. 12:32&mdash;What thing soever I command you&#44; observe to do it: thou shalt not add thereto&#44; nor diminish from it.</blockquote><blockquote>Prov. 30:5&mdash;Every word of God is pure: he is a shield unto them that put their trust in him. 6 Add thou not unto his words&#44; lest he reprove thee&#44; and thou be found a liar.</blockquote><p>There are many cults that claim &quot;extra-biblical&quot; revelation:</p><ul><li>Islam - Koran</li><li>The Church of Jesus Christ of Latter day Saints -The book of Mormon </li><li>Jehovah Witnesses-The New World Translation</li><li>New Age-Urantia[Endnotes and Citations A spiritual and philosophical book that discusses God&#44; Jesus&#44; science&#44; cosmology&#44; religion&#44; history and destiny. It originated in Chicago&#44; Illinois&#44; USA&#44; sometime between 1924 and 1955. The Urantia Book denies some fundamental Christian doctrines.]</li></ul><blockquote>Catholic-Apocrypha</blockquote><blockquote>II Co r.11:4&mdash;For if he that cometh preacheth another Jesus&#44; whom we have not preached&#44; or if ye receive another spirit&#44; which ye have not received&#44; or another gospel&#44; which ye have not accepted&#44; ye might well bear with him.</blockquote><blockquote>Gal. 1:6&#44;7&mdash;I marvel that ye are so soon removed from him that called you into the grace of Christ unto another gospel: 7&mdash;Which is not another; but there be some that trouble you&#44; and would pervert the gospel of Christ.</blockquote><h2>Segmented Biblical attention</h2><h3>Paying attention to fragments of Scripture&#44; and missing the whole.</h3><blockquote>John 6:12&mdash;When they were filled&#44; he said unto his disciples&#44; Gather up the fragments that remain&#44; that nothing be lost.</blockquote><blockquote>Acts 13:10&mdash;And said&#44; O full of all subtilty and all mischief&#44; thou child of the devil&#44; thou enemy of all righteousness&#44; wilt thou not cease to pervert the right ways of the Lord?</blockquote><blockquote>Acts 20:27&mdash;For I have not shunned to declare unto you all the counsel of God.</blockquote><p>We need to adhere to all the COUNSEL OF GOD (II Tim. 2:15; John 5:39; Rev. 3:18) and all Scripture is given by inspiration of God. (II Tim. 3:16)</p><p>There are many people that purposely manipulate Scripture to benefit their own ends. That take portions of the truth and it make it to be whole. A half-truth is a lie and their using Scripture under false pretenses is also lying.</p><p>Billy Sunday use to say&#44; &quot;An excuse is the skin of reason stuffed with a lie.&quot; Well&#44; it is a common practice of cults to take a skin of truth and stuff it full of lies. One word added or left out can entirely change the meaning of something&#44; and what use to be the truth becomes a lie. There is a great personal danger in changing the Word of God. (Revelation 22:18)</p><blockquote class=\"quote\">O&#44; what a tangled web we weave&#44; when first we practice to deceive!&mdash;Sir Walter Scott&#44; from his poem Marmion</blockquote><p>We must not fail to pay attention to the entire message of the entire Word of God!</p><h3>Over emphasizing one portion of Scripture to the exclusion of others.</h3><p>Jesus rebuked the Scribes and Pharisees for omitting the weightier matters of the Law. - Mt. 23:23. They would strain at a gnat and swallow a camel. (Mt. 23:24) In this error&#44; they became cut off from the truth. Once we move away from the clear intentions of Scripture&#44; we run the risk of becoming cut off from the truth. (II Thess. 2:10; Jer. 7:28; Rev. 22:19)</p><h3>Examples of segmented Biblical attention.</h3><h4>Some people only regard Paul&apos;s writings as being inspired.</h4><h4>Overemphasizing demons.</h4><p>Every work of the flesh is not a demon. Furthermore&#44; every bad thing that happens in life is not necessarily the devil&apos;s fault. (Gal. 5:19-21)</p><h4>Some believe that being water baptized a certain way is essential to salvation.</h4><p>There is no salvation in water for we are saved through faith in the Blood of Jesus Christ which was shed for us. (Rom. 5:9&#44; Eph.1:7; Col. 1:14&#44;20; Heb. 9:14)</p><h4>The Jehovah Witnesses teach salvation by works.</h4><p>Work are a result of faith. (James 2:17-26.) Works cannot save but works are produced in the believer&apos;s life if you are saved. (Eph. 2:8-10&#44; Rom. 4:2-3; Titus)</p><h4>Turning the grace of God into a license to sin.</h4><blockquote>Jude 4&mdash;For there are certain men crept in unawares&#44; who were before of old ordained to this condemnation&#44; ungodly men&#44; turning the grace of our God into lasciviousness&#44; and denying the only Lord God&#44; and our Lord Jesus Christ.</blockquote><p>There are some that teach faith without the works of a pure love. They turn the grace of which is the power to live above sin into a license to sin&mdash;lasciviousness.</p><p>We are commanded over and over to sin not. (I Jn. 2:1-4; Rom. 6:6&#44; 11-20; 22-23; I Peter 4:1)</p><p>We can lose our salvation by dying spiritually. If you can be made alive you can die as well. (Ex. 32:33; Rev. 22:19; Ezek. 3:20&#44; 21; 18:24; 33:13) There is no provision of covering as long as we remain in our sin. </p><p>The only pattern for salvation is Christ&apos;s message of repentance&mdash;turn around and stop sinning. There is only ONE sacrifice that can atone for sin and that is Christ&apos;s.</p><blockquote>Heb 10:26&mdash;For if we sin wilfully after that we have received the knowledge of the truth&#44; there remaineth no more sacrifice for sins&#44;</blockquote><h4>Charismatic&apos;s take positive thinking to the extreme.</h4><p>The &apos;Faith Movement&quot; in Charismatic circles has failed to recognize that God&apos;s promises are conditional.- Faith is essential. - Mathew 21:22.- Holiness is essential &mdash; Hebrews 12:14- Living right is essential. &mdash; John 15:7</p><h4>Among the &quot;Prosperity Teachers&quot; financial success is used to measure spirituality.</h4><p>But God has promised to meet our needs not our greeds. Philippians 4:19 is a promise given to those that have given unselfishly over and over again. It is not a promise to encourage people to give to get but to remind the faithful that the Lord is truly faithful and won&apos;t forget them. (Many heroes of the faith have been described as destitute by temporal measures. Hebrews 11:37)</p><blockquote>Philippians 4:19&mdash;But my God shall supply all your need according to his riches in glory by Christ Jesus.</blockquote><h2>Producing Their Own Salvation</h2><p>The philosophies of the Judaizers are still at work. The devil is convincing people to go back to the Old Covenant. Others are trying to observe both the Old and the New Covenant. They are trying to obtain justification before God by the keeping of the Law. This is against Scripture.</p><p>The ceremonial law has been abolished. (Col. 2:14-17)The law as a whole has been fulfilled in Christ. </p><p>What every Believer needs to understand is that through faith in Jesus Christ we are made righteous and through the righteousness of Christ that comes to us from faith to faith we can and must fulfill all the moral laws of God. The Grace of God has the power to cause us to live above the law and is not merely a license for lawlessness.</p><blockquote>Rom. 10:4&mdash;For Christ is the end of the law for righteousness to everyone that believeth.</blockquote><blockquote>Matt. 5:17&mdash;Think not that I am come to destroy the law&#44; or the prophets: I am not come to destroy&#44; but to fulfil.</blockquote><blockquote>Gal. 2:16&mdash;Knowing that a man is not justified by the works of the law&#44; but by the faith&hellip;</blockquote><blockquote>Gal. 3:11&mdash;But that no man is justified by the law in the sight of God&#44; it is evident: for&#44; The just shall live by faith.</blockquote><blockquote>Rom. 13:8 &hellip; for he that loveth another hath fulfilled the law.</blockquote><blockquote>Rom. 13:10&mdash;&hellip; therefore love is the fulfilling of the law.</blockquote><blockquote> Gal. 5:14&mdash;For all the law is fulfilled in one word&#44; even in this; Thou shalt love&hellip;</blockquote><blockquote>James 2:8&mdash;If ye fulfil the royal law according to the scripture&#44; Thou shalt love thy neighbour as thyself&#44; ye do well:</blockquote><p>Salvation is a gift to all who receive Jesus as their Savior. (Rom. 1:16&#44; 10:9-13) There is no difference between the Jew and the Gentile&mdash;salvation is by grace through faith. (Eph. 2:8&#44;11-22) Christ brought an end to the ceremonial law and satisfied the moral law so that obedience to Christ is life.</p><blockquote>John 15:10&mdash;If ye keep my commandments&#44; ye shall abide in my love; even as I have kept my Father&apos;s commandments&#44; and abide in his love.</blockquote><blockquote>Romans 6:6&mdash;Knowing this&#44; that our old man is crucified with him&#44; that the body of sin might be destroyed&#44; that henceforth we should not serve sin.</blockquote><h2>Slaves to the Structure</h2><h2>Cults bring their followers into slavery.</h2><p>They bring people into Psychological slavery &mdash; mind control&#44; as well as&#44; spiritual slavery&mdash;bound by sin&#44; bound by religion. Cults create a scenario for complete dependence on the cult. They will supply the basic needs of the people&#44; so that the individual cannot imagine their personal identity without the cult. Because of this infant-like dependence on the group there is much fear involved with leaving the cult no matter how harsh its negative aspects get.</p><p>They make slaves of the people by overpowering them with harsh controlling leaders. The leadership in essence becomes the master and lord of each individual&apos;s &quot;salvation.&quot; This is exactly what God accused the Nicolaitans of doing. God hated the deeds of the Nicolaitans in Ephesus (Rev. 2:6) and the doctrines of the Nicolaitans in Pergamos (Rev. 2:15). </p><p>That which was only deeds in Ephesus became doctrines in Pergamos. God hates the deeds and God hates the doctrines. They tried to corral those who were doing that which God hated. These were&#44; as is commonly supposed&#44; a sect of the Gnostics&#44; who taught the most impure doctrines&#44; and followed the most impure practices. They are also supposed to have derived their origin from Nicolas&#44; one of the seven deacons mentioned in Acts 6:5. The more natural and obvious supposition is that the Nicolaitans taught the same things which Balaam did.</p><p>The Nicolaitans taught the community of wives&#44; that adultery and fornication were things indifferent&#44; that eating meats offered to idols was quite lawful; and mixed several pagan rites with the Christian ceremonies. Augustine&#44; Irenaeus&#44; Clement&#44; Alexandrinus&#44; and Tertullian&#44; have spoken concerning them.</p><p>Nicolaus means victorious over the people; (Nicolaus &amp; Balaam were heretics.)</p><p>&quot;nikos&quot; a conquest; triumph:--victory.&quot;Nike&quot; the means of success:</p><p>&quot;Laos&quot; the people&#44; Laity (organization) (NicoLAITANSLao-diceans)</p><p>&quot;Dike&quot; right (as self-evident) self justice&#44; government by the people</p><p>The deeds and doctrines of the Nicolaitans emphasized the clergy controlling the laity.</p><p>The church should be well organized according to the truth in the Bible&#44; but organization must not take God&apos;s place. People need guidance as well as doctrines&#44; but at no time should we become lords over another man&apos;s faith. The same God that saved you is well able to save and keep others! Do not seek to control another man&apos;s experience.</p><blockquote>1 Peter 5:3&mdash;Neither as being lords over God&apos;s heritage&#44; but being ensamples to the flock.</blockquote><blockquote>2 Cor. 1:24&mdash;Not for that we have dominion over your faith&#44; but are helpers of your joy: for by faith ye stand. (I Cor. 9:12&#44;18; 10:33)</blockquote><blockquote>John 7:17&mdash;If any man will do his will&#44; he shall know of the doctrine&#44; whether it be of God&#44; or whether I speak of myself.B.###Truth makes men free.</blockquote><blockquote>John 8:32&mdash;And ye shall know the truth&#44; and the truth shall make you free.</blockquote><h4>The Holy Spirit brings liberty. - II Cor. 3:17; Gal. 5:1.</h4><blockquote>John 16:13&mdash;Howbeit when he&#44; the Spirit of truth&#44; is come&#44; he will guide you into all truth: for he shall not speak of himself; but whatsoever he shall hear&#44; that shall he speak: and he will shew you things to come.</blockquote><p>God&apos;s working is not a force&#44; might or power of man that disregards the individual&apos;s liberty in Christ and freedom of choice&#44; but is by the Spirit of God. God&apos;s Spirit will LEAD men and not DRIVE them. (Rom. 8:14; Gal. 5:18)</p><blockquote>Zechariah 4:6&mdash;&hellip; Not by might&#44; nor by power&#44; but by my spirit&#44; saith the LORD of hosts. </blockquote><h4>We have been bought with a price.</h4><blockquote>I Cor. 7:23&mdash;Ye are bought with a price; be not ye the servants of men.</blockquote><blockquote>I Cor. 6:19&#44;20&mdash;What? know ye not that your body is the temple of the Holy Ghost which is in you&#44; which ye have of God&#44; and ye are not your own?20 For ye are bought with a price: therefore glorify God in your body&#44; and in your spirit&#44; which are God&apos;s.</blockquote><blockquote>I Peter 1:18&#44;19&mdash;Forasmuch as ye know that ye were not redeemed with corruptible things&#44; as silver and gold&#44; from your vain conversation received by tradition from your fathers; 19 But with the precious blood of Christ&#44; as of a lamb without blemish and without spot:</blockquote><h4>Christians become servants to God by choice. Rom. 1:1.</h4><h5>doulos - A love slave&#44; one who chose to continue his servitude.</h5><blockquote>John 12:26&mdash;If any man serve me&#44; let him follow me; and where I am&#44; there shall also my servant be: if any man serve me&#44; him will my Father honour. </blockquote><blockquote>Philippians 2:22&mdash;&hellip;&#44; as a son with the father&#44; he hath served with me in the gospel.</blockquote><blockquote>Romans 1:1&mdash;Paul&#44; a servant of Jesus Christ&#44; called to be an apostle&#44; separated unto the gospel of God&#44;</blockquote><blockquote>Acts 27:23&mdash;&hellip; God&#44; whose I am&#44; and whom I serve.</blockquote><ul><li>Committed to The Lord Jesus Christ through the Power of The Holy Ghost</li><li>Committed to the Gospel</li><li>Committed to the Work and Service of God</li></ul><h5>ap-os&apos;-tol-os- (&quot;Called&quot;)Chosen&#44;(separated) Loved and sent.</h5><p>A delegate; specially&#44; an ambassador of the Gospel; officially a commissioner of Christ (\"apostle\") (with miraculous powers):--apostle&#44; messenger&#44; he that is sent. Mat.22:14; John 15:16; Acts 9:15; Eph. 1:4; James 2:5; I Peter 2:4&#44;9; Rev. 17:14</p><h2>Devotion to the Irrational</h2><p>Judges 17:6; 18:1; 19:1; 21:25</p><p>This church age is hopelessly addicted to the latest trend or fad. This problem has graduated to the extent it does not seem to matter to people how Scripturally sound something is or isn&apos;t as long as it is &apos;new.&apos; This results over and over to the production of and devotion to philosophies that are not only inconsistent with Scripture&#44; but are irrational in general. Many trends of our day may not be biblically wrong in their premise&#44; but their methods must be tested by the Word. </p><blockquote>I Cor. 2:15&mdash;But he that is spiritual judgeth all things&#44; yet he himself is judged of no man.</blockquote><li>Not-&quot;Purpose Driven&quot; We need to be led by The Holy Ghost.</li><p>BIBLICALLY IRRATIONAL: Fitting God into the box of man&apos;s philosophies.</p><blockquote class=\"quote\">&quot;By the end of the journey [A 40 day commitment to reading his book] you will know God&apos;s purpose for your life and will understand the big picture-how all the pieces of your life fit together.&quot;&mdash;Rick Warren in The Purpose-Driven Life</blockquote><li>Not-&quot;Promise Keepers&quot; We need to be filled with The Holy Ghost.</li><p>BIBLICALLY IRRATIONAL: Unity at the expense of true Gospel.</p><blockquote class=\"quote\">&quot;It&apos;s so diluted and deluded&#44; you can&apos;t get very much out of it.\" &mdash;former Promise Keepers member</blockquote><p>Promise Keepers&apos; teachings are a strange mixture of truth and error. Its methods for promoting these teachings are questionable. Some Scriptural values are taught&hellip;they are mingled with pop-psychology and have an ecumenical emphasis&#44; while a charismatic aura pervades the proceedings. One of the Promise Keepers&apos; stated goals is to &apos;break down denominational barriers&#44; including Catholic&#44; liberals&#44; charismatics&#44; and neo-evangelicals under its banner. It urges its members to &apos;break down the walls that separate us&#44; to be a bridge builder&#44; and to pray daily for unity among Christians in your community.&apos; &mdash;A resolution passed at a Fellowship of Fundamental Bible Churches</p><li>Not-&quot;Your Best Life Now&quot; We need to abide in The Holy Ghost.</li><p>BIBLICALLY IRRATIONAL: Telling the people only what want to hear.</p><blockquote class=\"quote\">&quot;I don&apos;t use it [the word &apos;sinner&apos;]. I never thought about it. But I probably don&apos;t. But most people already know what they&apos;re doing wrong. When I get them to church I want to tell them that you can change. &hellip; So I don&apos;t go down the road of condemning.&quot;&mdash;Joel Osteen on the &quot;Larry King Live&quot; show</blockquote><li>Not-&quot;The Battlefield of the Mind&quot; We need to be fed by The Holy Ghost.</li></ul><p>BIBLICALLY IRRATIONAL: Using the Bible to get the door open. </p><blockquote class=\"quote\">Answering the question: &quot;What Happened from the Cross to The Throne?&quot;&quot;The Bible can&apos;t even find any way to explain this. Not really. That&apos;s why you&apos;ve got to get it by revelation. There are no words to explain what I&apos;m telling you. I&apos;ve got to just trust God that He&apos;s putting it into your spirit like He put it into mine.&quot; &mdash;Joyce Meyer&#44; author of The Battlefield of the Mind</blockquote><p>This generation as a whole does not want anything to do with really serving God and truly following the Gospel of Jesus Christ by departing completely from sin. People have committed themselves instead: to people to things to agendas to agencies To operation a/b/c To big corporation To government control---disabling the individual of responsibility</p><blockquote>John 12:26&mdash;If any man serve me&#44; let him follow me; and where I am&#44; there shall also my servant be: if any man serve me&#44; him will my Father honour.</blockquote><h2>Exclusive of Others</h2><h3>Cults become exclusive of all others.</h3><p>Those outside the group are considered enemies. They alone have the answers. Their group is the only way of salvation.</p><h4>Jehovah Witnesses declare their group is the only way to God.</h4><h4>Mormons believe their group is the way.</h4><h4>Catholics believe their religion saves them</h4><h3>Jesus is the only way for Salvation. (Acts 4:10-12; Rom. 10:13)</h3><p>Salvation&#44; Healing and Deliverance are available to all who come to Jesus. </p><blockquote>1 Peter 2:24&mdash;Who his own self bare our sins in his own body on the tree&#44; that we&#44; being dead to sins&#44; should live unto righteousness: by whose stripes ye were healed. James 5:13 -16; Mat.10:1; Mark 6:13; Luke9:2; Psalms 103:2-5; Jer. 33:6; 46:1&mdash; (Read Hebrews 4:15-16); Ex. 15:26; Psalms 107:20; Isaiah 53:5; Read Jeremiah 30:12 -17.</blockquote><p>Mark 9:23&mdash;&hellip; If thou canst believe&#44; all things are possible to him that believeth. </p><p> John 11:40; 2 Chron. 16:12; Psalms 147:3; Luke 6:19; Luke 7:21; Mat. 13:58; Mark 6:56 </p><p>2 Chron. 36:16&mdash;But they mocked the messengers of God&#44; and despised his words&#44; and misused his prophets&#44; until the wrath of the LORD arose against his people&#44; till there was no remedy. {remedy: Heb. healing}</p><p>Luke 17:5&mdash;And the apostles said unto the Lord&#44; Increase our faith.</p><h2>Uncertain Hope</h2><p>Cults produce uncertainties instead of certain hope&mdash;could be&#44; maybe&#44; someday&#44; possibly&#44; might be&#44; etc. </p><blockquote>Jer .18:12&mdash;And they said&#44; There is no hope: but we will walk after our own devices&#44; and we will every one do the imagination of his evil heart.</blockquote><p>God didn&apos;t leave man without a Hope of Salvation.</p><blockquote>I Peter 3:15&mdash;&hellip;be ready always to give an answer&hellip;a reason of the hope that is in you&hellip; </blockquote><blockquote>Rom. 8:20&mdash;&hellip;by reason of him who hath subjected the same in hope&#44;</blockquote><blockquote>Hebrews 6:19&mdash;Which hope we have as an anchor of the soul&hellip;</blockquote><h2>Presenting a New Leader (worship of man)</h2><p>They have not the faith in Jesus Christ. Their followers are ruled and driven apart from Love of Christ by human leadership. They have not the faith in Jesus Christ because too much emphasis is placed on human leadership. </p><blockquote>John 12:26 If any man serve me&#44; let him follow me&hellip;. (Mat. 4:19; Mark 12:33;)</blockquote><h2>Those that do not believe in the three Persons of the Godhead</h2><p>There is absolutely one God. God is three Persons: Father&#44; Son and the Holy Ghost. Father&#44; Son and Holy Ghost are co-equal and co-eternal.</p><blockquote>Eph 2:18&mdash;For through him we both have access by one Spirit unto the Father. (Matt. 3:16&#44;17; I Cor. 8:6;12:3)</blockquote><h2>Financial Exploitation</h2><p><strong>Merchandising the message&#44;</strong> When you always must pay a membership fee to be involved. (II Pet. 2:1-3) Many cults are only interested in money. This includes charismatic leaders. It is shame how people who profess to be ministers of the Gospel Manipulate people to give money.People give on the lie they can purchase salvation&#44; God&apos;s blessing or favor&#44; health and well being&#44; or a guaranteed prosperous return. Roman Catholics are deceived into paying money to free souls from &apos;purgatory&apos; or gain some kind of justification.</p><p>Salvation comes free because of the blood of Jesus that was shed. The gift of God is eternal life. - Rom. 6:23. Justified freely by His grace. - Rom. 3:24. God&apos;s blessing cannot be purchased with money. - Acts 8:18-24. But always remember the price Jesus paid on the cross. The price of our sin debt was paid in full. John 19:30 &quot;It is Finished&quot;&mdash;Redemption is accomplished.</p>"},"type":"READ_MD_FILE"}