{"id":208,"courseId":"cults","tasks":[],"title":"005 CHRISTIAN RESPONSIBILITY TO CULTS","fileType":"md","value":{"path":"C:\\sites\\github\\courses\\cults/005_christian-responsibility-to-cults.md","raw":"<h1>The Christian Responsibility to Cults</h1><p>What is every Christian&apos;s primary responsibility with regard to cults? To be true and faithful stewards with the Word of God! What makes cultic points of view attractive? They have parts of truth&mdash;some truth but it is the mixture that is dangerous. We are duty bound to be so familiar with truth that we can detect when something is only a little &lsquo;off.&rsquo; The Believer has been given power and authority over all the power of the enemy.</p><h2>The Power and Authority of the Believer</h2><h3>The Believer&apos;s Power and Authority is from God.</h3><blockquote>Luke 9:1&mdash;Then he called his twelve disciples together&#44; and gave them power and authority over all devils&#44; and to cure diseases.</blockquote><blockquote>1 Peter 5:8&mdash;Be sober&#44; be vigilant; because your adversary the devil&#44; as a roaring lion&#44; walketh about&#44; seeking whom he may devour:</blockquote><ul><li>Be of a sober spirit</li><li>Be vigilant</li></ul><p>The authority of the Believer is over the devil and his efforts to destroy God&apos;s purpose for our lives. One of the <strong>most important messages</strong> is to be considered in this lesson is that God has invested into the Believer His power and authority.</p><blockquote>Luke 9:1&mdash;Then he called his twelve disciples together&#44; and gave them power and authority over all devils&#44; and to cure diseases.</blockquote><blockquote>John 1:12&mdash;But as many as received him&#44; to them gave he power to become the sons of God&#44; even to them that believe on his name.</blockquote><blockquote>Matt. 10:1&mdash;And when he had called unto him his twelve disciples&#44; he gave them power against unclean spirits&#44; to cast them out&#44; and to heal all manner of sickness and all manner of disease.</blockquote><blockquote>2 Cor. 10:8&mdash;For though I should boast somewhat more of our authority&#44; which the Lord hath given us for edification&#44; and not for your destruction&#44; I should not be ashamed:</blockquote><blockquote>Titus 2:15&mdash;These things speak&#44; and exhort&#44; and rebuke with all authority. Let no man despise thee.</blockquote><p>The Believer cannot be hindered or stopped by the devil if he knows how to properly use what God has promised and provided. We must be aware of God&apos;s provision&#44; but we must also learn how to put that promise to practice.All that God has promised is added to our lives as we diligently believe Him. Such faith requires implicit obedience. Believe and Obey.</p><h3>What does this Power and Authority Mean?</h3><p><strong>Five different Greek words&hellip;</strong></p><p><strong>exousia</strong>&#44; Gr. authority; privilege&#44; capacity&#44; competency&#44; mastery </p><p><strong>dunamis</strong>&#44; Gr. force&#44; specially&#44; miraculous power </p><p><strong>kratos</strong>&#44; Gr. vigor (\"great\") --dominion&#44; might(-ily)&#44; power&#44; strength.</p><p><strong>arche</strong>&#44; Gr. a commencement&#44; or chief&#44;first (estate)&#44; magistrate&#44; power</p><p><strong>&hellip;that are translated almost interchangeably.</strong></p><table><tbody><tr><th>Greek</th><th>Colossians 2:15</th><th>Luke 9:1</th><th>Luke 10:19</th><th>Ephesians 1:19</th><th>Ephesians 1:21</th></tr><tr><td>exousia</td><td>powers</td><td>authority</td><td>power</td><td>-</td><td>power</td></tr><tr><td>dunamis</td><td>-</td><td>power</td><td>power</td><td>power</td><td>might</td></tr><tr><td>kratos</td><td>-</td><td>-</td><td>-</td><td>power</td><td>-</td></tr><tr><td>arche</td><td>principalities</td><td>-</td><td>-</td><td>-</td><td>principality</td></tr><tr><td>kuriotes</td><td>-</td><td>-</td><td>-</td><td>-</td><td>dominion</td></tr></tbody></table><p>Power and authority are so intimately related&#44; it is difficult to separate the one from the other. Both power and authority are promised and at no time do we have to be with power and without authority or vice versa.For the sake of study&#44; &lsquo;power&rsquo; and &lsquo;authority&rsquo; are distinct in that:- Power is CAPACITY. &lsquo;18-Wheeler&rsquo; -the capacity to go 80 mph- Authority is RIGHT. &lsquo;Police Officer&rsquo; -the right to say&#44; &lsquo;Stop!&rsquo;</p><h3>Qualifications to Exercise the Authority of God</h3><p>What are the Qualifications to exercise this Authority?</p><h4>We need to have right knowledge with a true experience.</h4><p>Eph. 1:3&#44; 19&#44; 21 a place or position of power and authority promised.2 Peter 1:2-10 Are we using the power and authority that is promised?</p><blockquote>Hebrews 12:2&mdash;Looking unto Jesus the author and finisher of our faith; who for the joy that was set before him endured the cross&#44; despising the shame&#44; and is set down at the right hand of the throne of God. (Acts 19:14-16)</blockquote><h4>We need to exercise faith with power.</h4><ul><li>To live in accordance with Truth I Tim. 2:7; Titus 1:1</li><li>Faith with power II Thes.1:11; Acts 6:8; I Cor. 2:5; I Pt. 1:5</li></ul><blockquote>Matthew 23:23&mdash;Woe unto you&#44; scribes and Pharisees&#44; hypocrites! for ye pay tithe of mint and anise and cummin&#44; and have omitted the weightier matters of the law&#44; judgment&#44; mercy&#44; and faith: these ought ye to have done&#44; and not to leave the other undone.</blockquote><h4>We must demonstrate true humility&mdash;complete confidence in God&apos;s power.</h4><p>Luke 10:20; 2 Cor. 7:9; Rom. 10:5; Gal. 2:20; James 4:6&#44; 10; 1 Peter 5:5&#44; 6; Micah 6:8; John 6:57</p><h2>The Need to Confront</h2><p>Do we care enough to confront? Before comfort there must be a true confronting. Read Galatians 6:1-10.</p><blockquote>Gal. 6:1&#44;2&mdash;Brethren&#44; if a man be overtaken in a fault&#44; ye which are spiritual&#44; restore such an one in the spirit of meekness; considering thyself&#44; lest thou also be tempted. 2 Bear ye one another&apos;s burdens&#44; and so fulfill the law of Christ.</blockquote><p>What is the Churches responsibility when a professing Christian commits a sin? Confronting is for true brethren that are spiritual to do. True brethren that are spiritual have the responsibility to confront the man that has been overtaken in a fault that he might be restored.</p><h3>Brethren&#44; if a man be overtaken in a fault&hellip;</h3><p>Always confront the wrong with the truth. Spiritual brethren must use the truth of Gods&rsquo; Word to confront the wrong. (John 1:11; Ps 69:8; 122:8; 133:1; Prov. 6:10-19) Confronting wrong is always done while depending on the grace of God to help. (Gal. 1:6; 2:21; 6:18) Where the grace of God is depended on there will be boldness and a prayer life. Boldness and a consistent prayer life is so important in striving for the restoration of the one overtaken. Because he is hurt&#44; hopeless and many times bitter&#44; it is impossible to renew him to repentance.</p><p>Paul confronted Peter:</p><blockquote>Galatians 2:11&mdash;But when Peter was come to Antioch&#44; I withstood him to the face&#44; because he was to be blamed.In 3 John 1:9&#44;10&#44; Paul commits to confronting Diotrephes during his next visit.</blockquote><p>I Cor. 8:12&mdash;But when ye sin so against the brethren&#44; and wound their weak conscience&#44; ye sin against Christ.</p><p>Rom. 8:12&mdash;Therefore&#44; brethren&#44; we are debtors&#44; not to the flesh&#44; to live after the flesh.</blockquote><p>Rom. 7:4; 8:13; 9:3; 10:1; 11:25; 15:15&#44; 30; 16:17; 1 Cor. 1:10&#44; 11; 3:1; 4:6; 6:5&#44; 8; 7:24</p><blockquote>1John 3:16&mdash;Hereby perceive we the love of God&#44; because he laid down his life for us: and we ought to lay down our lives for the brethren.</blockquote><p><strong>Instead of watching our wounded soldiers fall to the way side and simply continuing on our solo march&#44; we should carry a deep concern for our brethren that have fallen. We are commanded in this to the very extant of laying down our lives for the brethren&mdash;our life for theirs.</strong></p><p> The word &lsquo;fault&rsquo; (trespass&#44; or sin) means to stumble or fall. No matter how many have fallen we need to carry to them a message of reconciliation to God &lsquo;Be reconciled to God.&rsquo; Rom. 4:25; 5:15-20; II Cor. 5:17-20 ; Eph.2:1-5&mdash;But God&hellip;</p><blockquote>James 5:16&mdash;Confess your faults one to another&#44; and pray one for another&#44; that ye may be healed. The effectual fervent prayer of a righteous man availeth much.</blockquote><h3>Ye that are <strong>spiritual</strong>&hellip;</h3><blockquote>I Cor. 2:15&mdash;But he that is spiritual judgeth all things&#44; yet he himself is judged of no man.</blockquote><blockquote>I Thess. 5:21&mdash;Prove all things; hold fast that which is good.</blockquote><h4>Restore such an one Mt 4:21 Mt 21:16 1Co 1:10</h4><h4>In the spirit of meekness</h4><h4>Considering thyself&#44; lest thou also be tempted</h4><h3>Bear ye one another&apos;s burdens&hellip;</h3><p>The best possible way to restore someone is to confront them face to face about their behavior&#44; beliefs and attitudes. It is not easy and most people try to avoid confrontation (Matt. 18:15)&#44; but it becomes so helpful and necessary. More often than not we are dealing with issues in peoples&rsquo; lives that concern eternity. Our own discomfort and unease are a small price to pay if we can win a brother!</p><h4>Situations when confrontation is necessary:</h4><h5>When someone has offended or purposely hurt you.</h5><h5>When someone is displeasing to God through their behavior</h5><h5>Only under submission to the Pastor and in the fear of God.</h5><h4>Questions to ask yourself before confrontations.</h4><h5>What is my motive?</h5><p>Do I genuinely care about this person or are they just getting on my nerves? Correct motivation for confrontation includes: 1)To restore the person to fellowship and growth. 2)For God to show His love for them through you. 3)To help the person to know the truth and to love it and to live it</p><h5>Am I sure God is leading me to confront right now?</h5><p>Pray for the Holy Ghost to deal with them and lead you. Take your time and pray much about the confrontation. Am I sure God is leading? Have I fully examined mine own self in this area I desire to confront?Mat. 7:3&#44; 4; II Cor. 13:5</p><h5>Have I really tried to understand the person&apos;s action?</h5><p>Do I have the facts right? Go to the Brethren that can judge brethren righteously. (Deut. 1:16)</p><h5>Have I planned what I would say?</h5><p>Your tone of voice&#44; the words and the way you use the words are very important. Especially do not use anger as your dominant expression. (Prov. 12:18; James 1:19; Psalms 115:3; Prov. 17:9; Deut. 13:14)</p><h5>Have I anticipated what they might say and how I would answer?</h5><h5>Have I considered the consequences?</h5><p>Dangerous people and things need to be confronted and stopped both in the church and in society at large. (Acts 20:26; Gal. 2:11; Mat. 16:23)</p><blockquote>I Sam. 17:29&mdash;And David said&#44; What have I now done? Is there not a cause?</blockquote>"},"type":"READ_MD_FILE"}