{"id":209,"courseId":"cults","tasks":[],"title":"006 PERSONAL SAFEGUARDS AGAINST CULTS","fileType":"md","value":{"path":"C:\\sites\\github\\courses\\cults/006_personal-safeguards-against-cults.md","raw":"<h1>Personal Safeguards Against Cults</h1><h2>Spiritual Growth</h2><p>The spiritual infant must not tarry too long in infancy It is a critical time because they are easily taken advantage of by cultists. God has designed it to be a time of much growth and if one lays back or holds back (especially in rebellion&#44; disobedience&#44; doubt&#44; or fear) it will be detrimental to their spiritual growth. </p><blockquote>1 Peter 2:2&mdash;As newborn babes&#44; desire the sincere milk of the word&#44; that ye may grow thereby:&quot; They need to receive and be fed. </blockquote><p>The most important thing in the life of a new Christian is spiritual growth. The key to developing Christian maturity is the study of God&apos;s Word</p><blockquote>1 Timothy 4:16&mdash;Take heed unto thyself&#44; and unto the doctrine; continue in them: for in doing this thou shalt both save thyself&#44; and them that hear thee.</blockquote><blockquote>2 Timothy 2:15&mdash;Study to shew thyself approved unto God&#44; a workman that needeth not to be ashamed&#44; rightly dividing the word of truth.</blockquote><blockquote>John 8:31-32&mdash;Then said Jesus to those Jews which believed on him&#44; If ye continue in my word&#44; then are ye my disciples indeed; 32 And ye shall know the truth&#44; and the truth shall make you free.</blockquote><h2>True Wisdom</h2><p>In what does true wisdom consist? True wisdom consists in simple obedience to God and His Word. We should seek after only the wisdom that comes from God.</p><h2>Bible Memorization</h2><p>Bible Memorization is used to defeat the cults. Memorize only the truth but don&apos;t be ignorant of the devil&apos;s devices.</p><blockquote>Ps. 119:104&mdash;Through thy precepts I get understanding: therefore I hate every false way.</p><p>Ps. 119:128&mdash;Therefore I esteem all thy precepts concerning all things to be right; and I hate every false way. </p><p>2 Peter 1:3&mdash;According as his divine power hath given unto us all things that pertain unto life and godliness&#44; through the knowledge of him that hath called us to glory and virtue: </blockquote><p>1 Peter 5:10; 1 Thess. 2:12; 1 Thess. 4:4; 7; John 17:17; 2 Thess. 1:12 </p><h3>Memorize the Word of God.</h3><p>The value of memorizing Scripture can never be overstated. Never&#44; Never No Never! Ps. 119:9-11</p><h2>Memorize the word for spiritual wisdom and strength.</h2><p>Matt. 4:4; II Cor. 3:6&#44;15-18; John 1:1-5&#44;9&#44; 12&#44; 14&#44; 17; 3:15&#44; 16&#44; 36; 5:39; 6:27&#44; 35&#44; 48&#44; 51&#44; 57-58&#44; 68; 14:6;17:3; 20:31; I John 1:7; 2:24-26; 4:9; 5:11-13&#44; 20; II Peter 1:2-11</p><h3>Memorize the Word for truth against the false.</h3><p>I Tim.6:20; II Tim. 2:16</p><blockquote>John 8:32&mdash;And ye shall know the truth&#44; and the truth shall make you free.</blockquote><blockquote>Psalms 119:11&mdash;Thy word have I hid in mine heart&#44; that I might not sin against thee.</blockquote><blockquote>Ps alms 37:31&mdash;The law of his God is in his heart; none of his steps shall slide.</blockquote><blockquote>Eph. 4:14&mdash;That we henceforth be no more children&#44; tossed to and fro&#44; and carried about with every wind of doctrine&#44; by the sleight of men&#44; and cunning craftiness&#44; whereby they lie in wait to deceive;</blockquote><blockquote>Col. 2:8&mdash;Beware lest any man spoil you through philosophy and vain deceit&#44; after the tradition of men&#44; after the rudiments of the world&#44; and not after Christ.</blockquote><blockquote>Prov. 14:12&mdash;There is a way which seemeth right unto a man&hellip;</blockquote><blockquote>Prov. 16:25&mdash;There is a way that seemeth right unto a man&hellip;</blockquote><h2>Clear Biblical Understanding of Truth</h2><h3>There is the truth of Christianity&#44;</h3><p>It is a fact that there is a living and true God Who created the universe and Who loves us and has a plan for our lives. In the midst of a corrupt&#44; depraved world that pulls every living thing down into the grave of death&#44; there is the truth that God is and God loves. It is man&apos;s sin that has brought corruption and death into the world. Christianity declares God&apos;s love for the world. He is not a God of hate who has left man in the dark&#44; groping and grasping about&#44; trying to discover the truth about life and its source&#44; purpose&#44; and end. He is a God of love who has sent His only Son to remedy man&apos;s problems. God&apos;s way is the true order of life. John 1:1-5; 3:16-21; 8:32; 36; 14:6; 1Thess. 1:9 </p><h3>True Deity and True Humanity</h3><h4>The Fullness of God in Christ as a Man</h4><p>Always view Christ from the Scripture. Always view your position in Christ from the scripture.</p><h4>Viewing the Messiah in the Scripture</h4><p>Christ put emphasis on the inspiration of the Scriptures. Christ is God&apos;s Son&#44; Lord and man as the Son of David. Jesus Christ is the Messiah&#44; both God and man&#44; Divine and human. Jesus questioned them about what others were saying about Him in order to identify what they believed for themselves&mdash;less or more. Christ was not just telling them He was the Messiah&#44; but was looking for them to receive that revelation from God like Peter did in Matthew 16:17. They had already been given the Scriptures that claim the Messiah would be Divine and human&#44; both Lord and Christ and they were responsible for that already. (Matthew 22:42-45; 1 John 4:1-3; Colossians 2:9&#44; 10 )</p><blockquote> Acts 2:36&mdash;Therefore let all the house of Israel know assuredly&#44; that God hath made that same Jesus&#44; whom ye have crucified&#44; both Lord and Christ.</blockquote><h3>The Triune God</h3><p>Acts 10:38; 2 Cor. 13:14; Luke 4:18; Hebrews 1:9; Mat.3:16-17</p><p>Peter&apos;s Testimony Acts 4:25-27 </p><p>Paul&apos;s Testimony Acts 13:33 </p><p><strong>The Triune Testimony</strong></p><ul><li>God the Ruler voice of the Father Psa. 2:1-6 &quot;Lord&quot;</li><li>God the Mediator voice of the Son Psa.2: 7-9 &quot;Son&quot;</li><li>God the Comforter voice of the Holy Ghost Psa. 10-12 &quot;Trust in Him&quot;</li></ul><p>Luke24:49; John 2:22; 8:17-18&#44; 42; 12:16;14:16;15:26;16:7&#44;13;17:1&#44;3&#44;5&#44;21-26; 14:26; Rom.15:30; Gal. 4:6;1 John 2:20&#44; 23&#44; 27; 5:7; 2Jn.1:9; </p><blockquote>2 Cor. 13:14&mdash;The grace of the Lord Jesus Christ&#44; and the love of God&#44; and the communion of the Holy Ghost&#44; be with you all. Amen (Eph. 2:5-7&#44; 10&#44; 13&#44; 14&#44; 18) </blockquote><p>The Father is God - The Son is God - The Holy Ghost is God</p><blockquote>1 John 5:7&mdash;For there are three that bear record in heaven&#44; the Father&#44; the Word&#44; and the Holy Ghost: and these three are one. </blockquote><p>John 8:13&#44; 14; 1 John 5:2&#44; 15&#44; 18&#44; 19&#44; 20</p><blockquote>1 John 2:18-24&mdash;22 Who is a liar but he that denieth that Jesus is the Christ? He is antichrist&#44; that denieth the Father and the Son. 23 Whosoever denieth the Son&#44; the same hath not the Father: (but) he that acknowledgeth the Son hath the Father also.</blockquote><blockquote>1 John 4:1&mdash;Beloved&#44; believe not every spirit&#44; but try the spirits whether they are of God: because many false prophets are gone out into the world.</blockquote><blockquote>1 John 4:14&mdash;And we have seen and do testify that the Father sent the Son to be the Saviour of the world.1 John2:26&mdash;These things have I written unto you concerning them that seduce you.</blockquote><blockquote>1 John 4:6&mdash;We are of God: he that knoweth God heareth us; he that is not of God heareth not us. Hereby know we the spirit of truth&#44; and the spirit of error.</blockquote>"},"type":"READ_MD_FILE"}