{"id":210,"courseId":"cults","tasks":[],"title":"007 CULTIC PHILOSOPHIES IN THE CHURCH","fileType":"md","value":{"path":"C:\\sites\\github\\courses\\cults/007_cultic-philosophies-in-the-church.md","raw":"<h1>Cultic Philosophies in the Church</h1><p>The false philosophies of the devil are creeping into the church. Although most of them are not apparently present by name&#44; careful observation shows their undeniable influence in the church.</p><h2>Gnosticism</h2><p>What does the heresy of Gnosticism deny and what does it teach instead?</p><h3>Denies that faith is essential to salvation.</h3><h3>Teaches that knowledge is essential to salvation.</h3><p>Gnostics emphasize knowledge [gnosis] rather than faith [pistis]. Gnosticism is not by faith but is intellectual. Gnosticism ideals so-called rational knowledge.The Gnostic&apos;s concept of God is more subtle than most cults in that it unites and reconciles all the claims of Monotheism&#44; Polytheism&#44; Theism&#44; Deism and Pantheism!<strong>Theism</strong>- belief that one God created and rules humans and the world.<strong>Deism</strong> - a belief in God based on reason rather than revelation and involving the view that God has set the universe in motion but does not interfere with how it runs. Deism was especially influential in the 17th and 18th centuries.<strong>Pantheism</strong>- the belief that God and the material world are one and the same thing and that God is present in everythingWe need Faith in Jesus Christ and to be persuaded by the facts of the Word of God. We need God&apos;s grace in order to live a moral and righteous life in the fear of God. <strong>Knowledge alone is not enough</strong>.</p><h2>Phenomenalism</h2><p>What does the heresy of <strong>phenomenalism</strong> deny and what does it teach instead?</p><h3>Denies that the just shall live by faith.</h3><h3>Teaches that the just shall live by sight.</h3><p>They reject the existence of God and also deny that which is experienced by faith. Instead&#44; sensory phenomena&#44; is called \"pure data\" whose existence is to be considered before anything else: objects are logical constructions out of sense-data or ideas. In epistemology and the philosophy of perception&#44; <strong>phenomenalism</strong> is the view that physical objects do not exist as things in themselves but only as perceptual phenomena or sensory stimuli situated in time and in space. Simply&#44; objects exist only because I perceive them to exist.</p><p>[Practical Athiests and Logical Positivists hold a somewhat parallel theory in that knowledge can be acquired only through direct observation and experimentation&#44; and not through theology or faith.]</p><h2>Secularism</h2><p>Secularism is the exclusion of religion from public affairs; the belief that religion and religious bodies should have no part in political or civic affairs or in running public institutions&#44; especially schools. Secularism is the rejection of religion or its exclusion from a philosophical or moral system .Secularism is the false way. Public Officials have suffered a great falling away in principles. We have come a long way since the days of George Washington&#44; Thomas Jefferson or Abraham Lincoln&mdash;all were men who knew our public system&apos;s success was ultimately dependent on God.The voice of secularism is seeking our allegiance and much of its reasoning has influenced even Christian thought. Many Christians believe the church should not get involved in politics or public education. <strong>The church has allowed secularism to intimidate it into a powerless corner of tolerance and apathy</strong>.Secularism claims this world is all there is. They say that there is no Divine being behind the scenes of this world. Their voice is heard saying&#44; &lsquo;Look at the universe&#44; the earth&#44; this age in which you live&#44; for this is all there is. So live it up&#44; do what you want&#44; and do it now&mdash;for today is the only day to live for.&rsquo;For the sinner it is always a downhill road that gets worse and worse&#44; but for the Believer it only gets better and better and the best is always yet to come. A popular trend of thought among Christian&apos;s today that causes them to focus on the temporal more than the spiritual and eternal is undoubtedly the influence of secularism at work.The emphasis of secularism is the here and now&#44; ultimately including the elimination of any thought of God. Hence&#44; secularism allows us to live as we wish. \"If it feels good&#44; do it\"&mdash;no consequences&#44; no responsibility&#44; no guilt&#44; need of nothing. This is the philosophy and the blatant message splashed across the television&#44; movie screens&#44; and most other forms of media in the world today as well as within the backslidden church.</p><blockquote>Revelation 3:17&mdash;&hellip; thou art wretched&#44; and miserable&#44; and poor&#44; and blind&#44; and naked:</p><p>Revelation 3:20&mdash;Behold&#44; I stand at the door&#44; and knock: if any man hear my voice&#44; and open the door&#44; I will come in to him&#44; and will sup with him&#44; and he with me.</blockquote><p>The Lord is on the outside knocking wanting to be invited in.</p><h2>Humanism</h2><p>Humanism claims that this is a man-centered world having man as its highest authority. Man is the center of the universe and by default his own savior. When it comes to life&#44; man must save himself by eliminating conflict and war and by developing technology&#44; science&#44; and medicine to extend his life and to make life more comfortable.The world says that there is no god or power beyond man himself. Our health and life and future rest completely in our own hands. We are the determining masters of our own fate. Humanism is a philosophy being taught so widely that it is weakening the faith of multitudes worldwide.Man is a spiritual creation and needs more than that which comes from the natural realm in order to truly live. (Matthew 4:4; Ps. 107:20; Psalms 42:11;43:5; Prov. 3:8;4:22;12:18;13:17;16:24; Jer. 30:17;33:6; 3 John 1:2; Prov. 3:5-14)</p><h2>Relativism</h2><p>Relativism is a belief in changeable standards: the belief that concepts such as right and wrong&#44; good and bad&#44; or truth and falsehood are not absolute but change from culture to culture and situation to situation</p><p>Relativism is taught by people who say there are no moral absolutes&#44; nothing to fear&#44; and to question all authority. They say that the Ten Commandments are only suggestion and not commandments. In relativism&#44; each situation determines what is right or wrong. An action may be wrong today&#44; but right tomorrow. Then on another occasion and at a different time&#44; it may be wrong again. This is what is known as situation ethics. This philosophy allows man to change the rules according to each situation. Therefore&#44; there really are no rules. Nothing is ever \"always right\" or \"always wrong\" for all behavior is relative. There simply are no moral absolutes or so they think.</p><p>Malachi 3:6; Hebrews 13:8; Prov. 24:21</p><h2>Materialism</h2><p>Materialism is a philosophy theory of the physical: the theory that physical matter is the only reality and that psychological states such as emotions&#44; reason&#44; thought&#44; and desire will eventually be explained as physical functions. It focuses on possessions: devotion to material wealth and possessions at the expense of spiritual or intellectual values.</p><p>Materialism focuses only upon the material possessions and pleasures of this world. The primary focus is a life of ease&#44; comfort&#44; and pleasure. Sensual pleasure and material possessions become the focus of a person&apos;s life in materialism.&lsquo;There is nothing beyond this material universe; consequently&#44; a person should enjoy the sensual pleasures and the comforts of this world every day of his life.&rsquo; This philosophy is eating away at individuals and societies&#44; arousing people to crave more and more possessions and more and more power and more and more pleasure. As a result&#44; the work ethic and integrity of millions are being destroyed and the very stability of nations is being affected. Col 3:2 1 Tim. 6:5; 9&#44; 10; 17; 1 John 2:15-17; 2 Tim. 2:4; Luke 8:14</p><h2>Pragmatism</h2><p>Pragmatism claims that truth is determined by practical results. If it works&#44; it is truth and it should be done. Therefore&#44; if you find that some behavior or action works for you&#44; if it produces the results you want then do it. It is practical or pragmatic for you. Even if it means disobeying God&apos;s commandments or God&apos;s Word&#44; do it. \"The end justifies the means\" is a good example of this philosophy. For instance&#44; if a salesperson or a company stretches the truth in advertising its product and as a result sells many more of the item&#44; then the sales gimmick worked. Therefore it is the &lsquo;right thing&rsquo; to do&mdash;even though the truth was stretched to a lie and the public was deceived. Romans 3:4; Col. 3:9; Rev. 21:8</p><h2>Evolution and its Hybrids</h2><h3>Theory vs. Faith</h3><table><tbody><tr><th>THEORY-Evolution is the Answer</th><th>FAITH-God is the Answer</th></tr><tr><td>Speculation&#44; assumption&#44; supposition&#44; presumption&#44; guesses.</td><td>Confidence&#44; trust&#44; assurance&#44; conviction&#44; devotion&#44; obedience</td></tr><tr><td>Vague ideas that constantly change.</td><td>Absolute facts that never change.</td></tr><tr><td>Put together by man&apos;s thinking.</td><td>Built on God&apos;s Word.</td></tr><tr><td>Underlying humanism is present.</td><td>God-centered view is present.</td></tr><tr><td>Man has no absolute &lsquo;purpose&rsquo; (accidental).</td><td>Man&apos;s purpose is to fellowship with God.</td></tr><tr><td>Existence ends at death.</td><td>Must answer to God&apos;s final judgment.</td></tr><tr><td>Shifting Sand</td><td>Solid Rock</td></tr><tr><td>Lies</td><td>Truth</td></tr><tr><td>No provision for a savior.</td><td>Faith in Jesus is basis of salvation.</td></tr></tbody></table><p>Gen. 2:7; 1Cor. 1:9; Heb 9:27</p><h3>Origin of Evolution</h3><p>The theory of evolution has many beginnings that cannot be agreed upon. Evolution was a theory in Egypt; they taught that life evolved from the slime on the Nile River. This made the Nile the object of their devotion. Also&#44; Aristotle taught evolution in 400 BC. Charles Darwin only wrote down some theories without really any extensive scientific work. Others have taken those ideas and have tried to make them popular.Faith in creation has absolutely one beginning: God created everything.</p><blockquote>Gen. 1:1&mdash;In the beginning God created the heaven and the earth.</blockquote><p>Gen. 1:27; 2:4&#44;7; 5:1 &#44;2; Col 1:16&#44;17; John 1:1-4; Gen. 1:26-27; Job 33:4; John 17:5;</p><h3>The Theory of Evolution is the foundation for humanism&#44; racism&#44; and many other related dangerous ideas.</h3><p>Humanism teaches that man is his own god leaving him to his own destruction or exaltation. Evolution and Humanism both lead to racism. Read the whole title of Darwin&apos;s book. (emphasis added)</p><blockquote>\"\"\"The Origin of Species by means of Natural Selectionor&#44; The Preservation of Favoured Races in the Struggle for Life\"\"\"</blockquote><p>Evolution is the foundation for socialism&#44; communism&#44; Nazism&#44; one world religion&#44; New World order&#44; and other types of racism.</p><p>Evolution is based on slime&#44; soup&#44; rocks and a big bang that tries to destroy all moral values and lie to every person that will listen.</p><blockquote>John 8:44&mdash;Ye are of your father the devil&#44; and the lusts of your father ye will do. He was a murderer from the beginning&#44; and abode not in the truth&#44; because there is no truth in him. When he speaketh a lie&#44; he speaketh of his own: for he is a liar&#44; and the father of it.</blockquote><p>FROM FOOTNOTES: Karl Marx is the founder of communism who had 6 children: 3 died by starvation as infants and 2 committed suicide. Only 6 people came to his funeral.</p><h4>Karl Marx&apos;s 1848 Communist Manifesto outlined how to destroy a country:</h4><h5>Abolish private property.</h5><h5>Heavy progressive income tax. (The more they make the more you take.)</h5><h5>Abolish rights of inheritance.</h5><h5>Confiscation of property rights.</h5><h5>Central bank (owned and operated by the federal government)</h5><h5>Government ownership of Communication and TRANSPORTATION.</h5><h5>Government ownership of factories and agriculture.</h5><h5>Government control of labor.</h5><h5>Corporate farms&#44; regional planning</h5><h5>Free education by government controlled schools</h5><h5>Hitler said control the text book&#44; control the state.</h5><p>Communism and socialism are the enemies of liberty and Capitalism. Communism will destroy America if America doesn&rsquo;t destroy communism. Communism robs the individual of the same opportunities that their forefathers had and many of them laid down their lives to protect.</p><h4>Communist Rules for Revolution</h4><h5>Corrupt the young; get them away from true religion.</h5><h5>Break down the moral virtues.</h5><h5>Encourage civil disorders and a soft government attitude towards crime.</h5><h5>Divide the people into hostile groups (race/religion/homosexuality)</h5><h5>Get the people&apos;s mind off their government by focusing their attention on sports&#44; sex&#44; work&#44; tolerance&#44; etc.</h5><h5>Get control of all media.</h5><h5>Destroy people&apos;s faith in their leaders.</h5><h5>Cause the registration of all firearms on some pretext&#44;</h5><p>with a view to confiscate them and leaving the populace helpless</p><blockquote>Isa. 42:5&mdash;Thus saith God the LORD&#44; he that created the heavens&#44; and stretched them out; he that spread forth the earth&#44; and that which cometh out of it; he that giveth breath unto the people upon it&#44; and spirit to them that walk therein:</p><p>Mal 2:10&mdash;Have we not all one father? hath not one God created us? why do we deal treacherously every man against his brother&#44; by profaning the covenant of our fathers?</blockquote><p>America has always been founded on Christian principles and from its very beginning has been blessed of God. (Isaiah 18:2&#44;7; Acts 2:5&#44;21)</p><ul><li>From the beginning America has been protected with moral values.</li><li>Real Americans must rise up now or this nation will fall as well.</li><li>Jesus Christ is Lord and every knee shall bow.</li></ul><blockquote>Jer. 50:12&mdash;Your mother shall be sore confounded; she that bare you shall be ashamed: behold&#44; <strong>the hindermost of the nations</strong> shall be a wilderness&#44; a dry land&#44; and a desert</blockquote><blockquote>Jer. 50:15&mdash;Shout against her round about: she hath given her hand: her foundations are fallen&#44; her walls are thrown down: for it is the vengeance of the LORD: take vengeance upon her; as she hath done&#44; do unto her.</blockquote><p>Evolution is fabricated lies.</p><p>Creation is founded upon the Word of God</p><blockquote>Hebrews 1:2&#44;3&mdash;Hath in these last days spoken unto us by his Son&#44; whom he hath appointed heir of all things&#44; by whom also he made the worlds; 3 Who being the brightness of his glory&#44; and the express image of his person&#44; and upholding all things by the word of his power&#44; when he had by himself purged our sins&#44; sat down on the right hand of the Majesty on high;</blockquote><p>Faith in Jesus Christ Is the basis of Salvation. Man&apos;s theories will not save anybody.</p><blockquote>John 14:6&mdash;Jesus saith unto him&#44; I am the way&#44; the truth&#44; and the life: no man cometh unto the Father&#44; but by me.</blockquote><p>(Matthew 1:21; Mark 1:15; Luke 5:32; Acts 16:31; Rom. 10:9&#44;10; I Cor. 3:11)</p><h2>Mindlessness</h2><p>Mindlessness is a path of life followed by many.Mindless a) boring: uninteresting as a result of requiring little mental effort. b)purposeless: having no apparent purpose or rational cause. c)unconcerned: not careful or concerned .</p><p>Phil. 2:5; Hebrews 12:2-3; Isaiah 26:3; 1 John 3:8</p><p>Mindlessness indicates that a person walks through life thoughtlessly&#44; seldom if ever giving attention to proper behaviour&#44; the future&#44; God&#44; or to any possibility of life beyond this world. The mindless person lives just for today&#44; wrapped up in his own life and thoughts&#44; his own desires and wants. Little if anything concerns the person other than his own self-centered world. We need to be led by the Holy Ghost not driven by some selfish purpose. A person with this mindset simply gets up each day and goes about his activities with no thought as to consequences or outcome or how his behaviour might affect others. There is no plan&#44; no structure&#44; nor purpose to the person&apos;s life other than to plow through another day.</p>"},"type":"READ_MD_FILE"}