{"id":213,"courseId":"cults","tasks":[],"title":"010 EPISTLE OF JUDE","fileType":"md","value":{"path":"C:\\sites\\github\\courses\\cults/010_epistle-of-jude.md","raw":"# The Epistle of Jude\r\n\r\n> Jude 1,2&mdash; Jude, the servant of Jesus Christ, and brother of James, to them that are sanctified by God the Father, and preserved in Jesus Christ, and called: 2 Mercy unto you, and peace, and love, be multiplied.\r\n\r\n## Introduction to Jude: Equipped to Stand Against the Enemy\r\n\r\nThe main purpose in this study on Jude is to aid in memorizing the Epistle of Jude by giving a better understanding of it.\r\n\r\nJude is not addressed to any specific church or individual; therefore, it is called a general epistle, and is written to all Christians everywhere.\r\n\r\nJude was inspired from the beginning and he begins his letter in a manner that was customary for his time; which provides for the reader a place to get a grasp similar to the handle of a sword. Jude does write about the &lsquo;common salvation.&rsquo; He does not change his purpose; he simply intensifies his focus and begins to focus on an extremely unstable area for Christians in general. We have an adversary that is subtle but so violent. He is on a &lsquo;seek, kill, and destroy&rsquo; mission; a mission that is designed to discourage, deceive, and devour every child of God. (John 10:10; I Peter 5:8)\r\n\r\nThis sly enemy knows that the time to devour is during spiritual infancy, and the most success will be in the area of teaching or training. Jude recognizes this and says, after much serious contemplation about salvation in general, it was necessary for him to focus on this area that <strong>the enemy attacks</strong>. \r\n\r\nTherefore, Jude stands out as one of the great generals of the faith when it comes to training troops and arming them for withstanding the enemy. His epistle gives us the philosophy and principles for an effective defense &lsquo;against the wiles of the devil.&rsquo;\r\n\r\nPaul lays out the description of our adversary and of the soldier&apos;s armor for contending with him in Ephesians 6:10-18. Jude lays out the description of the soldier&apos;s mind set and tactics for contending with the enemy.\r\n\r\n## I. There is a God---There is one True God\r\n\r\nHe is a God:\r\n\r\n- That sanctifies, preserves and calls, v.1\r\n- Of Mercy, Peace and Love, v.2\r\n- Of Grace, Faith and Judgment, vv.3-5\r\n- Of Glory, Majesty, Dominion and Power, v.25\r\n\r\n## II. There are some true servants of God. v.1\r\n\r\n### A. There are true servants of God The Father, v.1\r\n\r\nSanctified by God the Father, v.1\r\n\r\n### B. There are some true servants of Jesus Christ the Son, v.1\r\n\r\nPreserved in Jesus Christ, and called, v.1\r\n\r\n### C. There are some true servants of the Holy Ghost, v.20\r\n\r\nFilled with a diligent Holy Faith, Love, Mercy, compassion, fear and purity. vv.3,20-24\r\n\r\n## III. An Enemy Attacks\r\n\r\n> Jude 3&mdash;Beloved, when I gave all diligence to write unto you of the common salvation, it was needful for me to write unto you, and exhort you that ye should earnestly contend for the faith which was once delivered unto the saints. 20 But ye, beloved, building up yourselves on your most holy faith, praying in the Holy Ghost, 21 Keep yourselves in the love of God, looking for the mercy of our Lord Jesus Christ unto eternal life.\r\n\r\nThere is an enemy and his adversary is the devil. What does an enemy do? He attacks. We must be aware of the strategies of the enemy in order to maintain a strong defense and offense. \r\n\r\n> Jude 4 &mdash;For there are certain men crept in unawares, who were before of old ordained to this condemnation, ungodly men, turning the grace of our God into lasciviousness, and denying the only Lord God, and our Lord Jesus Christ.\r\n\r\n## IV. Strengthen Your Position in Christ\r\n\r\nAwareness of the enemy&apos;s tactics is important, but before that we must make sure of our position in Christ.\r\n\r\n> Jude 1:1&mdash;Jude, the servant of Jesus Christ\r\n\r\nStrengthen your position as a <strong>Christian</strong>: a Christ follower. \r\n\r\nStrengthen your position as a <strong>leader</strong>: Walk in His steps.\r\n\r\n> I Peter 2:21&mdash;For even hereunto were ye called: because Christ also suffered for us, leaving us an example, that ye should follow his steps:\r\n\r\n> Romans 4:12&mdash;And the father of circumcision to them who are not of the circumcision only, but who also walk in the steps of that faith of our father Abraham, which he had being yet uncircumcised.\r\n\r\nWe must make our position in Christ sure before we confront the enemy. If there is a place in our life for the devil to get a hold of us, he is going to try!\r\n\r\n## V. Fight for Truth\r\n\r\nWe have to fight for that which is right, wholesome, and blessed because we have an adversary that is cunningly deceiving so many. It is for the sake of some that we need to form a bulwark and stand against his works. His strategy is to use &lsquo;certain men,&rsquo; a variety of men, or men that look just like anybody else, to carry out his treachery. They come in as it were through the side door unnoticed, without any fanfare, just quietly. These men have been previously selected for their mission of subversion. They begin by interpreting the precious grace, mercy, and long-suffering of God as a license to be selfish and to commit sin. \r\n\r\nThey say words like: \r\n- &lsquo;We all sin a little every day.&rsquo; \r\n- Then, they step down to: &lsquo;It&apos;s O.K. that we sin every day,&rsquo; \r\n- and then to: &lsquo;God expects us to sin every day,&rsquo; \r\n- until they stoop to actual denial of the Father and the Son. &lsquo;\r\n\r\nHe is antichrist, that denieth the Father and the Son,&rsquo; I John 2:22\r\n\r\n## VI. Some History of Apostasy\r\n\r\n> Jude 5,7&mdash; I will therefore put you in remembrance, though ye once knew this, how that the Lord, having saved the people out of the land of Egypt, afterward destroyed them that believed not.6 And the angels which kept not their first estate, but left their own habitation, He hath reserved in everlasting chains under darkness unto the judgment of the great day\r\n\r\n- I will therefore put you in remembrance\r\n- though ye once knew this&lsquo;Remember,&rsquo; he says; or, &lsquo;I will remind you, though you have known all along.&rsquo;\r\n- how that the Lord, having saved the people out of the land of Egypt\r\n- afterward destroyed them that believed not.\r\n- Angels&mdash; reserved in everlasting chains under darkness unto the judgment of the great day\r\n\r\nJude gives a little history of apostasy and some examples of God&apos;s judgment \r\n\r\n1) God delivered and \r\n2)God judged. Some do not maintain a position of safety (or, salvation). \r\n\r\nFirst, there are those who God has delivered in the past, like Israel from Egypt. Previous deliverance is not a guarantee of final, ultimate safety. The answer is simply to continue submitting to and believing in God, the Father and His Son, Jesus Christ. Be on guard against rebellion. \r\n\r\nNext, there are the angels. No honest man presumes to be angelic, but even if he were, that condition is not a guarantee for safety. The remedy here is vigilance, which is often connected with prayer when it refers to the believer.\r\n\r\n<ul>\r\n<li>We cannot afford to take life so lightly.\r\n</li>\r\n<li>Ye should earnestly contend for the faith which was once delivered unto the saints.\r\n</li>\r\n<li>Stay believing, keep in His Love.\r\n</li>\r\n</ul>\r\n<p>These angels were not watchful, and did not appreciate and stay in their place of safety. Thus, they are being held as prisoners on death row. Their judgment, however, will not be momentary&mdash;it will be eternal. You cannot befriend the devil at all and not suffer for it; the devil is \r\n<strong>always\r\n</strong> an adversary.\r\n</p>\r\n<blockquote>Jude 7&mdash;Even as Sodom and Gomorrha, and the cities about them in like manner, giving themselves over to fornication, and going after strange flesh, are set forth for an example, suffering the vengeance of eternal fire.\r\n</blockquote>\r\n<p>There are those who are so ensnared by pleasure-seeking and promiscuity, like Sodom and Gomorra, who will not heed and obey the moral laws of God, which He has inscribed on the conscience of every human being, who also will be punished in Hell. They refuse to forsake their vile, self-gratifying ways and flee to the place of refuge. The antidote is to know and obey God&apos;s Word.\r\n</p>\r\n<blockquote>Jude 8&mdash;Likewise also these filthy dreamers defile the flesh, despise dominion, and speak evil of dignities.\r\n</blockquote>\r\n<p>So also is the case with the false teachers of his day and ours. They also will be judged for their vile imaginations. Jude says they soil both the thinking and the conduct with their corrupt ideas. They reject or cast off any form of government, including God&apos;s authoritative Word. Also, they attempt to undermine the position and influence of those that are ordained and established in positions of authority. (Ephesians 4:11, 12; Hebrews 13:17)\r\n</p>\r\n<blockquote>Jude 9,10&mdash;Yet Michael the archangel, when contending with the devil he disputed about the body of Moses, durst not bring against him a railing accusation, but said, The Lord rebuke thee.10 But these speak evil of those things which they know not: but what they know naturally, as brute beasts, in those things they corrupt themselves.\r\n</blockquote>\r\n<p>Jude cautions us about railing against those in whom God has placed in power, authority, and anointing. He uses as an illustration the time when &lsquo;Michael the archangel,&rsquo; (a chief angel and considered to be the Angel of War) did not rail on Satan. He points out that Michael instead used the Lord&apos;s authority and rebuked him. We need to understand that we have no power to thwart or combat the enemy in ourselves or on our own. All that we have is found in His power and authority&mdash;&lsquo;The blood of Jesus is against you, Satan; and, I rebuke you in the name of Jesus.&rsquo;\r\n</p>\r\n<blockquote>Jude 11&mdash;Woe unto them! for they have gone in the way of Cain, and ran greedily after the error of Balaam for reward, and perished in the gainsaying of Core.\r\n</blockquote>\r\n<p>\"\"\"Woe\"\" Juea said. He said grief came to them because: (Compare with I John 2: 15-17):\"\r\n</p>\r\n<li>They have acted according to their own design and desires, like Cain.\r\n</li>\r\n<li>Cain&apos;s initial grievance, his jealousy, and his ultimate act of selfishness (murder) stemmed from his own presumptuous plan and act to worship God in his own way. Such thinking has been captured in the refrain of a certain song, which proclaims, &lsquo;&hellip;and I did it my way.&rsquo; Cain&apos;s way, which is the way of self, will lead to destruction.\r\n</li>\r\n<li>They have reasoned from circumstances and human logic (and, have sought personal gain and glory), like Balaam (Numbers 22-24), who was not only willing, but also sought God and actually went to curse God&apos;s children simply because of what he had judged from what he had seen or heard. Balak&apos;s messenger had said, &lsquo;Behold, there is a people come out from Egypt: behold, they cover the face of the earth, and they abide over against me: Come now therefore, I pray thee, curse me this people; for they are too mighty for me,&rsquo; Numbers 22:5, 6.\r\n</li>\r\n<li>They have also been contradictory and contentious, like Core (Korah, Numbers 16). They have refused to admit the value, worth, authority, or position of others. Pride, rebellion, and jealousy have been their adversary.\r\n</li>\r\n</ul>\r\n<blockquote>Jude 12,13&mdash;These are spots in your feasts of charity, when they feast with you, feeding themselves without fear: clouds they are without water, carried about of winds; trees whose fruit withereth, without fruit, twice dead, plucked up by the roots;13 Raging waves of the sea, foaming out their own shame; wandering stars, to whom is reserved the blackness of darkness for ever.\r\n</blockquote>\r\n\r\n## False Teachers AS Spots in Your Feasts of Charity\r\n\r\n<p>Jude further describes these crafty, presumptuous gainsayers or false teachers as: &lsquo;Spots in your feasts of charity,&rsquo; &lsquo;clouds&hellip;without water,&rsquo; &lsquo;trees whose fruit withereth,&rsquo; &lsquo;raging waves of the sea,&rsquo; and &rsquo;wandering stars.&rsquo; \r\n\r\nWhat is the meaning of this imagery? What does Jude mean by these word pictures? \r\n\r\nThese word pictures depict the treacherous nature and the instability of false teachers. The word spots should not be confused with soil or blemishes. This term denotes a ledge or reef of rock in the sea. In other words, these men are like those hidden rocks that cause ships to wreck even though they are close to shore (home, harbor, safety) and without any consideration of the fact that you are sacrificing for the benefit of others &lsquo;feasts of charity&rsquo;. They are as dangerous in the church as hidden rocks are in the ocean.\r\n</p>\r\n\r\n## False Teachers as Changeable and Undependable\r\n\r\n<p>Jude&apos;s second word picture refers to them as resembling or appearing to be something that they are not. It also refers to their changeable and undependable nature that is like the clouds, which are blown about by wind.\r\n</p>\r\n\r\n## False Teachers as Dead Trees\r\n\r\n<p>Word picture number three portrays them to be like trees that have been blown over by a storm. The leaves have dried up and blown away, the fruit still hangs on the branch but it has shriveled up, and the tree itself is dead because it has been &lsquo;plucked up by the roots.&rsquo; Many lessons might be drawn from this word picture but here are just a few:\r\n</p>\r\n<ul>\r\n<li>They are not good for shade (protection from the heat of life.)\r\n</li>\r\n<li>They are not useful as landmarks because they have been uprooted.\r\n</li>\r\n<li>They are not dependable as a source of sustenance.\r\n</li>\r\n</ul>\r\n\r\n## False Teachers as Raging Waves\r\n\r\n<p>Then, he pictures them as the churning, foaming, even wildly raging &lsquo;waves of the sea.&rsquo; False teachers can be very dangerous to those who are carried about by the tumult, but, to the person who stands safely on shore (The Rock) the &lsquo;raging&rsquo; of the false is merely boisterous noise. It is the noise they make that deceives the unwary and ultimately drowns them in deceptions.\r\n</p>\r\n\r\n## False Teachers as Roaming Planets\r\n\r\n<p>Lastly, Jude presents them as &lsquo;stars&rsquo; or planets that roam across the sky. Over time this term came to mean an erratic teacher.\r\n</p>\r\n\r\n## God's Judgement on the False Teachers and their Followers, vs. 14-19\r\n\r\nVerses fourteen to nineteen continue with Jude&apos;s vivid description of false teachers and God&apos;s judgment on them and on those who are duped by them.\r\n\r\n## Words of Praise to God\r\n\r\nFinally, Jude closes with words of praise to God and with wise counsel to those who want to do more than just &lsquo;hold the fort.&rsquo; If you want to be a member of the special forces (storm trooper, commando) Conqueror, Overcomer you need to:\r\n\r\n<ol>\r\n<li>Establish and strengthen yourself in the faith. (like a weight trainer)\r\n</li>\r\n<li>Pray in the Holy Ghost.\r\n</li>\r\n<li>Keep yourself in the love of God. (You can be loyal to truth and yet lack love.)\r\n</li>\r\n<li>Recognize the mercy of God at work in your life and in others.\r\n</li>\r\n<li>Have compassion on some. (Many will not let you help them.)\r\n</li>\r\n<li>Be friend enough to others to tell them just like it is, plainly.\r\n</li>\r\n<li>Remember that it is only Jesus who can keep us from falling.\r\n</li>\r\n<li>Know that He will &lsquo;present you faultless before the presence of His glory with exceeding joy.&rsquo;\r\n</li>\r\n<li>Give &lsquo;to the only wise God our Saviour&hellip;glory and majesty, dominion and power, both now and for ever.&rsquo;\r\n</li>\r\n</ol>"},"type":"READ_MD_FILE"}