{"id":28,"courseId":"acts","tasks":[],"title":"200 THE GOSPEL SPREADING","fileType":"md","value":{"path":"C:\\sites\\github\\courses\\acts/200_the-gospel-spreading.md","raw":"<h1>The Gospel Spreading</h1><img src=\"2nd_Year_ACTS_text_files/image003.png\">\r\n<p>Chapters 8-12</p>\r\n\r\n\r\n<h2>CHAPTER EIGHT</h2>\r\n<p>A. Saul Persecutes the Church vs. 1-3</p>\r\n<p>Chapter eight begins a new period in Church history. This is the first \"Great Persecution\" of the Church. Yes, Christ had been mistreated and crucified. Yes, the religious elite fought the Gospel from its beginning, but this period is marked by mass brutality of the saints. This is the most severe persecution the Church experienced up until this time. This was an organized effort to search out and eliminate Christianity.</p>\r\n<p>B. Philip Preaches in Samaria vs. 4-25</p>\r\n<p>C. Philip and the Ethiopian Eunuch vs. 26-40</p>\r\n\r\n\r\n<h2>CHAPTER NINE</h2>\r\n<p>A. The Conversion of Saul vs. 1-19</p>\r\n<p>B. Saul Preaches in Damascus vs. 20-22</p>\r\n<p>(He is not called <i>Paul</i> for the first time until his first missionary journey. 13:9)</p>\r\n<p>C. Saul Escapes from the Jews vs. 23-25</p>\r\n<p>D. Saul in Jerusalem vs. 26-31</p>\r\n<p>E. The Healing of Aeneas vs. 32-35</p>\r\n<p>F. Peter in Lydda and Joppa vs. 36-42</p>\r\n\r\n\r\n<h2>CHAPTER TEN</h2>\r\n<p>A. Peter and Cornelius vs. 1-33</p>\r\n<p>Instructions are given from God to humble the prejudiced. God does not view man in light of his personality or nationality or race and neither should we. God views man relation to His Son, Jesus Christ. He sees those Born of God and those Lost without Him.</p>\r\n<p>B. Gentiles Hear the Good News vs. 34-43</p>\r\n<p>1. God is no respecter of Persons </p>\r\n<p>i. Healing is for all 38</p>\r\n<p>ii. Deliverance is for all</p>\r\n<p>iii. Salvation is for whosoever will believe</p>\r\n<p>2. God is no respecter of Nations</p>\r\n<p>C. Gentiles Receive the Holy Spirit vs. 44-48</p>\r\n<p>The Gift of the Holy Ghost was poured out on the Gentiles also.</p>\r\n<p>1. Peter was used of God in Jerusalem 2:1-5:42</p>\r\n<p>2. Peter was used of God in Samaria 8:14-25</p>\r\n<p>3. Peter was used of God to the Gentiles 10:44; 11:15</p>\r\n<p>IV. CHAPTER ELEVEN</p>\r\n<p>A. Peter Reports to the Church vs. 1-18</p>\r\n<p>1. Salvation must come first; Religious form, ceremony, rituals, rules, and regulations cannot be placed before the lives and salvation of men.</p>\r\n<p>2. They should have rejoiced for the saved that were brought to the knowledge of Christ. Instead their spirits were full of contention and divisiveness because some religious practices were violated.</p>\r\n<p>3. Prejudice, discrimination, rituals, and rules can blind us to God's purpose to reach out to <em>all</em> men in salvation. All men are to be reached no matter who they are. No church should exclude anyone. The church's mission is to reach both the Jews and the Gentiles, poor and the rich, dirty and the clean, the lower, middle and the upper class.</p>\r\n<p>B. The Church in Antioch vs. 19-30</p>\r\n<p>a. The Effect of the Grace of God 23</p>\r\n<p>i. The Grace of God was seen</p>\r\n<p>1. \"seen the grace of God\"</p>\r\n<p>ii. The invisible became visible</p>\r\n<p>1. Grace is invisible like the wind but can be felt, but in this case was seen in its results.</p>\r\n<p>2. Grace like gravity is invisible but watch the effect it has.</p>\r\n<p>3. Grace like life has its effect</p>\r\n<p>iii. The Grace of God effected Barnabas, was glad and exhorted them.</p>\r\n<p>V. CHAPTER TWELVE</p>\r\n<p>A. James Killed and Peter Imprisoned vs. 1-5</p>\r\n<p>Persecution against active Witnesses. Killed one of the three leading disciples.</p>\r\n<p>Acts 12:1,2&mdash;Now about that time Herod the king stretched forth his hands to <b><u>vex</u></b>certain of the church</i>. 2 <i>And he <b><u>killed</u></b> James the brother of John with the sword.</i></p>\r\n<p><b><u></u></b></p>\r\n<p>Acts 12:3 <i>And because he saw it pleased the Jews, he proceeded further to take Peter also. (Then were the days of unleavened bread.)</i></p>\r\n<p>1. It was Passover, the days of unleavened bread.</p>\r\n<p>Hundreds of thousands of Jews came to Jerusalem. People were filled with a festive, merry spirit. Herod could really gain popularity among multitudes of people.</p>\r\n<p>2. Herod arrested and jailed Peter the apostle. Herod was planning to execute Peter after the Passover. This was Peter's third imprisonment for the sake of his Lord</p>\r\n<p>3. Herod had Peter heavily guarded 12:4,5</p>\r\n<p>4. Herod must of felt the pain of blood on his hands</p>\r\n<p>B. Peter Delivered from Prison vs. 6-19</p>\r\n<p>C. The Death of Herod vs. 20-25</p>\r\n<p>Acts 12:20-24&mdash;And Herod was highly displeased with them of Tyre and Sidon: but they came with one accord to him, and, having made Blastus the king's chamberlain their friend, desired peace; because their country was nourished by the king's country.21 And upon a set day Herod, arrayed in royal apparel, sat upon his throne, and made an oration unto them. 22 And the people gave a shout, saying, It is the voice of a god, and not of a man. 23 And immediately <u>the angel of the Lord smote him</u>, because he gave not God the glory: and he was eaten of worms, and gave up the ghost.24 But the word of God grew and multiplied.</i></p>\r\n<p>D. The Triumphant Gospel 12:24</p>\r\n<p>a. The Word of God progressing through faith cannot be stopped.</p>\r\n<p>i. God has ordained his word to be spoken</p>\r\n<p>ii. God has ordained His word to produce fruit after His kind</p>\r\n<p>b. John Mark was discipled by three of God's greatest servants</p>\r\n<p>i. Peter 12:12</p>\r\n<p>ii. Paul 12:25</p>\r\n<p>iii. Barnabas</p>\r\n<p><i>I.</i></p> "},"type":"READ_MD_FILE"}