{"id":30,"courseId":"acts","tasks":[],"title":"300 FIRST MISSIONARY JOURNEY","fileType":"md","value":{"path":"C:\\sites\\github\\courses\\acts/300_first-missionary-journey.md","raw":"<h1>First Missionary Journey</h1><img src=\"/assets/maps/paul-first-missionary-journey.jpg\">\r\n<p>Chapters 13:1-15:35</p>\r\n<p>Antioch à Selucia à Salamis, Cyprus à Paphos à Perga à Antioch of Pisidia à Iconium à Lystra à Derbe à Lystra à Iconium à Antioch of Pisidia à Perga à Attalia à Antioch of Syria.</p>\r\n\r\n\r\n<h2>CHAPTER THIRTEEN</h2>\r\n<p>A. Barnabas and Saul Commissioned vs. 1-3</p>\r\n<p>Paul, Barnabas and John Mark all begin this mission. (12:25)</p>\r\n<p>B. The Apostles Preach in Cyprus vs. 4-12</p>\r\n<p>C. Paul and Barnabas in Antioch of Pisidia vs. 13-52</p>\r\n<p>v.13 John Mark departed and returned to Jerusalem.</p>\r\n<p>v. 14-40 Paul's First Recorded Sermon</p>\r\n<p>\"Antioch is in the extreme north of Pisidia. Here they found a synagogue and many proselytes. They met with great success in preaching the gospel, but the Jews stirred up a violent opposition against them, and they were obliged to leave the place. On his return, Paul again visited Antioch for the purpose of confirming the disciples (Acts14:21). It has been identified with the modern Yalobatch, lying to the east of Ephesus.\" [EASTON'S BIBLE DICTIONARY]</p>\r\n\r\n\r\n<h2>CHAPTER FOURTEEN</h2>\r\n<p>A. Paul and Barnabas in Iconium vs. 1-7</p>\r\n<p>B. Paul and Barnabas in Lystra and Derbe vs. 8-20</p>\r\n<p>C. The Return to Antioch in Syria vs. 21-28</p>\r\n\r\n\r\n<h2>CHAPTER FIFTEEN, Part A (vs. 1-35)</h2>\r\n<p>A. The Council at Jerusalem vs. 1-21</p>\r\n<p>Acts 15:12&mdash;Then all the multitude kept silence, and gave audience to Barnabas and Paul, declaring what miracles and wonders God had wrought among the Gentiles by them.</i></p>\r\n<p>God willed this meeting because of their wrong thinking and to settle any disputes later.</p>\r\n<p>Galatians 2:2&mdash;And I went up by revelation, and communicated unto them that gospel which I preach among the Gentiles, but privately to them which were of reputation, lest by any means I should run, or had run, in vain.</i></p>\r\n<p>B. The Council's Letter to Gentile Believers vs. 22-35</p> "},"type":"READ_MD_FILE"}