{"id":317,"courseId":"doctrine-3","tasks":[],"title":"1300 WORK OF CHRIST","fileType":"md","value":{"path":"C:\\sites\\github\\courses\\doctrine-3/1300_work-of-christ.md","raw":"\r\n<h1>THE WORK OF CHRIST</h1>\r\n<h2>The ministry of Christ</h2>\r\n<h3>Jesus had compassion on the sick and healed all that came unto Him.</h3>\r\n<blockquote>Acts 10:38 How God anointed Jesus of Nazareth with the Holy Ghost and with power: who went about doing good&#44; and healing all that were oppressed of the devil; for God was with him.</blockquote>\r\n<h3>Teaching and preaching the Word of God.</h3>\r\n<blockquote>Matthew 4:23 And Jesus went about all Galilee&#44; teaching in their synagogues&#44; and preaching the gospel of the kingdom&#44; and healing all manner of sickness and all manner of disease among the people.</blockquote>\r\n<h3>Bringing deliverance to the captives.</h3>\r\n<blockquote>Luke 4:18 The Spirit of the Lord is upon me&#44; because he hath anointed me to preach the gospel to the poor; he hath sent me to heal the brokenhearted&#44; to preach deliverance to the captives&#44; and recovering of sight to the blind&#44; to set at liberty them that are bruised&#44;</blockquote>\r\n<blockquote>Matthew 8:16 When the even was come&#44; they brought unto him many that were possessed with devils: and he cast out the spirits with his word&#44; and healed all that were sick:</blockquote>\r\n<h2>The redemptive work of Christ</h2>\r\n<p>The most important work of Christ was to purchase redemption for man through His death upon the cross. The Word became flesh for the purpose of dying for lost humanity. </p>\r\n<h3>The death of Christ</h3>\r\n<h4>Satisfied the penalty of sin according to the Law of God.</h4>\r\n<blockquote>Romans 6:23 For the wages of sin is death; but the gift of God is eternal life through Jesus Christ our Lord.</blockquote>\r\n<blockquote>1 Corinthians 15:3 For I delivered unto you first of all that which I also received&#44; how that Christ died for our sins according to the scriptures;</blockquote>\r\n<h4>Appeased the judgment of God through the sacrifice of the Divine blood of the Lamb of God.</h4>\r\n<blockquote>Romans 3:25 Whom God hath set forth to be a propitiation through faith in his blood&#44; to declare his righteousness for the remission of sins that are past&#44; through the forbearance of God;</blockquote>\r\n<p>The Greek word here rendered propitiation refers to the Mercy seat. The Mercy seat is the place where the High priest sprinkled the blood of a lamb on the Day of Atonement to satisfy the wrath of God against the sins of the people. Jesus became our Mercy seat when He offered Himself as the pure spotless Lamb of God and shedding His blood as the supreme sacrifice for the sin of humanity.</p>\r\n<h4>Defeated the power of death.</h4>\r\n<blockquote>Matthew 12:40 For as Jonas was three days and three nights in the whale&apos;s belly; so shall the Son of man be three days and three nights in the heart of the earth.<p></p>\r\n<p>Hebrews 2:14 For as much then as the children are partakers of flesh and blood&#44; he also himself likewise took part of the same; that through death he might destroy him that had the power of death&#44; that is&#44; the devil;</p></blockquote>\r\n<p>Jesus went into the region of the dead to defeat death. Death could not hold the Son of God. Jesus defeated the devil that had the power of death. Jesus stripped the devil of his power and authority and took the keys of death away from the devil. </p>\r\n<blockquote>Revelation 1:18 I am he that liveth&#44; and was dead; and&#44; behold&#44; I am alive for evermore&#44; Amen; and have the keys of hell and of death.</blockquote>\r\n<h3>The resurrection of Christ</h3>\r\n<p>The resurrection of Christ is the event that separates Jesus from other religious leaders and false messiahs. Buddah&#44; Mohamed&#44; Sun Myung Moon and other false messiahs are in the grave. There is an empty tomb in Jerusalem where Jesus lay for three days&#44; but when the three days were fulfilled Christ arose victorious over death&#44; hell and the grave. </p>\r\n<h2>The continued intercession of Christ</h2>\r\n<blockquote>Romans 8:34 Who is he that condemneth? It is Christ that died&#44; yea rather&#44; that is risen again&#44; who is even at the right hand of God&#44; who also maketh intercession for us.</blockquote>\r\n<p>Jesus ascended back to heaven and is at the right hand of the Father who ever lives to make intercession for us. The Scripture tells us that Jesus our Great High Priest is still interceding for us in heaven.</p>\r\n<p>The Old Testament high priest interceded for the people on the Day of Atonement sprinkling the blood of a lamb on the Mercy Seat for the sins of the people. Jesus offered Himself once shedding His Divine blood for the sins of humanity. The blood of Jesus still has the power to make the vilest sinner clean. The Father views the justified saint through the redemptive work of Christ. Jesus is still our Great High Priest.</p>\r\n<blockquote>Hebrews 7:25 Wherefore he is able also to save them to the uttermost that come unto God by him&#44; seeing he ever liveth to make intercession for them.</blockquote>"},"type":"READ_MD_FILE"}