{"id":324,"courseId":"doctrine-3","tasks":[],"title":"2000 ERRONEOUS VIEW OF THE TRINITY","fileType":"md","value":{"path":"C:\\sites\\github\\courses\\doctrine-3/2000_erroneous-view-of-the-trinity.md","raw":"# Erroneous views \r\n\r\nTHESE ARE FALSE VIEWS!\r\n\r\n## Sabellianism\r\n\r\n### Bishop Sabellius taught that Father, Son, and Holy Ghost are simply three aspects or manifestations of God\r\n\r\n### There are three manifestations of one God\r\n\r\n#### Sometimes this is referred to as three personalities\r\n\r\n#### God does not have split personalities\r\n\r\n### Oneness teaching falls under this category\r\n\r\n### Refutation to this view\r\n\r\n#### Scripture clearly teaches the plurality of the Godhead\r\n\r\nElohim is a plural noun.\r\n\r\n> In the beginning God created the heaven and the earth.&mdash;Genesis 1:1\r\n\r\nPlural pronouns used to refer to God.\r\n\r\n> And God said, Let us make man in our image, after our likeness&mdash;Genesis 1:18\r\n\r\nThe Bible reveals there are three persons within One God.\r\n\r\n> For there are three that bear record in heaven, the Father, the Word, and the Holy Ghost: and these three are one.&mdash;1 John 5:7\r\n\r\n#### There are sharp distinctions revealed in Scripture between the Father, Son, and Holy Spirit\r\n\r\n##### The Father sent the Son\r\n\r\n> For God so loved the world, that he gave his only begotten Son, that whosoever believeth in him should not perish, but have everlasting life&mdash;John 3:16\r\n\r\n> I came forth from the Father, and am come into the world: again, I leave the world, and go to the Father.&mdash;John 16:28\r\n\r\n##### The Son returns to the Father\r\n\r\n> Jesus saith unto her, Touch me not; for I am not yet ascended to my Father: but go to my brethren, and say unto them, I ascend unto my Father, and your Father; and to my God, and your God.&mdash;John 20:17\r\n\r\n> A little while, and ye shall not see me: and again, a little while, and ye shall see me, because I go to the Father.&mdash;John 16:16\r\n\r\n##### The Father and Son send the Spirit\r\n\r\n> But when the Comforter is come, whom I will send unto you from the Father, even the Spirit of truth, which proceedeth from the Father, he shall testify of me:&mdash;John 15:26\r\n\r\n> Nevertheless I tell you the truth; It is expedient for you that I go away: for if I go not away, the Comforter will not come unto you; but if I depart, I will send him unto you.&mdash;John 16:7\r\n\r\n##### The Spirit intercedes with the Father\r\n\r\n> Likewise the Spirit also helpeth our infirmities: for we know not what we should pray for as we ought: but the Spirit itself maketh intercession for us with groanings which cannot be uttered.&mdash;Romans 8:26\r\n\r\n#### The Bible defines the oneness of God.\r\n\r\n> And the glory which thou gavest me I have given them; that they may be one, even as we are one:&mdash;John 17:26\r\n\r\nThe body is one in unity, yet many in person.\r\n\r\n> Wherefore they are no more twain, but one flesh. What therefore God hath joined together, let not man put asunder.&mdash;Matthew 19:6\r\n\r\nHusband and wife become one, yet there are still two persons.\r\n\r\n## Arianism\r\n\r\n### Arius\r\n\r\n#### Presbyter of Alexandria about  AD 318\r\n\r\n#### Taught the Son is subordinate to the Father\r\n\r\n### Christ is not eternal in existence\r\n\r\n#### Jesus had a beginning\r\n\r\n#### Jesus is a lesser God \r\n\r\nREMEMBER THIS IS THE FALSE VIEW!\r\n\r\n### Refutation to this view\r\n\r\n#### The Son is God\r\n\r\n> In the beginning was the Word, and the Word was with God, and the Word was God.&mdash;John 1:1\r\n\r\n#### Jesus is equal with God\r\n\r\n> Let this mind be in you, which was also in Christ Jesus: Who, being in the form of God, thought it not robbery to be equal with God:&mdash;Philippians 2:5-6\r\n\r\n> For in him dwelleth all the fulness of the Godhead bodily.&mdash;Colossians 2:9\r\n\r\n#### Christ is eternal.\r\n\r\n> I am Alpha and Omega, the beginning and the ending, saith the Lord, which is, and which was, and which is to come, the Almighty.&mdash;Revelation 1:8\r\n\r\n> But thou, Bethlehem Ephratah, though thou be little among the thousands of Judah, yet out of thee shall he come forth unto me that is to be ruler in Israel; whose goings forth have been from of old, from everlasting.&mdash;Micah 5:2\r\n\r\nThis is a Messianic prophecy.\r\n\r\n## Tritheism\r\n\r\n### The belief in three Gods\r\n\r\n### Refutation to this view\r\n\r\n#### Scripture declares there is One God\r\n\r\n> Hear, O Israel: The LORD our God is one LORD:&mdash;Deuteronomy 6:4 \r\n\r\nSingular - Plural - Singular\r\n\r\nJehovah our Elohim is one Jehovah\r\n\r\nThese three are one (I John 5:7).\r\n\r\n#### One God revealed in three Persons\r\n\r\nNot three Gods.\r\n\r\nMore than one God would be contrary to Scripture.\r\n\r\n> Thou shalt have no other gods before me.&mdash;Exodus 20:3\r\n\r\n#### Polytheism is an erroneous view of God"},"type":"READ_MD_FILE"}