{"id":7,"courseId":"a-students-commentary-on-romans","tasks":[],"title":"007 CHAPTER 7","fileType":"html","value":{"path":"C:\\sites\\github\\courses\\a-students-commentary-on-romans/007_chapter-7.html","raw":"<p align=\"center\" style=\"text-indent: 0.25in; margin-bottom: 0in; line-height: 100%; orphans: 2; widows: 2\">\r\n<font color=\"#800000\"><font face=\"Times New Roman, serif\"><font size=\"4\" style=\"font-size: 14pt\"><b>Chapter\r\nSeven</b></font></font></font></p>\r\n<p align=\"center\" style=\"text-indent: 0.25in; margin-bottom: 0in; line-height: 100%; orphans: 2; widows: 2\">\r\n<br/>\r\n\r\n</p>\r\n<p align=\"center\" style=\"text-indent: 0.25in; margin-bottom: 0in; line-height: 100%; orphans: 2; widows: 2\">\r\n<font color=\"#800000\">&quot;<font face=\"Times New Roman, serif\"><font size=\"3\" style=\"font-size: 12pt\">The\r\nDominion of the Law&quot;</font></font></font></p>\r\n<p style=\"text-indent: 0.25in; margin-bottom: 0in; line-height: 100%; orphans: 2; widows: 2\">\r\n<br/>\r\n\r\n</p>\r\n<p style=\"text-indent: 0.25in; margin-bottom: 0in; line-height: 100%; orphans: 2; widows: 2\">\r\n<font face=\"Times New Roman, serif\"><font size=\"3\" style=\"font-size: 12pt\">The\r\napostle having, in the preceding chapter, shown the converted\r\nGentiles the obligations they were under to live a holy life,\r\naddresses himself here to the Jews who might hesitate to embrace the\r\nGospel; lest, by this means, they should renounce the law, which\r\nmight appear to them as a renunciation of their allegiance to God.\r\nAs they rested in the law, as sufficient for justification and\r\nsanctification, it was necessary to convince them of their mistake.\r\nThat the law was insufficient for their justification the apostle had\r\nproved, in chapters iii., iv., and v.; that it is insufficient for\r\ntheir sanctification he shows in this chapter; and introduces his\r\ndiscourse by showing that a believing Jew is discharged from his\r\nobligations to the law, and is at liberty to come under another and\r\nmuch happier constitution, viz. that of the Gospel of Christ, Ro\r\n7:1-4. In Ro 7:5 he gives a general description of the state of a\r\nJew, in servitude to sin, considered as under mere law. In Ro 7:6 he\r\ngives a summary account of the state of a Christian, or believing\r\nJew, and the advantages he enjoys under the Gospel&mdash;Adam Clarke.</font></font></p>\r\n<p style=\"text-indent: 0.25in; margin-bottom: 0in; line-height: 100%; orphans: 2; widows: 2\">\r\n<font face=\"Times New Roman, serif\"><font size=\"3\" style=\"font-size: 12pt\">Paul\r\nnow moves from the law of sin and draws illustration from the Mosaic\r\nLaw. As a man is bound to is wife so long as they both live, so does\r\nthe law having binding power over a person as long as they live in\r\nthe flesh. Death looses a man or wife from their spouse and so death\r\nof the flesh looses an individual from the law of sin. We cannot\r\nserve God while in the flesh for we are bound by the law of nature to\r\nsin. The flesh is the enemy of God and cannot be made subservient to\r\nHim. The only freedom from sin is to be found in death of the carnal\r\nman. When he dies then are we free to marry another. </font></font>\r\n</p>\r\n<p style=\"text-indent: 0.25in; margin-bottom: 0in; line-height: 100%; orphans: 2; widows: 2\">\r\n<font face=\"Times New Roman, serif\"><font size=\"3\" style=\"font-size: 12pt\">Paul\r\ncompletes the chapter with a personal testimony to illustrate the\r\nsame principle. This is not Paul the Apostle&apos;s testimony per se but\r\nSaul of Tarsus&apos; testimony. He was a man that was blameless\r\nconcerning the law, but yet found sin to be his master. The things he\r\nwould like to do he could not, and the things that he did not want to\r\ndo he did. Paul isn&apos;t presenting this as the condition of the\r\nBeliever where we just have to sin a little every day. No! Paul cries\r\nout in testimony for deliverance. </font></font><font face=\"Times New Roman, serif\"><font size=\"3\" style=\"font-size: 12pt\"><i>O\r\nwretched man that I am! who shall </i></font></font><font face=\"Times New Roman, serif\"><font size=\"3\" style=\"font-size: 12pt\"><i><b>deliver</b></i></font></font><font face=\"Times New Roman, serif\"><font size=\"3\" style=\"font-size: 12pt\"><i>\r\nme from the body of this death?</i></font></font><font face=\"Times New Roman, serif\"><font size=\"3\" style=\"font-size: 12pt\">\r\nThat is he sees beyond this weak condition a promise of something\r\nbetter.</font></font></p>\r\n<p style=\"text-indent: 0.25in; margin-bottom: 0in; line-height: 100%; orphans: 2; widows: 2\">\r\n<font face=\"Times New Roman, serif\"><font size=\"3\" style=\"font-size: 12pt\">Adam\r\nClarke speaks concerning this twenty-fourth verse an interesting\r\nnote. &quot;&hellip;there seems to be here an allusion to an ancient custom\r\nof certain tyrants, who bound a dead body to a living man, and\r\nobliged him to carry it about, till the contagion from the putrid\r\nmass took away his life!&quot; Paul is painting a startling picture in\r\norder to awaken his readers to the reality of the gruesomeness of\r\nsin. This picture of a dead body bound to a man is the parallel to\r\nverse 25, </font></font><font face=\"Times New Roman, serif\"><font size=\"3\" style=\"font-size: 12pt\"><i>I\r\nthank God through Jesus Christ our Lord. So then with the mind I\r\nmyself serve the law of God; but with the flesh the law of sin</i></font></font><font face=\"Times New Roman, serif\"><font size=\"3\" style=\"font-size: 12pt\">.\r\nFor so is the condition of the regenerated man however good his\r\nintentions may be.</font></font></p>\r\n"},"type":"READ_HTML_FILE"}