{"id":71,"courseId":"book-of-revelation","tasks":[],"title":"REV 006 PERGAMOS","fileType":"html","value":{"path":"C:\\sites\\github\\courses\\book-of-revelation/rev-006-pergamos.html","raw":"<h1>The Third Letter: Pergamos</h1>\r\n\r\n<h2>Messenger - \"Martin of Tours\"</h2>\r\n<p>Martin of Tours (France). \"Unto the angel of the Church\"</p>\r\n<p>His conversion took place after helping a poor beggar, took his own coat and cut it in two with his sword, wrapped the man in it and went his way. That night the Lord appeared unto him, in a vision, wrapped in the half of Martin's garment. He spoke to him, \"Martin, though he is only a common soldier, has clothed Me with his garment.\" From that time on he sought to serve the Lord. His life was a series of miracles.After leaving the army, he became a leader in the church, he became very militant against idolatry. Challenged the pagans as Elijah did the False Prophets. He offered to be tied to a tree on its underside so that when it was cut down it would crush him unless God intervened. They tied him to a tree that was growing on the side of a hill, assured that the natural pull of gravity would fall and crush him. Just as the tree began to fall, God swung it around uphill and crushed several of the heathens as they were fleeing. Raised a man to life that had been hung for his faith.</p>\r\n<p>Martin wanted to see the emperor&mdash;he was refused audience. Martin laid at the gate and prayed. The iron gate opened and he heard a voice bidding him to rise. The ruler would not turn his head to speak to him. Martin prayed. Suddenly a fire came spontaneously from the seat of the throne and the emperor vacated speedily.</p>\r\n<p>They came to kill him.He stood erect and bared his throat to the sword. As they leaped forward, the power of God hurled them back across the room. So overcome with fear, they begged forgiveness.</p>\r\n\r\n<h2>City - \"Pergamos\"</h2>\r\n<p>The name \"Pergamos\" expresses the idea of a tower. Pergamos was the most illustrious city in Asia. It was also a city of great sin. They worshipped an idol in a form of a living serpent, housed and fed in the temple.</p>\r\n<p>v. 13 \"Even where Satan's seat is\" How did it become the seat of Satan? Babylon fell - to the Medes and Persians. The priest, A Halus - fled the city and went to Pergamos and started over.</p>\r\n<p>The Age lasted 312 - 606 A.D.</p>\r\n\r\n<h2>Commendation - vs. 13</h2>\r\n<h3>Their labor</h3>\r\n<h3>Their stand under oppression</h3>\r\n<p>Not a thing of location, but of character. I know thy works and where thou dwellest,&hellip;Even where Satan's seat is:</p>\r\n<h3>Did not deny His Name</h3>\r\n<blockquote>And thou holdest fast my name.</blockquote>\r\n<h3>Did not deny the faith</h3>\r\n<blockquote>And hast not denied my faith</blockquote>\r\n<h3>Was not affected by Martyrdom</h3>\r\n<blockquote>Antipas was my faithful martyr Who was slain among you</blockquote>\r\n\r\n<h2>Complaint - vs. 14,15</h2>\r\n<blockquote>\"But I have a few things against thee\"</blockquote>\r\n<h3>Doctrine of Balaam -</h3>\r\n<blockquote>Who taught Balac to cast a stumbling block before the children of Israel. [Numbers 25:1-9]</blockquote>\r\n<blockquote>To eat things sacrificed unto idols</blockquote>\r\n<blockquote>And to commit fornication</blockquote>\r\n<h3>Doctrine of the Nicolaitanes -</h3>\r\n<p>They were deeds in the Ephesus age - now a doctrine</p>\r\n\r\n<h2>Caution - vs. 16</h2>\r\n<blockquote>v. 16 \"Repent or else\"</blockquote>\r\n<blockquote>\"I will come unto thee quickly.\"</blockquote>\r\n<blockquote>\"And will fight against them\" etc.</blockquote>\r\n\r\n<h2>Counsel - vs. 17</h2>\r\n<blockquote>\"He that hath an ear\"</blockquote>\r\n<blockquote>\"To him that overcometh\"</blockquote>\r\n<blockquote>\"Will I give to eat of the Hidden Manna\"</blockquote>\r\n<p>Manna kept in the Ark - In the Most Holy Place - Beyond the veil. It was angel food. It kept them well - none were sick</p>\r\n<p>\"The Hidden Manna\" The Truth and Secrets of God. I Corinthians 2:9-10; Ephesians 1:18</p>\r\n<blockquote>\"And will give him a white stone\"</blockquote>\r\n<blockquote>\"And in the stone a new name written\"</blockquote>\r\n<p>Two things: Victor's stone King's name - High Priest King's name God's name</p>\r\n"},"type":"READ_HTML_FILE"}