{"id":784,"courseId":"prophecy-and-daniel","tasks":[],"title":"CHAPTER 5 THE HANDWRITING ON THE WALL","fileType":"html","value":{"path":"C:\\sites\\github\\courses\\prophecy-and-daniel/chapter-5-the-handwriting-on-the-wall.html","raw":"\r\n<h1>The Handwriting on the Wall</h1>\r\n<p>Daniel 5:1-31</p>\r\n<p>The Outline:</p>\r\n<p>I. Historical Review</p>\r\n<p>II. Hysterical Revelry</p>\r\n<p>III. Humiliating Revelation</p>\r\n<p>I. The Historical Review -</p>\r\n<h3>A. The critics say there was none by the name Darius - Darias is a title.</h3>\r\n<p>Darius I was King of Persia from 521 to 486? B.C.</p>\r\n<h3>B. They say also that Belshazzar was not the son of Nebuchadnezzar.</h3>\r\n<p>There is no word for &quot;grandfather&quot; in Hebrew or Chaldaic.. </p>\r\n<p>About 20 to 30 years have passed between chapters 4 and 5. Nebuchadnezzar was followed by evil Merodach. </p>\r\n<p>He was assassinated by his brother-in- law- Neriglissar. He reigned for 4 years and was killed in battle.</p>\r\n<p> Labashi-marduk (Laborosoarchod) who was Neriglissar's son was clubbed to death after reigning for only a few months.</p>\r\n<p> Nabonidus reigned less than a year and was taken in battle. His son was Belshazzar. Belshazzar is ruler- second ruler or in command. Jer. 27:6-7.</p>\r\n<h3>C. About the city - </h3>\r\n<p>Most magnificent and luxurious. Built in a square -15 miles each way. </p>\r\n<p>The wall surrounding the city - 87 feet thick 350 feet high. Six chariots could ride abreast.</p>\r\n<p> Gates of brass -watch towers. 100 gates of bronze or brass 25 on a side. </p>\r\n<p >The city now surrounded by the Medes and Persians.</p>\r\n<p>II. The Hysterical Revelry. vs. 1-7</p>\r\n<p>1. The Feast vs. 1-4 </p>\r\n<p>Drank before his lords - (irregular feast)</p>\r\n<p>Drank with the women -</p>\r\n<p>Drank with the vessels from the house of God - </p>\r\n<p>Using the vessels of the Lord to entertain their lusts.</p>\r\n<p>What a Mixture - II Cor. 6:17-18; Isa. 52:11; Eph. 5:11; Jas.4:4; I John 2:15-17</p>\r\n<p>Spring .of 1975 - Dallas County; strip tease in the name of religion.</p>\r\n<p>2. The Fingers - vs.5</p>\r\n<p>What are the fingers writing today -</p>\r\n<p>This was the writing of God -</p>\r\n<p>The pure Word of God</p>\r\n<p>3. The Fear - vs. 6-7</p>\r\n<p>Most people know when they are wrong.</p>\r\n<p>The knees smote together -</p>\r\n<p>The king cried aloud -&quot;shrieked&quot;</p>\r\n<p>III. The Humiliating Revelation vs.8-31</p>\r\n<p>1. The Wise Men Humiliated - vs.8-9</p>\r\n<h2>Could not give an answer. One thing in their favour they did not try to interpret what they did not understand. They still call the wise man of our day to read and interpret God's Word.</h2>\r\n<p>2. All Babylon Humiliated - </p>\r\n<p>Daniel the Hebrew alone -vs. 10-29 He had the answer</p>\r\n<p>3. The King Humiliated - (In Defeat) vs.30-31</p>\r\n<p>&quot;In that night was Belshazzar the king of the Chaldeans slain.&quot;</p>\r\n\r\n\r\n<!-- notes to edit START-->\r\nThings sacred--- Marriage, family, things sanctified for god, gods name, the sanctuary, Sabbaths or rests-- feasts, sanctity of marriage, difference between man anevwoman!, holiness in life', sanctity of life itself with sbortions\r\n\r\ndaniel 5:\r\nsacrilege-- nothing sacred\r\nking usually drank alone.\r\nwifes and concubines usually were exempt from the party in eastern cultures.\r\nNeb brings the temple vessels to the party to drink their wine.\r\nfinger of god appears NEXT to the candleabra probably from the temple as well.v.5 highlighting their offense.\r\n 4 They drank wine, and praised the gods of gold, and of silver, of --- while drinking from goods vessel's!!!!\r\nIn losing the fear of God we lose for for god and appreciation for that which is sacred.\r\n--- but fear came--- 6 Then the king's countenance was changed, and his thoughts troubled him, so that the joints of his loins were loosed, and his knees smote one against another.\r\nLev 19:8 Therefore every one that eateth it shall bear his iniquity, because he hath profaned the hallowed thing of the LORD: and that soul shall be cut off from among his people. \r\nLev 20:3 And I will set my face against that man, and will cut him off from among his people; because he hath given of his seed unto Molech, to defile my sanctuary, and to profane my holy name.\r\nLev 21:12 Neither shall he go out of the sanctuary, nor profane the sanctuary of his God; for the crown of the anointing oil of his God is upon him: I am the LORD. \r\nLev 22:32 Neither shall ye profane my holy name; but I will be hallowed among the children of Israel: I am the LORD which hallow you,--\r\nJer 23:11 For both prophet and priest are profane; yea, in my house have I found their wickedness, saith the LORD. -- the profanity doesn't end with the laity.\r\nEze 22:8 Thou hast despised mine holy things, and hast profaned my sabbaths. \r\nIs their a difference?\r\nEze 22:26 Her priests have violated my law, and have profaned mine holy things: they have put no difference between the holy and profane, neither have they shewed difference between the unclean and the clean, and have hid their eyes from my sabbaths, and I am profaned among them.\r\nHoly holy holy Lord God almighty. Early in the morning my song shall ride to thee!!!&hellip;.\r\n<!-- notes to edit END-->\r\n"},"type":"READ_HTML_FILE"}