{"id":9,"courseId":"a-students-commentary-on-romans","tasks":[],"title":"009 CHAPTER 9","fileType":"html","value":{"path":"C:\\sites\\github\\courses\\a-students-commentary-on-romans/009_chapter-9.html","raw":"<p align=\"center\" style=\"text-indent: 0.25in; margin-bottom: 0in; line-height: 100%; orphans: 2; widows: 2\">\r\n<font color=\"#800000\"><font face=\"Times New Roman, serif\"><font size=\"4\" style=\"font-size: 14pt\"><b>Chapter\r\nNine</b></font></font></font></p>\r\n<p align=\"center\" style=\"text-indent: 0.25in; margin-bottom: 0in; line-height: 100%; orphans: 2; widows: 2\">\r\n<br/>\r\n\r\n</p>\r\n<p align=\"center\" style=\"text-indent: 0.25in; margin-bottom: 0in; line-height: 100%; orphans: 2; widows: 2\">\r\n<font color=\"#800000\">&quot;<font face=\"Times New Roman, serif\"><font size=\"3\" style=\"font-size: 12pt\">Israel&apos;s\r\nStumbling Stone&quot;</font></font></font></p>\r\n<p align=\"center\" style=\"text-indent: 0.25in; margin-bottom: 0in; line-height: 100%; orphans: 2; widows: 2\">\r\n<br/>\r\n\r\n</p>\r\n<p style=\"text-indent: 0.25in; margin-bottom: 0in; line-height: 100%; orphans: 2; widows: 2\">\r\n<font face=\"Times New Roman, serif\"><font size=\"3\" style=\"font-size: 12pt\">Paul\r\nhas experienced great heaviness in sorrowing over Israel&apos;s\r\ncondition as a whole. Paul comes to the place that he would even be\r\nwilling to be accursed from Christ that his brethren might be found\r\nin Christ. This is a selfless declaration, but the proposition is not\r\neven possible. The sinner&apos;s light in their darkness is the\r\njustified, sanctified, holy life of Believers that walk consistently\r\nin Christ. </font></font>\r\n</p>\r\n<p style=\"text-indent: 0.25in; margin-bottom: 0in; line-height: 100%; orphans: 2; widows: 2\">\r\n<font face=\"Times New Roman, serif\"><font size=\"3\" style=\"font-size: 12pt\">Paul&apos;s\r\nproclamation is reminiscent of Moses in Exodus 32:32,33: </font></font><font face=\"Times New Roman, serif\"><font size=\"3\" style=\"font-size: 12pt\"><i>&hellip;Yet\r\nnow, if thou wilt forgive their sin--; and if not, blot me, I pray\r\nthee, out of thy book which thou hast written. And the LORD said unto\r\nMoses, Whosoever hath sinned against me, him will I blot out of my\r\nbook.</i></font></font><font face=\"Times New Roman, serif\"><font size=\"3\" style=\"font-size: 12pt\">\r\nOnly Christ was qualified to atone for man&apos;s sin.</font></font></p>\r\n<p align=\"justify\" style=\"text-indent: 0.25in; margin-bottom: 0in; line-height: 100%; orphans: 2; widows: 2\">\r\n<font face=\"Times New Roman, serif\"><font size=\"3\" style=\"font-size: 12pt\">The\r\nmajority of Israel has missed the point. Chirst is the fulfillment of\r\nthe law, but Israel stumbles over him as if a stone and hold to their\r\nlaws and religion. They think they are the children of God because\r\nthey are the children of Isaac and that they are the ones the law was\r\nrevealed to. Not everyone that is born a part of the nationality of\r\nIsrael are a part of that spiritual Israel. The children of the\r\nIsrael are only children of the flesh, but the children of the\r\npromise are the children of God. The Word of promise is this, </font></font><font face=\"Times New Roman, serif\"><font size=\"3\" style=\"font-size: 12pt\"><i>At\r\nthis time will I come, and Sara shall have a son. And not only this;\r\nbut when Rebecca also had conceived by one, even by our father Isaac;\r\n(For the children being not yet born, neither having done any good or\r\nevil, that the purpose of God according to election might stand, not\r\nof works, but of him that calleth;) It was said unto her, The elder\r\nshall serve the younger. As it is written, Jacob have I loved, but\r\nEsau have I hated</i></font></font><font face=\"Times New Roman, serif\"><font size=\"3\" style=\"font-size: 12pt\">.\r\nPaul clearly define the children of promise. We see that both Jacob\r\nand Esau were children of Isaac. Both were of the flesh, Israel. They\r\nare separated here by, </font></font><font face=\"Times New Roman, serif\"><font size=\"3\" style=\"font-size: 12pt\"><i>Jacob\r\nhave I loved, but Esau have I hated</i></font></font><font face=\"Times New Roman, serif\"><font size=\"3\" style=\"font-size: 12pt\">.\r\n</font></font>\r\n</p>\r\n<p align=\"justify\" style=\"text-indent: 0.25in; margin-bottom: 0in; line-height: 100%; orphans: 2; widows: 2\">\r\n<font face=\"Times New Roman, serif\"><font size=\"3\" style=\"font-size: 12pt\">Predestination\r\nis mentioned in verse eleven. While the boys were in the womb, before\r\nthey did any good or any evil, the prophecy was given that the elder\r\nwould serve the younger. This was to the purpose that the election of\r\nGod might stand by God&apos;s calling and not by works of men.\r\nPredestination is not an unrighteous act for God may justify whom He\r\nmay and condemn whom he desires. All the good works of men cannot\r\nmake them children of the promise, but that condition is dependent\r\nupon God showing mercy. It is important to make remark concerning how\r\npredestination works. Predestination and election is based upon God&apos;s\r\nforeknowledge. He knows the end from the beginning He knows who will\r\nreceive and who will reject before they are even born. </font></font><font face=\"Times New Roman, serif\"><font size=\"3\" style=\"font-size: 12pt\"><i>For\r\nwhom he did foreknow, he also did predestinate to be conformed to the\r\nimage of his Son, that he might be the firstborn among many\r\nbrethren</i></font></font><font face=\"Times New Roman, serif\"><font size=\"3\" style=\"font-size: 12pt\">&mdash;Romans\r\n8:29. William Branham was a man of God and a tent preacher in the mid\r\n1900&apos;s. He was preaching one evening in the tent and a woman came\r\nto him near the closing of the service. She said, &quot;Brother Branham,\r\nmy husband has threatened to kill me if I came to your meetings,\r\nagain. He is sitting right now in his car in the parking lot holding\r\na shotgun.&quot; Branham went out to the vehicle pulled open the\r\npassenger side door and sat down in the front seat. He plead with man\r\nconcerning his soul for an hour or more. Branham, observing no change\r\nin the man, asked one final question. &quot;Do you any intention that at\r\nany time in the future you may serve God?&quot; The man arrogantly\r\nsounded a resounding, &quot;No!&quot; Branham told him that he saw no\r\nreason for him to continue living then, and snapped his fingers and\r\nthe man died instantly in the driver&apos;s seat. Some are given 100\r\nyears and others only a few. It is man&apos;s responsibility to respond\r\nin the time of mercy for turning to God cannot happen just on a man&apos;s\r\nwhim, but he must be drawn by the Father. </font></font><font face=\"Times New Roman, serif\"><font size=\"3\" style=\"font-size: 12pt\"><i>No\r\nman can come to me, except the Father which hath sent me draw him:\r\nand I will raise him up at the last day</i></font></font><font face=\"Times New Roman, serif\"><font size=\"3\" style=\"font-size: 12pt\">&mdash;John\r\n6:44.</font></font></p>\r\n\r\n\r\nI. Israel&apos;s Stumbling Stone &mdash; Ch. 9\r\n\r\nRomans chapter nine talks about Paul&apos;s sorrow for the Jews. We find out that not all of Abraham&apos;s seed were the children of promise. This chapter talks about the calling of the Gentiles, and the rejection of the Jews, foretold.\r\n\r\nPaul has experienced great heaviness in sorrowing over Israel&apos;s condition as a whole. Paul comes to the place that he would even be willing to be accursed from Christ that his brethren might be found in Christ. This is a selfless declaration, but the proposition is not even possible. The sinner&apos;s light in their darkness is the justified, sanctified, holy life of Believers that walk consistently in Christ.\r\nPaul&apos;s proclamation is reminiscent of Moses in Exodus 32:32,33: &hellip;Yet now, if thou wilt forgive their sin--; and if not, blot me, I pray thee, out of thy book which thou hast written. And the LORD said unto Moses, Whosoever hath sinned against me, him will I blot out of my book. Only Christ was qualified to atone for man&apos;s sin.\r\nThe majority of Israel has missed the point. Chirst is the fulfillment of the law, but Israel stumbles over him as if a stone and hold to their laws and religion. They think they are the children of God because they are the children of Isaac and that they are the ones the law was revealed to. Not everyone that is born a part of the nationality of Israel are a part of that spiritual Israel. The children of the Israel are only children of the flesh, but the children of the promise are the children of God. The Word of promise is this, At this time will I come, and Sara shall have a son. And not only this; but when Rebecca also had conceived by one, even by our father Isaac; (For the children being not yet born, neither having done any good or evil, that the purpose of God according to election might stand, not of works, but of him that calleth;) It was said unto her, The elder shall serve the younger. As it is written, Jacob have I loved, but Esau have I hated. Paul clearly define the children of promise. We see that both Jacob and Esau were children of Isaac. Both were of the flesh, Israel. They are separated here by, Jacob have I loved, but Esau have I hated.\r\nPredestination is mentioned in verse eleven. While the boys were in the womb, before they did any good or any evil, the prophecy was given that the elder would serve the younger. This was to the purpose that the election of God might stand by God&apos;s calling and not by works of men. Predestination is not an unrighteous act for God may justify whom He may and condemn whom he desires. All the good works of men cannot make them children of the promise, but that condition is dependent upon God showing mercy. It is important to make remark concerning how predestination works. Predestination and election is based upon God&apos;s foreknowledge. He knows the end from the beginning He knows who will receive and who will reject before they are even born. For whom he did foreknow, he also did predestinate to be conformed to the image of his Son, that he might be the firstborn among many brethren&mdash;Romans 8:29. William Branham was a man of God and a tent preacher in the mid 1900&apos;s. He was preaching one evening in the tent and a woman came to him near the closing of the service. She said, &quot;Brother Branham, my husband has threatened to kill me if I came to your meetings, again. He is sitting right now in his car in the parking lot holding a shotgun.&quot; Branham went out to the vehicle pulled open the passenger side door and sat down in the front seat. He plead with man concerning his soul for an hour or more. Branham, observing no change in the man, asked one final question. &quot;Do you any intention that at any time in the future you may serve God?&quot; The man arrogantly sounded a resounding, &quot;No!&quot; Branham told him that he saw no reason for him to continue living then, and snapped his fingers and the man died instantly in the driver&apos;s seat. Some are given 100 years and others only a few. It is man&apos;s responsibility to respond in the time of mercy for turning to God cannot happen just on a man&apos;s whim, but he must be drawn by the Father. No man can come to me, except the Father which hath sent me draw him: and I will raise him up at the last day&mdash;John 6:44.\r\n\r\nROMANS CHAPTER 9\r\n\r\n\r\n\r\nTHEME: God's dealing with Israel.\r\n\r\nVerses 1 to 5 - Paul has great sorrow for unbelieving Israel - Unbelief despite an eight-fold pre-eminence.\r\n\r\n\r\nWhat great spiritual heritage does the Jew have? Define each part.\r\n\r\n1. ADOPTION - privilege of adoption - sonship\r\n2. GLORY - Shekinah presence of God\r\n3. COVENANTS - Promises of God made to Israel\r\n4. LAW - Law given at Sinai\r\n5. SERVICE - Authorized worship as ordained by God\r\n6. PROMISES - Promise of God are (yea and amen) to them that believe\r\n7. FATHERS - Relationship to the Father (Fathers of the flesh)\r\n8. MESSIAH OF ISRAEL - The written word Rom. 3:2 oracles of God committed unto them.\r\n\tRom. 9:5 Christ came in the flesh\r\n\r\nThe fact that the Jews as a nation rejected the Messiah (Christ) raises the question \"Did the Word of God fail?\" \"Did God fail to carry out His promises\"? How does Paul answer these questions? In these next verses Paul is confident that Israel's rejection of the gospel is not unanimous and not permanent.\r\n\r\nVerses 6 - 29:\tThe real Israel were the elect, not a natural seed. We see the plan of God as it unfolds.\r\n\r\nVerse 6:\t\tNot all Israel - which are of Israel. (There are true and false, counterfeit, Israelites)\r\n\r\nVerse 7:\t\tIn Isaac shall thy seed be called. - Seed of Promise -\r\n\r\nVerse 8:\t\tChildren of the flesh are not the children of God.\r\n\t\t(John 3:6 - ye must be born of the spirit)\r\n\r\nVerse 9:\t\tChildren of Promise - Seed of Abraham -\r\n\r\nVerses 10 - 11:\tCalled of God\r\n\t\tThe purpose of God calling a people is not based on works. Isaac was a child of Promise.\r\n\r\nVerses 12 - 13:\tElder shall serve the younger. Jacob was to inherit and obtain the divine blessing - and\r\n\t\this seed would triumph over the Edomites. Esau's descendants.\r\n\r\nNOTE:\t\"There shall come forth a star out of Jacob.\"\r\n\r\n\r\nHow is God's sovereignty expressed?\r\n\r\nGod is a sovereign God so therefore he is also a just God.\r\n\r\nVerse 15:\tGod will have mercy\r\n\r\nVerse 16:\tIt is God that showeth mercy\r\n\r\nVerse 17:\tPower of God and God's name declared\r\n\r\nPaul proves the sovereignty of God in the story of the potter and the clay. Verses 20-21.\r\n\r\n\r\n\r\n\r\n\r\nDIVINE POTTER OVER HUMAN CLAY\r\n\r\nWhom has God chosen?\r\n\r\nVerse 22:\tVessels of wrath fitted to destruction\r\n\r\nDESTRUCTION: Are eternal visitation of divine anger in \"flaming fire\" punishment upon bodies of the damned.\r\n\r\nVerse 23:\tVessels of mercy, which he had afore prepared unto glory. Make known the riches\r\n\t\tof his glory on the vessels of mercy. Where our heart is there our treasure is also.\r\n\r\n\t\tRom. 5:2 \"Rejoice in hope of glory.\"\r\n\r\nVerse 23:\t\"Afore\" - which he had afore prepared unto glory\r\n\r\nNote well the word afore. For the whole process of our salvation is viewed from that blessed future day when we shall enter, through divine mercy, into that glory which God afore appointed us.\r\n\r\nVerse 25:\tPaul here, takes from the prophet Hosea (2:23) a passage that distinctly refers to Israel.\r\n\t\tHere we see the remnant according to the election of grace.\r\n\r\nVerse 26:\tHere we see the Gentile people. God's infinte grace takes up those who were once called\r\n\t\t\"dogs\" and gives them a heavenly callign \"Called to be children of the living God.\"\r\n\r\nVerse 27:\tHere the apostle takes another prophet, Isaiah, and quotes again from him.\r\n\t\tIsa. 10:22 - concerning a remnant.\r\n\r\nVerse 28:\tThe ways of God are not our ways. He waits long - He forbears - He is silent: then\r\n\t\tsuddenly puts into execution an eternally formed purpose.\r\n\r\nWords of Ezekiel 20:35 & 36 are to be fulfilled - \"Cut short in righteousness.\"\r\n\r\nVerse 29:\tThis verse is a quote from Isaiah 1:9 shows that if God had not intervened by his grace,\r\n\t\tthey would have all become as Sodom and Gomorrah.\r\n\r\n\r\nCONCLUSION Verses 30 - 33\r\n\r\nThe Gentiles, not following after righteousness, attain to it by simple faith;\r\n\r\nIsrael, following after the Law - Method 7 stumbled at the (by faith) way.\r\n\r\nVerse 30:\tSome Gentiles who were making no effort to reach righteousness, reach it.\r\n\r\nVerse 31:\tIsrael followed after the law of righteousness but could not attain it.\r\n\t\t(Could not keep the law)\r\n\r\nVerse 32:\tIsrael did not seek it by faith.\r\n\r\nVerse 33:\tStumbled over the rock of offense.\r\n\t\t- Stumbled over Jesus -\r\n\r\nNOTE: The only way to have Christ in your life is to believe on Him. Otherwise he is a \"rock of offense\". He offended the leaders of Israel by exposing sin.\r\n\r\nWhat is the message of the Gospel that is open to all?\r\n\r\nVerse 33:\t\"And whosoever believeth on him shall not be ashamed.\"\r\n\r\n\t\tGod's merce is illustrated by His dealings with both Jew and Gentile. Humility and awe\r\n\t\tare the proper attitudes for both Jew and Gentile who experience the mercy and\r\n\t\tkindness of God.\r\n\r\n\t\tWhether a man is a Jew or a Gentile, his salvation depends upon more or less than what\r\n\t\the thinks and does with Jesus.\r\n\r\n\t\tSubmission to God's way of righteousness by personal acknowledgement of Jesus as\r\n\t\tthe risen Lord, brings a man into \"Right standing with God\".\r\n"},"type":"READ_HTML_FILE"}