{"id":"bible-trivia-db","type":"QUESTIONS_DATABASE","memo":"Abel, Abraham, Adam, Benjamin, Cain, Eliezer, Enoch, Ephraim, Esau, Eve, Hagar, Ham, Isaac, Ishmel, Jacob, Japheth, Joseph, Judah, Laban, Leah, Lot, Manasseh, Melchizedek, Methuselah, Nimrod, Noah, Pharaoh, Potiphar, Rachel, Rebekah, Reuben, Sarah, Seth, Shem, Terah\n```\n1.  __________________ The first Woman - Mother of All Living\n\n2.  __________________ First person to die\n3.  __________________The first murderer\n4.  _________________ Adam&apos;s Third Son\n5.  _________________ a mighty hunter; leader of rebellion at Babel\n6.  __________________ never died - walked with God\n7.  __________________ Oldest man that ever lived&#44; died before his father\n8. __________________name means rest; comfort; consolation\n9. __________________ and __________________ and __________________ 3 Sons of Noah\n10. _________________The first Hebrew\n11. __________________ Abraham&apos;sfather\n12. __________________ Abraham&apos;s nephew who lived in Sodom \n13. _________________ Beautiful wife of Abraham\n14. __________________ Sarah&apos;s handmaid\n15. __________________ Priest of God to whom Abraham Paid tithes\n16. __________________ Abraham and Sarah&apos;s child of Promise\n17. __________________ Abraham and Hagar&apos;s son\n18. _________________ Abraham&apos;s servant who went for Isaac&apos;s Bride\n19. _________________ Isaac&apos;sWife\n20. __________________ names means of the ground; red earth. - Despised His Birthright\n21. __________________ name means supplanter(to overthrow by tripping up; to replace by treachery)\n22. _________________ Laban&apos;s Eldest Daughter&#44; Jacob&apos;s first wife\n23. __________________  Jacob&apos;s favorite wife\n24. __________________ Jacob&apos;s oldest son\n25. __________________ Jacob&apos;s youngest son\n26. _________________  Jacob&apos;sson through whom the Redeemer would come\n27. _________________ Jacob&apos;sUncle&#44; Brother of Rebecca\n28. _________________ Saved Israel from Famine\n29. __________________ Ruler of Egypt \n30. __________________ Captain of the Guard in Egypt&#44; Bought Joseph\n31. __________________ and _____________________  Joseph's 2 Sons\n\n{\"id\":106, \"question\":\"\", \"scripture\":\"Esther\", \"choices\":[], \"tags\":\"esther\"},\n{\"id\":107, \"question\":\"\", \"scripture\":\"Esther\", \"choices\":[], \"tags\":\"esther\"},\n{\"id\":108, \"question\":\"\", \"scripture\":\"Esther\", \"choices\":[], \"tags\":\"esther\"},\n{\"id\":109, \"question\":\"\", \"scripture\":\"Esther\", \"choices\":[], \"tags\":\"esther\"},\n{\"id\":110, \"question\":\"\", \"scripture\":\"Esther\", \"choices\":[], \"tags\":\"esther\"},\n{\"id\":111, \"question\":\"\", \"scripture\":\"Esther\", \"choices\":[], \"tags\":\"esther\"}\n\n\n1. Who wrote the first four books of the New Testament?\n\tMatthew, Mark, Luke, and John.\n\n2. Who wrote the first five books of the Old Testament?\n\tMost conservative scholars hold that the Pentateuch was written by Moses.\n\n3. What two Old Testament books are named after women?\n\tEsther and Ruth.\n\n4. What are the Ten Commandments?\n\tHave no other gods before Me. Do no make idols. Do not misuse the name of the Lord your God. Remember the Sabbath day by keeping it holy. Honor your father and your mother. Do not murder. Do not commit adultery. Do not steal. Do not give false testimony. Do not covet. Exodus 20:2-17\n\n5. What is the Greatest Commandment?\n\t'Love the Lord your God with all your heart and with all your soul and with all your mind.' (Matthew 22:37,38)\n\n6. What is the second Greatest Commandment?\n\t'Love your neighbor as yourself.' (Matthew 22:39)\n\n7. What is the Golden Rule?\n\t'Do unto others as you would have them do unto you.' (Matthew 7:12)\n\n8. What is the Great Commission?\n\t'Therefore, go and make disciples of all nations, baptizing them in the name of the Father and of the Son and of the Holy Spirit, and teaching them to obey everything I have commanded you. And surely I will be with you always, to the very end of the age.' (Matthew 28:19,20)\n\t\n9. What was the test of a prophet, to know that he was truly from God?\n\tHe had to be 100% accurate in his prophecies. The penalty for a false prophet was death by stoning. (Deuteronomy 18:20-22)\n\n10. To whom did God give the 10 Commandments?\n\tMoses. (Exodus 20)\n\n11. Which two people did not die in the Bible?\n\tEnoch and Elijah. Genesis 5:24 says that Enoch, who was Noah’s great-grandfather, 'walked with God; then he was no more, because God took him away.' The other was the Old Testament prophet Elijah, who was taken up to heaven in a whirlwind with a chariot and horses of fire. (2 Kings 2:11)\n\t\n12. What is the root of all kinds of evil?\n\tThe love of money. (1 Timothy 6:10)\n\n13. What is the beginning of wisdom?\n\tThe fear of the Lord. (Psalm 111:10)\n\n14. Who delivered the Sermon on the Mount?\n\tThe Lord Jesus. (Matthew 5-7)\n\n15. How did sickness and death enter the world?\n\tRomans 5:12 says that sin entered the world though one man, and death through sin. The fall of man is recorded in Genesis 3, where God's perfect creation was spoiled by Adam's sin.\n\n16. Who was the Roman governor who sentenced Christ to death?\n\tPontius Pilate. (Matthew 27:26)\n\n17. Who are the major prophets?\n\tIsaiah, Jeremiah, Ezekiel, and Daniel.\n\n18. What group of people is the Old Testament about?\n\tThe Hebrews, who became the nation of Israel. They were descendants of Abraham though Isaac.\n\n19. What happened while the Lord Jesus was in the desert for 40 days? He was tempted by the devil.\n\t(Matthew 4:1) Hebrews 4:15 tells us that He was tempted in every way, just as we are - yet was without sin.\n\n20. How many people were on Noah’s ark?\n\tEight: Noah and his wife, his three sons Shem, Ham, and Japheth, and their wives. (Genesis 7:13, 1 Peter 2:5)\n\n21. Who was the first murderer?\n\tCain, who killed his brother Abel. (Genesis 4:8)\n\n22. Which person was afflicted with terrible trials but trusted God through it all?\n\tJob\n\n23. Who was Israel’s most well-known and well-loved king?\n\tDavid. (1 Chronicles 29:28)\n\n24. Who was 'the weeping prophet?' \n\tJeremiah.\n\n25. Who was thrown into the lion’s den?\n\tDaniel. (Daniel 6)\n\n26. Who were the two people in the famous fight with a stone and a sling?\n\tDavid and Goliath. (1 Samuel 17)\n\n27. What is the book of Acts about?\n\tThe early years of the church, as the gospel begins to spread throughout the world. \"The Acts of the Holy Ghost Through the Apostles\".\n\n28. What are epistles?\n\tLetters.\n\n29. On what occasion was the Holy Spirit given to the church?\n\tPentecost. (Acts 2:1-4)\n\n30. Whom did God command to sacrifice his only son?\n\tAbraham. (Genesis 22:2)\n\n31. What was the Old Testament feast that celebrated God’s saving the firstborn of Israel the night they left Egypt?\n\tPassover. (Exodus 12:27)\n\n32. Who was the Hebrew who became prime minister of Egypt?\n\tJoseph. (Genesis 41:41)\n\n33. Who was the Hebrew woman who became Queen of Persia?\n\tEsther. (Esther 2:17)\n\n34. Who was the pagan woman who became David’s great-grandmother?\n\tRuth. (Ruth 4:17)\n\n35. Which angel appeared to Mary?\n\tGabriel. (Luke 1:26)\n\n36. How did the Lord Jesus die?\n\tHe gave up His life while being crucified. (John 19:18)\n\n37. What happened to Him three days after He died?\n\tHe was raised from the dead. (John 20)\n\n38. What happened to the Lord Jesus 40 days after His resurrection?\n\tHe ascended bodily into heaven. (Acts 1:9-11)\n\n39. What should we do when we sin, in order to restore our fellowship with God?\n\t1 John 1:9 tells us, 'If we confess our sins, He is faithful and just to forgive us our sins, and to cleanse us from all unrighteousness.'\n\n40. How did the universe and world get here?\n\tGenesis 1:1 tells us, 'In the beginning, God created the heavens and the earth.' We are told further in Colossians 1:16 and 17 that the Lord Jesus Christ was the one who did the creating.\n\n41. Where did Satan and the demons come from?\n\tSatan was originally the best and the brightest angel, but he sinned in his pride, wanting to be God. Some of the angels followed him, and these 'fallen angels' were cast out of heaven. (Isaiah 14, Ezekiel 28)\n\n42. Who directed the writing of the Bible?\n\tThe Holy Ghost. (2 Timothy 3:16, 2 Peter 1:21) About 40 people wrote the Bible as inspirited by the Holy Ghost.\n\n43. Where was the Lord Jesus before He was conceived in Mary?\n\tIn heaven. (Philippians 2:6-11, 1 Corinthians 15:49)\n\n44. What is sin?\n\tSin is disobeying God. ( 1 John 3:4)\n\n45. What are parables?\n\tA short, simple story with a spiritual point. The Lord Jesus taught in parables. (Matthew 13:3)\n\n46. Which two animals talked with human speech?\n\tThe serpent in the Garden of Eden (Genesis 3:3) and Balaam’s donkey (Numbers 22:28).\n\n48. Which one of his sons succeeded David as king?\n\tSolomon. (2 Samuel 12:24)\n\n49. Who was the female judge of Israel?\n\tDeborah. (Judges 4:4)\n\n50. Who was the wisest man in the world?\n\tSolomon. (1 Kings 3:12)\n\n51. Who was the first man?\n\tAdam. (Genesis 2:20)\n\n51. Who was the most meekest man on earth? \n\tMoses. (Numbers 12:3)\n\n52. Who was the strongest man on earth? \n\tSamson. (Judges 13-16)\n\n53. Where were the two nations of God’s people taken into captivity? Israel to ... ? and Judah to ... ?\n\tIsrael was taken into Assyria (2 Kings 17:23), and Judah into Babylon (2 Chronicles 36:20).\n\n54. Which cupbearer to a foreign king rebuilt the wall of Jerusalem?\n\tNehemiah. (Nehemiah 2:5)\n\n55. Who were the two Old Testament prophets who worked miracles?\n\tElijah and Elisha. (1 Kings 17 – 2 Kings 6)\n\n56. Which Old Testament prophet spent three days in the belly of a great fish?\n\tJonah. (Jonah 1:17)\n\n57. What is the last book of the Old Testament?\n\tMalachi.\n\n58. For which Israelite commander did the sun stand still?\n\tJoshua. (Joshua 10)\n\n59. Who was the first king of Israel? \n\tSaul. (1 Samuel 13:1)\n\n60. Who built the temple in Israel? \n\tSolomon. (1 Kings 6)\n\n61. Which of the twelve tribes of Israel served as priests? \n\tLevites. (Deuteronomy 10:8)\n\n62. Which city fell after the Israelites marched around it daily for seven days?\n\tJericho. (Joshua 6:20)\n\n63. What did God give the Israelites to eat in the wilderness? \n\tManna and quail. (Exodus 16)\n\n64. Which two people walked on water? \n\tJesus and Peter. (Matthew 14:29)\n\n65. Who was the first martyr? \n\tStephen. (Acts 7)\n\n66. Who betrayed Jesus to the priests, and for how much? \n\tJudas betrayed Him for 30 pieces of silver, the price of a slave. (Matthew 26:14-15)\n\n67. What is the Lord’s Prayer?  \n\tOur Father which art in heaven, Hallowed be thy name. 10 Thy kingdom come. Thy will be done in earth, as it is in heaven.  11 Give us this day our daily bread.  12 And forgive us our debts, as we forgive our debtors.  13 And lead us not into temptation, but deliver us from evil: For thine is the kingdom, and the power, and the glory, for ever. Amen. (Matthew 6:9-13)\n\n68. Who was the first person to see Jesus after his Resurrection? \n\tMary Magdalene. (John 20:16)\n\n69. Which prophet and cousin of the Lord was beheaded? \n\tJohn the Baptist. (John 14:10)\n\n70. To what country did the young Jesus and His parents escape when Herod was threatening His life?\n\tEgypt. (Matthew 2:13-15)\n\n71. What was Christ’s first miracle? \n\tHe turned water into wine at the wedding at Cana. (John 2:11)\n\n72. Which one of the Lord’s personal friends did He raise from the dead?\n\tLazarus. (John 11)\n\n73. Who was the greatest missionary of the New Testament?\n\tPaul. (see book of Acts)\n\n74. Who was Paul’s first partner? \n\tBarnabas. (Acts 13:2)\n\n75. Whom did an angel release from prison? \n\tPeter. (Acts 12)\n\n76. Which event caused God to splinter human language into many tongues? \n\tThe building of the Tower of Babel. (Genesis 11)\n\n77. Which chapter of an Old Testament prophet’s book gives a detailed prophecy of the Messiah’s death by crucifixion? \n\tIsaiah 53.\n\n78. Who wrestled all night with the Lord and was left with a permanent limp? \n\tJacob. (Genesis 32:22-32)\n\n79. Who was hailed as a god when he was bitten by a snake but nothing bad happened?\n\tPaul. (Acts 28:5-6)\n\n80. Which two New Testament writers were brothers of the Lord Jesus?\n\tJames and Jude. (Matthew 13:55)\n\n81. Which two New Testament books were written by a doctor?\n\tLuke and Acts. (2 Timothy 4:11)\n\n82. Who had a coat of many colors?\n\tJoseph. (Genesis 37:3)\n\n83. In what sin did Aaron lead the Israelites while his brother Moses was up on the mountain talking to God?\n\tThey made an idol in the form of a golden calf. (Exodus 32)\n\n84. How many books are there in the entire Bible?\n\t66: 39 in the Old Testament, and 27 in the New Testament.\n\n85. What’s the difference between John the Baptist and the John who wrote several New Testament books?\n\tJohn the Baptist was a prophet who proclaimed the kingdom of God was near in preparation for his cousin Jesus’ ministry. The John who wrote the gospel of John, the epistles—1, 2 and 3 John—and Revelation, was one of the twelve apostles and one of those closest to the Lord, along with Peter and James. He called himself 'the disciple whom Jesus loved.'\n\n86. Who saw the Lord appear to him in a burning bush? \n\tMoses. (Exodus 3)\n\n87. How many sons did Jacob have? Twelve. \n\tThey were the ancestors of the twelve tribes of Israel. (Genesis 35:22)\n\n88. Who gave up his birthright for a bowl of stew? \n\tEsau. (Genesis 25:33)\n\n89. Which Psalm starts out, 'The Lord is my shepherd, I shall not want?' \n\tPsalm 23.\n\n90. Who disowned the Lord Jesus three times before a cock crowed?\n\tPeter. (Matthew 26:69-75)\n\n91. What did the Lord do just after the Last Supper to demonstrate His love and humility?\n\tHe washed the disciples’ feet. (John 13:5)\n\n92. Where is the New Testament 'Hall of Faith?'\n\tHebrews 11.\n\n93. Who appeared with the Lord Jesus in glory on the Mount of Transfiguration?\n\tElijah and Moses. (Mark 9:4)\n\n94. Who is the second Adam?\n\tThe Lord Jesus Christ. (1 Corinthians 15:45-49)\n\n95. Which Old Testament prophet married a prostitute because God told him to?\n\tHosea. (Hosea 1:2)\n\n96. What are the two sacred ordinances that the Lord commanded us to observe?\n\tBaptism (Matthew 28:19,20) and Communion, or the Lord’s Table (1 Corinthians 11:23-26).\n\n97. What are supernatural enablings that allow a believer to serve the Body of Christ with ease and effectiveness?\n\tSpiritual gifts. (Romans 12:6-8, 1 Corinthians 12, Ephesians 4:8-13, 1 Peter 4:10-11)\n\n98. Whose tomb was Christ buried in?\n\tJoseph of Arimathea. (Matthew 27:57-60)\n\n99. Who wrote the book of Hebrews?\n\tNobody knows for sure, but quite possibly Paul.\n\n100. What is the book of Revelation about?\n\tThe end of the world.\n\n101. Who is the bride of Christ?\n\tThe bride is a remnant of The Church. A part of the Body who are ready when he calls to the wedding. (Matthew 25)\n\t\n\n----\nQuestion 1: Order of Appearance of these 8 kings from first to last:\nAnswer 1: Jeroboam Nadab Baasha Elah Zimri Omri Ahab Ahaziah\n----\n\n----\nQuestion 2: List names of people mentioned in 1 Kings:\nAnswer 2: (Most names wins points)\n----\n\n----\nQuestion 3: Where am I reading?\nAnswer 3: 1 Kings 1:15-21 1Ki 1:15 And Bathsheba went in unto the king into the chamber: and the king was very old; and Abishag the Shunammite ministered unto the king.\n 16 And Bathsheba bowed, and did obeisance unto the king. And the king said, What wouldest thou?\n 17 And she said unto him, My lord, thou swarest by the LORD thy God unto thine handmaid, saying, Assuredly Solomon thy son shall reign after me, and he shall sit upon my throne.\n 18 And now, behold, Adonijah reigneth; and now, my lord the king, thou knowest it not:\n 19 And he hath slain oxen and fat cattle and sheep in abundance, and hath called all the sons of the king, and Abiathar the priest, and Joab the captain of the host: but Solomon thy servant hath he not called.\n 20 And thou, my lord, O king, the eyes of all Israel are upon thee, that thou shouldest tell them who shall sit on the throne of my lord the king after him.\n 21 Otherwise it shall come to pass, when my lord the king shall sleep with his fathers, that I and my son Solomon shall be counted offenders.\n----\n\n----\nQuestion 4: PICTIONARY --> {Draw Nabath's Vineyard}\nAnswer 4:\n----\n\n----\nQuestion 5: PICTIONARY --> {Draw the showdown on Mount Carmel with Elijah}\nAnswer 5:\n----\n\n----\nQuestion 6: What king name is both a king of Judah and Israel? Rehoboam, Abijam, Asah, Jehoshaphat, Jehoram, Joash, Nadab, Ahab\nAnswer 6: Jehoram of Judah (son of Jehoshaphat) and Jehoram of Israel (Ahab's son and Ahaziah's brother) both reigned around the same time!\n----\n\n----\nQuestion 7: Where am I reading? \nAnswer 7: 1 Kings 12:1-5 1Ki 12:1 ¶ And Rehoboam went to Shechem: for all Israel were come to Shechem to make him king.\n 2 And it came to pass, when Jeroboam the son of Nebat, who was yet in Egypt, heard of it, (for he was fled from the presence of king Solomon, and Jeroboam dwelt in Egypt;)\n 3 That they sent and called him. And Jeroboam and all the congregation of Israel came, and spake unto Rehoboam, saying,\n 4 Thy father made our yoke grievous: now therefore make thou the grievous service of thy father, and his heavy yoke which he put upon us, lighter, and we will serve thee.\n 5 And he said unto them, Depart yet for three days, then come again to me. And the people departed.\n----\n\n----\nQuestion 8: List PLACES mentioned in 1 kings.\nAnswer 8:\n----\n\n----\nQuestion 9: List non-Hebrew persons named in 1 kings.\nAnswer 9: \n----\n\n----\nQuestion 10: Order these events of 1 Kings\nAnswer 10: Wisdom of King Solomon (1 Kings 3), Building the Temple (1 Kings 5), Rehoboam & Jeroboam Story (1 Kings 7), Queen of Sheba (1 Kings 10:1), \n The Prophet Who Raised a Boy to Life (1 Kings 15), Elijah on Mount Carmel (1 Kings 18), Ahab and Naboth ( 1 Kings 21)\n----\n\n----\nQuestion 11: Solomon loved many strange woman. What peoples were they from as listed in 1 Kings 11 together with the daughter of Pharoah? (5 peoples in total)\nAnswer 11: (Read 1 Kings 11:1-3) together with the daughter of Pharaoh, Moabites, Ammonites, Edomites, Zidonians, and Hittites.\n----\n\n----\nQuestion 12: What prophets are named in 1 Kings?\nAnswer 12: Nathan, Obadiah, Ahijah the Shilonite, An old prophet in Bethel, a man of God from Judah, Jehu the son of Hanani, Elijah\n----\n## Round 2 [INDIVIDUAL ALL ANSWER ROUND - 10 POINTS] (NO LOSING POINTS)\n\nBIBLE MEMORIZATION\n\n----\nQuestion 1: Who was Adonijah's Mother?\n\nANSWER: Haggith\n\n> 1Ki 1:5 ¶ Then Adonijah the son of Haggith exalted himself, saying, I will be king: and he prepared him chariots and horsemen, and fifty men to run before him.\n\n----\n\n----\nQuestion 2: Why was Joab killed?\n\nANSWER: He followed Adonijah in his rebellion.\n\n> 1 Kings 1:6 And his father had not displeased him at any time in saying, Why hast thou done so? and he also was a very goodly man; and his mother bare him after Absalom. 7 And he conferred with Joab the son of Zeruiah, and with Abiathar the priest: and they following Adonijah helped him.\n \n----\n\n----\nQuestion 3: hOW MANY YEARS after the exodus does 1 Kings Chapter 6 date the beginning of the  temple construction?\n\nANSWER: 480  after the Exodus and in the 4th year of Solomon's year in the month of Zif.\n\n> 1Ki 6:1 ¶ And it came to pass in the four hundred and eightieth year after the children of Israel were come out of the land of Egypt, in the fourth year of Solomon's reign over Israel, in the month Zif, which is the second month, that he began to build the house of the LORD.  2 And the house which king Solomon built for the LORD, the length thereof was threescore cubits, and the breadth thereof twenty cubits, and the height thereof thirty cubits.\nAnswer 3: \n----\n\n----\nQuestion 4: Who was most likely and the traditional author of 1 Kings?\nAnswer 4: Jeremiah\n----\n\n----\nQuestion 5: How many chapters in the book of 1 Kings?\nAnswer 5: 22\n----\n\n----\nQuestion 6: \nAnswer 6: \n----\n\n----\nQuestion 7: \nAnswer 7: \n----\n\n----\nQuestion 8: \nAnswer 8: \n----\n\n----\nQuestion 9: \nAnswer 9: \n----\n\n----\nQuestion 10: \nAnswer 10: \n----\n\n## Round 3 [INDIVIUAL 1 ANSWER ROUND - 15 POINTS + & -]\n\n> A. God establishes Solomon’s reign over Israel (1 Kgs 1–5)\n\n1. Who tried to usurp Solomons throne? **ANSWER**: Adonijah 1Ki 1:1\n2. How did Joab die? **ANSWER**: Beniah killed Joab at Solomon's command 1 Kings 2:34\n3.\n4.\n5.  What other king did Solomon ask to help with building the temple? ANSWER: HIRAM 1Ki 5:6 And what did Solomon ask him specifically to do? Hew me cedar trees out of lebanon and to build with Solomon's builders.\n\n> B. God establishes His temple in Jerusalem (1 Kgs 6–9)\n\n6. What were the dimensions the temple that Solomon built? ANSWER: 1 Kings 6:2 And the house which king Solomon built for the LORD, the length thereof was threescore cubits, and the breadth thereof twenty cubits, and the height thereof thirty cubits.\n7. Name 3 Houses that Solomon built? ANSWER: 3. (1 KIngs 7:1)  Solomon's House, (7:51) God's House, (7:8) Pharoah's Daughter's House, \n8.\n9. What did Hiram call the 20 cites from Solomon ? ANSWER: Cabul 1 Kings 9:13\n\n> C. Solomon turns from God; Israel divides ([1 Kgs 10:1–12:24\n\n10. How much was one of solomon's chariots worth? 600 shekels of silver and a horse was 150 shekels. 1 Kings 10:29\n11.\n\n> D. Jeroboam leads the Northern Kingdom away from God ([1 Kgs 12:25–14:20\n12.\n13. \n14. Rehoboam did evil in the eyes of the LORD, and so this Egyptian king attacked Jerusalem. Who was this king? Answer: Shishak 1 Kings 14:25\n\n> Northern kings struggle for control ([1 Kgs 14:21–16:34\n\n15.  Idol-hating King Asa removed all idols from Judah. He even burned a idol that his grandmother and fathers had made. What idolatrous places did he leave alone? ANSWER 15:14 the high places\n\n> E. God judges King Ahab with Elijah the prophet 1 Kings 16-22\n\n16.\n17.\n18.\n19.\n20.\n21. Naboths vineyard was located in what city? Jezreel\n22. \n\nLIFE\nQuiz Your Family's Knowledge With These 300 Bible Trivia Questions (With Answers!) \nMARCH 29, 2021 – 11:50 AM  – 0 COMMENTS\n129\nMaryn Liles\nBy MARYN LILES \n\n(iStock)\nHere are 300 Bible trivia questions to test your Bible trivia knowledge—and challenge your own knowledge of the faith, while you’re at it! These tricky trivia questions about the Bible are divided into three categories—easy (for kids and youth), medium (for teens), and hard (for adults)—so you can quiz someone with increasingly more challenging Bible trivia questions as they learn even more wisdom from the Bible.\n\nThese Bible trivia questions (with answers!) will put your knowledge to the test. And don’t worry: the answers to these Bible trivia questions are provided just in case you get stumped.\n\n\nEasy Bible Trivia (With Answers!)\niStock\n(iStock)\n1.  Question: True or False: The Bible is the most popular book ever written. (by copies sold)\n\nAnswer: True.\n\n2. Question: What is the first book in the Bible?\n\nAnswer: Genesis\n\n3. Question: How many days did God take to create the world?\n\nAnswer: 6\n\n4. Question: Who was the first man?\n\nAnswer: Adam\n\n5. Question: Who was the first woman?\n\nAnswer: Eve\n\n6. Question: Where did Adam and Eve live at the beginning of the world?\n\nAnswer: Garden of Eden\n\n7. Question: Who were their three sons listed in the Bible?\n\nAnswer: Cain, Abel, Seth\n\n8. Question: Who did God tell to build an ark?\n\nAnswer: Noah\n\n9. Question: How many days and nights did it rain when Noah was on the ark?\n\nAnswer: 40\n\n10. Question: What was God’s sign to Noah that he would never destroy the earth again?\n\nAnswer: A rainbow\n\n11. Question: How many brothers did Joseph have?\n\nAnswer: 12\n\nRelated: 40 Scriptures on Peace\n\n12. Question: What did Jacob give Joseph that sparked jealousy from his siblings?\n\nAnswer: A coat of many colors\n\n13. Question: What did Joseph tell his brothers about his dreams that upset them?\n\nAnswer: The dreams said he would become greater and rule over them.\n\n14. Question: How did Moses’ mother save him from the Egyptian soldiers?\n\nAnswer: Put him in a basket in the river.\n\n15. Question: Through what did God speak to Moses in the desert?\n\nAnswer: A burning bush.\n\nThe 9 Coziest Nontoxic Candles for Your Pandemic Winter, Including One That Smells Like Cereal\n16. Question: What did Moses say God commanded the Pharaoh to do?\n\nAnswer: Let his people go.\n\n17. Question: How many plagues did God send on Egypt?\n\nAnswer: 10\n\n18. Question: What was the final plague that convinced Pharaoh to let the slaves go?\n\nAnswer:  The firstborn son of all Egyptian families died.\n\n19. Question: When Pharaoh changed his mind and sent his army after the slaves, where did they meet at?\n\nAnswer: By the Red Sea\n\n20. Question: What did God through Moses to save the slaves?\n\nAnswer: Parted the Red Sea.\n\n21. Question: When the Egyptians tried to follow the Israelites through the Red Sea, what happened?\n\nAnswer: The water crashed on them and killed them all.\n\nRelated: Healing Scriptures\n\n22. Question: Where did God give Moses the Ten Commandments?\n\nAnswer: Mt. Sinai\n\n23. Question: What golden image did the Israelites make at Mt. Sinai?\n\nAnswer: A golden calf\n\n24. Question: Who was the first king of Israel?\n\nAnswer: Saul\n\n25. Question: When Daniel prayed to God after it was not allowed, where was he thrown into?\n\nAnswer: The lion’s den\n\n26. Question: Who was Jesus’ human mother?\n\nAnswer: Mary\n\n27. Question: Who was Jesus’ adoptive father on Earth?\n\nAnswer: Joseph\n\n28. Question: Who was Jesus’ birth father?\n\nAnswer: God\n\n29. Question: Name the city where Jesus was born.\n\nAnswer: Bethlehem\n\n30. Question: True or False: Because Jesus was God, he didn’t obey his parents’ rules.\n\nAnswer: False. Jesus obeyed his parents.\n\nRelated: 100 Best Bible Quotes\n\n31. Question: Who baptized Jesus?\n\nAnswer: John the Baptist\n\n32. Question: Who spoke from the sky when Jesus was baptized?\n\nAnswer: God\n\n33. Question: What did God say?\n\nAnswer: That he was pleased with his son.\n\n34. Question: Before Jesus started preaching, what was his job?\n\nAnswer: Carpenter\n\n35. Question: Name Jesus’ hometown\n\nAnswer: Nazareth\n\n36. Question:  True or False: Jesus turned water into Pepsi.\n\nAnswer: False, Jesus turned water into wine.\n\n37. Question: Name the place where Jesus walked on water?\n\nAnswer: Sea of Galilee\n\n38. Question: True or False: Jesus stayed away from people with bad reputations?\n\nAnswer: False. He often ate with “sinners.”\n\n39. Question: True or False: Everywhere he went, people loved Jesus and believed his message?\n\nAnswer: False. Jesus was rejected many times.\n\n40. Question: How many disciples did Jesus choose?\n\nAnswer: 12\n\n41. Question: Besides preaching, name an activity Jesus did while traveling in Galilee\n\nAnswer: Healing the sick and casting out demons.\n\n42. Question: What is the shortest verse in the Bible?\n\nAnswer: John 11:35 Jesus wept.\n\n43. Question: Why did Jesus weep in that verse?\n\nAnswer: Because his friend Lazarus died.\n\n44. Question: How much bread and fish did Jesus use to feed more than 5,000 people?\n\nAnswer: Five loaves of bread—and two fish\n\n45. Question: True or False: Jesus’ said washing hands is never important.\n\nAnswer:  False. He said dirty hands don’t make a person spiritually unclean. You can still get germs!\n\n46. Question: True or False: Jesus asked the children to stay back while he was teaching important things to grown-ups.\n\nAnswer:  False–Jesus welcomed children.\n\nRelated: Religious Christmas Songs\n\n47. Question: What did Jesus do at the Last Supper to his disciples?\n\nAnswer: Washed their feet.\n\n48. Question: What did the woman pour on Jesus’ feet at the home of Simon the Leper?\n\nAnswer: Jar of expensive perfume\n\n49. Question: Name the disciple who betrayed Jesus.\n\nAnswer: Judas Iscariot.\n\n50. Question: True or False: Jesus didn’t know that he was going to be arrested and killed in Jerusalem\n\nAnswer: False. He knew and told his disciples before it happened.\n\n51. Question: Which disciple denied Jesus three times?\n\nAnswer: Peter\n\n52. Question: What happened after Jesus was buried in the tomb?\n\nAnswer: He rose again\n\n53. Question: What was rolled away from the entrance of the tomb?\n\nAnswer: A large stone\n\n54. Question: What day of the week did Jesus rise back to life?\n\nAnswer: Sunday\n\n55. Question: How did Jesus leave Earth and go to Heaven?\n\nAnswer: He rose into the clouds.\n\n56. Question:  How many books have the name John in them?\n\nAnswer: Four.\n\n57. Question: Name the person who received the 10 Commandments from God?\n\nAnswer: Moses\n\n58. Question: What is the 1st commandment?\n\nAnswer:  You shall have no other gods before me.\n\n59. Question: What is the 2nd commandment?\n\nAnswer: You shall not make idols.\n\n60. Question: What is the 3rd commandment?\n\nAnswer: You shall not misuse the name of the Lord.\n\n61. Question: What is the 4th commandment?\n\nAnswer: Observe the Sabbath day by keeping it holy.\n\n62. Question: What is the 5th commandment?\n\nAnswer: Honor your father and mother.\n\n63. Question: What is the 6th commandment?\n\nAnswer: You shall not murder.\n\n64. Question: What is the 7th commandment?\n\nAnswer: You shall not commit adultery.\n\n65. Question:  What is the 8th commandment?\n\nAnswer: You shall not steal.\n\n66. Question: What is the 9th commandment?\n\nAnswer: You shall not give false testimony.\n\n67. Question: What is the 10th commandment?\n\nAnswer: You shall not covet.\n\n68. Question: What does Jesus say is the first and greatest commandment?\n\nAnswer: Love God with all your heart, minds, soul, and strength.\n\n69. Question:  What does Jesus say is the second greatest commandment?\n\nAnswer: Love your neighbor as yourself.\n\n70. Question: What is the last book in the Bible?\n\nAnswer: Revelation\n\n71. Question: What four books tell about Jesus’ life on Earth?\n\nAnswer: Matthew, Mark, Luke, John\n\n72. Question: Which book did Jesus directly write?\n\nAnswer: None\n\n73. Question: Which book did David write most of?\n\nAnswer: Psalms\n\n74. Question: True or False: The Bible was first written in the English language?\n\nAnswer: False\n\n75. Question:  What were men trying to do at the Tower of Babel?\n\nAnswer: Build a tower to reach Heaven.\n\n76. Question: How did the 12 brothers get rid of Joseph?\n\nAnswer: Sold him to slave traders.\n\n77. Question: What did Joseph’s brothers tell their father had happened to him?\n\nAnswer: They said Joseph was killed by a wild animal\n\n78. Question: Where did the slave traders take Joseph?\n\nAnswer: Egypt\n\n79. Question: Who bought Joseph?\n\nAnswer: Potiphar, captain of the Pharaoh’s guards\n\n80. Question: Who got Joseph thrown into prison by lying about him?\n\nAnswer:  Potiphar’s wife\n\n81. Question: Who else was in prison with Joseph?\n\nAnswer: The Pharaoh’s cupbearer and chief baker.\n\n82. Question: What did Joseph do for them?\n\nAnswer: Interrupted their dreams.\n\n83. Question: Why was Joseph summoned out of prison by the Pharaoh?\n\nAnswer: To interrupt his dream.\n\n84. Question:  What position of power was Joseph given by the Pharaoh?\n\nAnswer: Second in command of Egypt.\n\n85. Question: What catastrophe did Joseph predict by interpreting the Pharaoh’s dream?\n\nAnswer: A severe, seven-year famine.\n\n86. Question: Who came to Egypt that Joseph recognized because of the famine?\n\nAnswer: His brothers\n\n87. Question: What did Joseph tell the brothers to do next time they came back to Egypt?\n\nAnswer: To bring Benjamin back with them.\n\n88. Question: What was the giant’s name that David killed?\n\nAnswer: Goliath\n\n89. Question: How did David kill Goliath?\n\nAnswer: A slingshot and a stone.\n\n90. Question: How many sling-throws did it take David to hit Goliath?\n\nAnswer: One.\n\n91. Question: When David wanted to fight Goliath, what did Saul try to give him?\n\nAnswer: His armour\n\n92. Question: Who eventually came from the lineage of David?\n\nAnswer: Jesus\n\n93. Question: True or False: Jesus was an only child.\n\nAnswer: False. Jesus had brothers and a sister.\n\n94. Question: How many of Jesus’ brothers are named in the Bible?\n\nAnswer: Four\n\n95. Question: Is Jesus’s sister ever named in the Bible?\n\nAnswer: No.\n\n96. Question: Who was Jesus’ most famous cousin?\n\nAnswer: John the Baptist.\n\n97. Question: Name one of Jesus’s brothers.\n\nAnswer: James, Joseph, Simon or Judas\n\n98. Question: What happened when Jesus went into the wilderness?\n\nAnswer: He was tempted by Satan.\n\n99. Question:  How many people did Jesus feed with fish and bread?\n\nAnswer: 5,000\n\n100. Question: How many lepers did Jesus heal?\n\nAnswer: 10\n\nMedium Bible Trivia (With Answers!)\niStock\n(iStock)\n1. Question: True or False: David wrote the entire book of Psalms.\n\nAnswer: False: The Psalms are a collection by many writers, but David contributed the most.\n\n2. Question: What is the shortest book in the Bible?\n\nAnswer: 3 John.\n\n3. Question: How many books are in the Bible?\n\nAnswer: 66.\n\n4. Question: How many books in the Old Testament?\n\nAnswer: 39.\n\n5. Question: How many books in the New Testament?\n\nAnswer: 27.\n\n6. Question:  Which New Testament book has Jesus’ Sermon on the Mount?\n\nAnswer: Matthew\n\n7. Question: Who was David’s son that became king?\n\nAnswer: Solomon.\n\n8. Question:  In what language was most of the Old Testament given?\n\nAnswer: Hebrew.\n\n9. Question:  In what language was most of the New Testament given?\n\nAnswer: Greek.\n\n10. Question: Which human author wrote the most books?\n\nAnswer: Paul wrote 13 books.\n\n11. Question: Which human author wrote the most words in the Bible?\n\nAnswer: Moses wrote 125,139 words.\n\n12. Question: What was most likely the first Gospel written?\n\nAnswer: Mark.\n\n13. Question: What was most likely the last Gospel written?\n\n Answer: John.\n\n14. Question: What was most likely the first of Paul’s letters written?\n\nAnswer: 1 Thessalonians.\n\n15. Question:  What was most likely the last New Testament book written?\n\nAnswer: Revelation.\n\n16. Question: Who were Noah’s three sons?\n\nAnswer:  Shem, Ham, Japheth.\n\n17. Question: How many people were saved on the ark?\n\nAnswer: 8\n\n18. Question:  How did God make people spread out across the earth?\n\nAnswer: Confused their languages.\n\n19. Question: Who did God call out of Ur to move to Canaan?\n\nAnswer: Abram.\n\n20. Question: Who was Abram’s wife?\n\nAnswer: Sarai.\n\n21. Question: Even though Abram and Sarah were too old, what did God promise them?\n\nAnswer: A son.\n\n22. Question: When God showed Abram the stars in the sky, what did he promise?\n\nAnswer: That Abram would have more descendants than the number of stars.\n\n 23. Question: Who was Abram’s handmaid?\n\nAnswer: Hagar.\n\n24. Question: What was Sarai’s idea for Abram to have a child?\n\nAnswer: For Abram to have a child with Hagar.\n\n25. Question: Who was the first son Abram had?\n\nAnswer: Ishmael.\n\n26. Question: What was Abram’s name changed to?\n\nAnswer: Abraham.\n\n27. Question: What was Sarai’s name changed to?\n\nAnswer: Sarah.\n\n28. Question: What was the second son Abraham had?\n\nAnswer: Issac.\n\n29. Question:  Who did Abraham have his second son with?\n\nAnswer: Sarah.\n\n30. Question: Where did Hagar and her son go after they left Abraham’s?\n\nAnswer: Into the desert.\n\n31. Question:  Who did Abraham send to find Isaac a wife?\n\nAnswer: His oldest servant.\n\n32. Question: Who did the servant choose?\n\nAnswer: Rebekah.\n\n33. Question: What were Isaac’s sons’ names?\n\nAnswer: Jacob and Esau\n\n34. Question: Who was born first?\n\nAnswer: Esau came first, with Jacob grabbing his heel.\n\n35. Question: How did Esau provide food for the family?\n\nAnswer: He hunted\n\n36. Question: Who did Isaac favor of his two sons?\n\nAnswer: Esau\n\n37. Question: What did Jacob do most of the time?\n\nAnswer: Stay at home with his mother.\n\n38. Question: What did Esau receive in exchange for his birthright?\n\nAnswer: Stew\n\n39. Question: As Isaac was dying and blind, who suggested that Jacob should steal Esau’s birthright?\n\nAnswer: Rebekah.\n\n40. Question:  How did Esau respond when his birthright was taken?\n\nAnswer: Threatened to kill Jacob.\n\n41. Question: When Jacob met Laban, which daughter did he want to marry?\n\nAnswer: Rachel.\n\n42. Question: Who did Laban trick Jacob into marrying?\n\nAnswer: Leah.\n\n43. Question: What did Laban make Jacob do to finally marry Rachel?\n\nAnswer: Work another 7 years.\n\n44. Question:  Who was the first son Jacob had with Rachel?\n\nAnswer: Joseph.\n\n45. Question: What did God change Jacob’s name to before his meeting with Esau?\n\nAnswer: Israel.\n\n46. Question: What did Moses do after he killed an Egyptian?\n\nAnswer: Fled into the desert.\n\n47. Question:  When Moses confronted the Pharaoh, what did his staff turn into when he threw it on the ground?\n\nAnswer: A snake\n\n48. Question: How did Moses’ mother save him from the Egyptian soldiers?\n\nAnswer: Put him in a basket in the river.\n\n49. Question: What did God send to feed the Israelites in the desert?\n\nAnswer: Quail and manna.\n\n50. Question: What did the spies sent into Canaan see that made them scared?\n\nAnswer: Giants in the land.\n\n51. Question:  Who were the only two Israelites allowed to go into the Promised Land after many years?\n\nAnswer:  Joshua and Caleb\n\n52. Question:  What city did God make the walls fall so Joshua and the Israelites could conquer it?\n\nAnswer: Jericho.\n\n53. Question: After they took over the Promised Land and Joshua died, who ruled Israel?\n\nAnswer: Judges.\n\n54. Question: Who was the woman judge who led Israel to victory?\n\nAnswer: Deborah.\n\n55. Question:  Who was the judge who defeated the Midianites with only 300 men using torches and horns?\n\nAnswer: Gideon.\n\n56. Question: Who was the judge who took a Nazarite vow from birth and fought against the Philistines?\n\nAnswer: Samson\n\n57. Question: With what did Samson kill 1,000 Philistines?\n\nAnswer: A donkey’s jawbone.\n\n58. Question: How did Samson die?\n\nAnswer: Pushing over the temple pillars, killing himself and many Philistines.\n\n59. Question: Who anointed Saul as King?\n\nAnswer: Samuel.\n\n60. Question: Who was the enemy who took the Ark of the Covenant?\n\nAnswer: Philistines.\n\n61. Question: What happened to the idol which was beside the Ark in the enemy’s temple?\n\nAnswer: It fell over and broke.\n\n62. Question: When the people demanded Saul make a sacrifice to God, what did he do?\n\nAnswer: Made the sacrifice.\n\n63. Question:  What was Saul’s punishment for disobeying?\n\n Answer: God took away his kingdom.\n\n64. Question: Who was the king of Israel anointed by Samuel after Saul?\n\nAnswer: David.\n\n65. Question: What did David do as a job as he worked for his father?\n\nAnswer: He was a shepherd.\n\n66. Question:  When the Philistines came to attack the Israelites, who mocked God and challenged them?\n\nAnswer: Goliath the Giant.\n\n67. Question: Who was Saul’s son that David befriended?\n\nAnswer: Jonathan.\n\n68. Question: What did Saul throw to try to kill David?\n\nAnswer: A spear.\n\n69. Question: What did Jonathan do to save David’s life from Saul?\n\n Answer: Warned him that Saul would try to kill him.\n\n70. Question:  What foreign country did David run away to?\n\n Answer: The Land of the Philistines.\n\n71. Question: Did Saul give up on chasing David when David went into the wilderness?\n\nAnswer: No.\n\n72. Question: How many times did David spare Saul’s life?\n\n Answer: Twice.\n\n73. Question: Where did David spare Saul’s life the first time?\n\nAnswer: A cave.\n\n74. Question:  Where did David spare Saul’s life the second time?\n\nAnswer: In a campsite, where Saul was sleeping.\n\n75. Question: What last judge of Israel died after Saul made a temporary peace with David?\n\nAnswer: Samuel.\n\n76. Question: What prophet did Saul ask to speak to?\n\nAnswer: Samuel.\n\n77. Question: How did Saul die?\n\nAnswer: Fell on his own sword.\n\n78.Question:  How many of his sons died in battle?\n\nAnswer: All of them.\n\n79. Question:  Who was David’s captain of his army?\n\nAnswer: Joab.\n\n80. Question: When David stayed in Jerusalem, what woman did he see and commit adultery with?\n\nAnswer: Bathsheba.\n\n81. Question: Who was Bathsheba’s husband?\n\nAnswer: Uriah.\n\n82. Question: When Bathsheba got pregnant, what did David make happen to Uriah?\n\nAnswer: Have him killed in battle.\n\n83. Question: What prophet came to rebuke David?\n\nAnswer: Nathan.\n\n84. Question: What happened to Bathsheba’s child?\n\nAnswer: The child died.\n\n85. Question: When Bathsheba and David had another child, what did they name him?\n\nAnswer: Solomon.\n\n86. Question: Who was David’s son that started a rebellion against him?\n\nAnswer: Absalom.\n\n87. Question: What capital city did David abandon?\n\nAnswer: Jerusalem.\n\n88. Question: When David and Absalom’s armies battled, what happened to Absalom’s hair?\n\n Answer: It got caught in a tree.\n\n89. Question: Who killed Absalom?\n\nAnswer: Joab.\n\n90. Question:  Because he killed Absalom, what was Joab’s punishment?\n\nAnswer: He got demoted as captain.\n\n91. Question: What was David’s second sin recorded in the Bible?\n\nAnswer: He took a census of the people in his nation.\n\n92. Question: Which books of the Bible record David’s time as king?\n\nAnswer: 1st and 2nd Samuel\n\n93. Question:  During his time as king, who was David’s main enemy?\n\nAnswer: Philistines.\n\n94.Question: What trait did Solomon pray for from God when he became king?\n\nAnswer: Wisdom\n\n95. Question: What did Solomon build for the Lord?\n\nAnswer: A temple.\n\n96. Question: What famous queen came to visit Solomon?\n\nAnswer: Queen of Sheba.\n\n97. Question: How many wives did Solomon have?\n\nAnswer: 700.\n\n98. Question: Did Solomon always follow the Lord?\n\nAnswer: No. He turned away from God.\n\n99. Question: Who convinced Solomon to turn from God?\n\nAnswer: His wives.\n\n100. Question: What happened to the kingdom after Solomon’s rule?\n\nAnswer: It split into two.\n\nHard Bible Questions (With Answers!)\niStock\n(iStock)\n1. Question: When Saul conquered the Amalekites, what person did he keep as a prisoner instead of killing like God said to?\n\nAnswer: The king, Agag.\n\n2. Question:  Which books of the Bible record all the kings?\n\nAnswer: 1st and 2nd Kings, 1st and 2nd Chronicles\n\n3. Question: Which books of the Bible did Solomon write?\n\nAnswer: Song of Solomon and Proverbs and some Psalms\n\n4. Question: How many kings of Judah were there?\n\nAnswer: 20\n\n5. Question: How many kings of Israel were there?\n\nAnswer: 19.\n\n6. Question: Who conquered Judah and took Daniel to their country?\n\nAnswer: The Babylonians.\n\n7. Question: Who was the last king Daniel served under in the Bible?\n\nAnswer:  King Nebuchadnezzar’s.\n\n8. Question: What happened to the kingdom after Solomon’s rule?\n\nAnswer: Darius\n\n9. Question: What were Daniel’s three friends (Babylonian names)?\n\nAnswer: Shadrach, Meshach, Abednego.\n\n10. Question: When they refused to bow to an idol, where were they thrown?\n\nAnswer: Into a fiery furnace.\n\n11. Question: Who returned to Israel to build up the walls of Jerusalem?\n\nAnswer: Nehemiah\n\n12. Question: What Israelite saved her people from being murdered and was a wife of the king?\n\nAnswer: Esther\n\n13. Question: How did Esther get to talk to the king?\n\nAnswer: Went in to talk without being summoned first.\n\n14. Question: Who let the Israelites return to their homeland?\n\nAnswer: Cyrus.\n\n15. Question: True or False: John the Baptist wore clothes made of goat hair.\n\nAnswer: False. It was camel hair.\n\n16. Question: True or False: At first, Jesus’ family tried to stop his ministry and said he was crazy.\n\nAnswer: True.\n\n17. Question: True or False: Jesus said his true family was anyone who obeys God.\n\nAnswer: True.\n\n18. Question: Which member of the Jewish ruling council came to ask Jesus questions at night?\n\nAnswer: Nicodemus\n\n19. Question: What was Matthew before he followed Jesus?\n\nAnswer: A tax collector.\n\n20. Question: True or False: Jesus would sometimes “spit” as part of his healing miracles.\n\nAnswer: True. The Bible describes him spitting three times.\n\n21.Question: How many days was Lazarus dead before Jesus came to visit?\n\nAnswer: Four days.\n\n22. Question: Who helped pay the bills for Jesus and the disciples ministry?\n\nAnswer: Several women who Jesus had healed.\n\n23. Question: Name the demon Jesus cast out in the region of the Gerasenes?\n\nAnswer: Legion.\n\n24. Question: True or False: While on Earth, Jesus had the power to raise dead people back to life?\n\nAnswer: True.\n\n25. Question: What was Peter and Andrew doing when Jesus called them to follow him?\n\nAnswer: Fishing.\n\n26. Question: Name the two Old Testament people who appeared when Jesus was transfigured?\n\nAnswer: Elijah and Moses\n\n27. Question: What problem did Bartimaeus have that Jesus fixed?\n\nAnswer: He was blind.\n\n28. Question: True or False: When Jesus went to the Temple, he always used his inside voice.\n\nAnswer: False. Jesus yelled at money chargers to drive them out.\n\n29. Question: True or False: Jesus said only big money offerings were important to God.\n\nAnswer: False.\n\n30. Question: What garden did Jesus go to when he prayed after the Last Supper?\n\nAnswer: Garden of Gethsemane.\n\n31. Question: True or False: The Jewish leaders tried to set Jesus free.\n\nAnswer: False. They wanted him to be crucified.\n\n32. Question: Who gave Jesus a crown made of thorns?\n\nAnswer: A Roman soldier.\n\n33. Question: Name the Roman Governor who sat over Jesus trial?\n\nAnswer: Pilate.\n\n34. Question: What did Pilate do to “cleanse himself” of the crucifixion?\n\nAnswer: Washed his hands.\n\n35. Question: Who cut off a soldier’s ear when Jesus was being arrested?\n\nAnswer: Peter.\n\n36. Question: How many people saw Jesus after he came back from the dead?\n\nAnswer: More than 500.\n\n37. Question: What was another name for the Apostle Paul?\n\nAnswer: Saul of Tarsus\n\n38. Question: Who preached at Pentecost?\n\nAnswer: Peter.\n\n39. Question: Who was Saul?\n\nAnswer: He persecuted Christians.\n\n40. Question: What happened when he was on the road to Damascus?\n\nAnswer: He had a changing experience with Jesus.\n\n41. Question: What was his name changed to?\n\nAnswer: Paul.\n\n42. Question: Who was exiled to an island?\n\nAnswer: John.\n\n43. Question: True or False: Ananias and Sapphira died after lying to the Apostles about their offering.\n\nAnswer: True\n\n44. Question: How many deacons were chosen to help the apostles to distribute food to widows?\n\nAnswer: Seven.\n\n45. Question: Which Apostle took the Gospel to the city of Samaria?\n\nAnswer: Philip.\n\n46. Question: Which Apostle shared the Gospel with an Ethiopian official on the road to Gaza?\n\nAnswer: Philip.\n\n47. Question: True or False: Peter raised a woman named Dorcas from the dead.\n\nAnswer: True.\n\n48. Question: Where did Peter stay during his ministry in the city of Joppa?\n\nAnswer: In the house of Simon the tanner.\n\n49. Question: What did Peter’s vision about the unclean animals mean?\n\nAnswer: That all people can be made clean through Jesus.\n\n50. Question: : In what city were Jesus’ followers first called “Christians”?\n\nAnswer: Antioch.\n\n51. Question: True or False: Peter was rescued from prison by an angel.\n\nAnswer: True.\n\n52. Question: Who went with Paul on his early mission trips?\n\nAnswer: Barnabas\n\n53. Question: True or False: Paul had a vision of a man calling him to come over to Carthage.\n\nAnswer: False. The man was from Macedonia.\n\n54. Question: True or False: God sent an earthquake to rescue Paul and Silas from prison in Philippi.\n\nAnswer: True. They didn’t escape but stayed in jail to share the good news\n\n55. Question: What did the Philippian jailer say to Paul after he heard the Gospel?\n\nAnswer: “What must I do to be saved?”\n\n56. Question: How did Paul and Silas respond?\n\nAnswer: “ Believe in the Lord Jesus, and you will be saved.”\n\n57. Question: What was Paul’s goal in his missionary journey?\n\nAnswer:  To take the gospel everywhere and finally to preach in the capitol Rome\n\n58. Question: Where can you find the 10 commandments in the Bible?\n\nAnswer: Exodus 20 and Deuteronomy 5.\n\n59. Question: What is the introduction to the Commandments?\n\nAnswer: I am the LORD your God who brought you out of Egypt.\n\n60. Question: Where is the Fruit of the Spirit found in the Bible?\n\nAnswer: Galatians 5\n\n61. Question: Which human author wrote Galatians?\n\nAnswer: Paul.\n\n62. Question: True or False: Bananas are a Fruit of the Spirit?\n\nAnswer: False. Even though bananas can seem like a gift from God, they are not considered a spiritual fruit in Galatians 5.\n\n63. Question: Name any of the 9 Fruits of the Spirit.\n\nAnswer: Love, Joy, Peace, Patience, Kindness, Goodness, Faithfulness, Gentleness and Self Control.\n\n64. Question: True or False: The opposite of the Fruit of the Spirit are called “the works of the flesh.”\n\nAnswer: True.\n\n65. Question:  Where in the Bible can you find the Lord’s Prayer?\n\nAnswer: Matthew 6.\n\n66. Question: Who taught the Lord’s Prayer?\n\nAnswer: Jesus.\n\n67. Question: How many requests are in the Lord’s Prayer?\n\nAnswer: Seven.\n\n68. Question: What is the 1st petition?\n\nAnswer: Hallowed be your name.\n\n69. Question: What is the 2nd petition?\n\nAnswer: Your kingdom come.\n\n70.Question: What is the 3rd petition?\n\nAnswer: Your will be done on Earth\n\n71. Question: What is the 4th petition?\n\nAnswer: Give us our daily bread.\n\n72. Question:  What is the 5th petition?\n\nAnswer: Forgive our debts\n\n73. Question: What is the 6th petition?\n\nAnswer: Don’t lead us into temptation.\n\n74. Question: What is the 7th petition?\n\nAnswer: Deliver us from evil.\n\n75. Question: True or False: The more words we say makes our prayers better.\n\nAnswer: False. Jesus said God already knows what we need.\n\n76. Question: Which disciple looked after Mary after the death of Jesus?\n\nAnswer: John the Evangelist.\n\n77. Question: What was the name of the man who requested Jesus’ body for burial?\n\nAnswer: Joseph of Arimathea\n\n78. Question: It is “better to obtain wisdom” than what?\n\nAnswer: Gold.\n\n79. Question: What reward did Jesus say the twelve apostles would get for forsaking everything and following him?\n\nAnswer: Jesus told them “You will sit on twelve thrones judging the twelve tribes of Israel.”\n\n80. Question: What was the name of the woman who hid the spies at Jericho?\n\nAnswer: Rahab.\n\n81. Question: What happened to the kingdom after Solomon’s rule?\n\nAnswer: It split into two.\n\n82. Question: In which book of the Bible do we find “Nebuchadnezzar’s image”?\n\nAnswer: Daniel\n\n83. Question: Which angel told Daniel the meaning of his vision of the ram and the goat?\n\nAnswer: Gabriel.\n\n84. Question: What should we “seek first”?\n\nAnswer: The Kingdom of God.\n\n85. Question: Fearing that Saul wanted to kill him, what lie did David ask Jonathan to tell his father if asked why he wasn’t at the king’s table for the New Moon feast?\n\nAnswer: David wanted Jonathan to tell him that he had gone to Bethlehem for a family gathering.\n\n86. Question: Of what, specifically, was man not allowed to eat in the Garden of Eden?\n\nAnswer: Apples aka the Forbidden Fruit.\n\n87. Question: Which tribe of Israel received no inheritance of land?\n\nAnswer: the Levites.\n\n88. Question: Who was king of the southern kingdom when the northern kingdom of Israel fell to Assyria?\n\nAnswer: Hezekiah\n\n89. Question: What was the name of Abraham’s nephew?\n\nAnswer: Lot.\n\n90. Question: Which missionary was described as having known the holy scriptures from an early age?\n\nAnswer: Timothy.\n\nParade Daily\nCelebrity interviews, recipes and health tips delivered to your inbox.\n\nEmail Address\n \nCommunity demands answers from LAPD after South LA explosion\n1.3K\n\n\nAd\n91. Question: Who escorted the slave with the letter to Philemon?\n\nAnswer: Tychicus.\n\n92. Question: Who was the father in law of Caiaphas, the high priest at the time of Jesus death?\n\nAnswer: Annas.\n\n93. Question: What happened to King Nebuchadnezzar before being restored as king?\n\nAnswer: He went mad and lived as a beast.\n\n94. Question: Who was Paul with when he wrote the letter to Philemon?\n\nAnswer: Timothy.\n\n95. Question: When the disciples saw Jesus walking on water, what did they think he was?\n\nAnswer: A ghost.\n\n96. Question: Who was to be named Zacharias, after the name of his father, until his mother intervened?\n\nAnswer: John.\n\n97. Question: What did the shepherds do after they had visited Jesus?\n\nAnswer: Spread the news about Jesus’s birth.\n\n98. Question: What did Melchizedek give to Abram?\n\nAnswer: Bread and wine.\n\n99. Question: Who went up yearly to worship God in Shiloh, and one year prayed to God for a baby?\n\nAnswer: Hannah.\n\n100. Question: Which two tribes of Israel were not named after sons of Jacob?\n\nAnswer: Ephraim and Manasseh.\t\n\nTrivia Question: How many books are in the New Testament?\nAnswer: 27\n\nTrivia Question: Paul was shipwrecked on what island?\nAnswer: Malta\n\n\nTrivia Question: Who recognized Jesus as the Messiah when he was presented to the Temple as a baby?\nAnswer: Simeon\n\nTrivia Question: After Jesus fed the 5,000, how many baskets were left over?\nAnswer: 12\n\nTrivia Question: In the Gospel of Mark, how does the Virgin Mary learn of her pregnancy\nAnswer: From the angel Gabriel\n\nbible trivia questions and answers\n\nTrivia Question: Who is the high priest of Jerusalem that put Jesus on trial?\nAnswer: Caiaphas\n\nTrivia Question: According to the Gospel of Matthew, where does Jesus give his first public sermon?\nAnswer: On the mount\n\nTrivia Question: How does Judas notify the Roman Officials of Jesus’ identity?\nAnswer: Judas kisses Jesus\n\n\nTrivia Question: Which insect did John the Baptist eat in the desert?\nAnswer: Locusts\n\nTrivia Question: Who were the first apostles called to follow Jesus?\nAnswer: Peter & Andrew\n\nTrivia Question: After Jesus was arrested, which apostle disowned him three times?\nAnswer: Peter\n\nTrivia Question: Who wrote the Book of Revelation?\nAnswer: John\n\nTrivia Question: Who asked Pilate for Jesus’ body after he was crucified?\nAnswer: Joseph of Arimathea\n\nTrivia Question: What is the shortest book in the New Testament?\nAnswer: 2 John\n\nTrivia Question: Who worked as a tax collector before preaching the word of God?\nAnswer: Matthew\n\n\nTrivia Question: Paul says Christians should follow whose example? (Ephesians 5)\nAnswer: Christ’s example\n\nTrivia Question: What did Saul encounter when he was traveling to Damascus?\nAnswer: A great and blinding light\n\nTrivia Question: What tribe is Paul from?\nAnswer: Benjamin\n\nTrivia Question: What was Simon Peter’s profession before becoming an apostle?\nAnswer: Fisherman\n\n\nbible trivia questions and answers\n\nTrivia Question: In the Acts of the Apostles, who is Stephen?\nAnswer: The first Christian martyr\n\nTrivia Question: In 1 Corinthians, which is the greatest of the imperishable qualities?\nAnswer: Love\n\nTrivia Question: In the Gospel According to John, which apostle doubts Jesus’ resurrection until he sees Jesus with his own eyes?\nAnswer: Thomas\n\nTrivia Question: Which Gospel mostly speaks on the mystery and identity of the person of Jesus?\nAnswer: The Gospel According to John\n\nTrivia Question: According to the Gospels, which literary genre does Jesus implement to help preach his message?\nAnswer: The parable\n\n\nTrivia Question: Which biblical narrative is connected to Palm Sunday?\nAnswer: Jesus’ entry into Jerusalem before his death\n\nTrivia Question: Which Gospel is written by a doctor?\nAnswer: Luke\n\nTrivia Question: Who baptizes Jesus?\nAnswer: John the Baptizer\n\nTrivia Question: Which group of people is righteous enough to inherit the Kingdom of God?\nAnswer: The Gentiles\n\nTrivia Question: What is the name of the village where Christ turned water into wine?\nAnswer: Cana of Galilee\n\nTrivia Question: How many people boarded Noah’s Ark?\nAnswer: Eight\n\n\nTrivia Question: How many days and nights did Jesus fast for?\nAnswer: 40 days & 40 nights\n\nTrivia Question: Which prophet is known for turning his rod into a bronze snake?\nAnswer: Moses\n\nTrivia Question: What is the Holy Trinity?\nAnswer: Father, Son, & the Holy Spirit\n\nTrivia Question: What did Joshua command to stay still?\nAnswer: Moon & Sun\n\nTrivia Question: How many days did it take God to create the heavens and the earth?\nAnswer: Seven\n\nTrivia Question: What did God use the rib of Adam to do?\nAnswer: Create Eve\n\n\nTrivia Question: What did the serpent tempt Eve to do in the Garden of Eden?\nAnswer: Eat the fruit from the trees that God forbid them to eat\n\nTrivia Question: Who were Adam & Eve’s first children?\nAnswer: Cain & Abel\n\nTrivia Question: What did God divide when He created Earth?\nAnswer: The light from the darkness\n\nbible trivia questions and answers\n\nTrivia Question: Who is Abraham’s wife?\nAnswer: Sarah\n\nTrivia Question: How many books are in the Bible?\nAnswer: 66\n\n\nTrivia Question: How many books are in the Old Testament?\nAnswer: 39\n\nTrivia Question: Where did God send Moses to deliver the children of Israel out of Egypt?\nAnswer: Pharaoh\n\nTrivia Question: How did God appear to Moses in the book of Exodus?\nAnswer: Through a burning bush on the mountain of God\n\nTrivia Question: How many plagues are in Exodus?\nAnswer: Ten\n\nTrivia Question: What are the ten plagues in order from Exodus?\nAnswer: blood, frogs, lice, flies, livestock pestilence, boils, hail, locusts, darkness, and the killing of firstborn children.\n\nTrivia Question: Why did God send the ten plagues?\nAnswer: Pharaoh refused to let the Israelites free\n\n\nbible trivia questions and answers\n\nTrivia Question: Who did Moses drown by closing the Red Sea?\nAnswer: The Egyptians\n\nTrivia Question: What is the first commandment out of the Ten Commandments?\nAnswer: “You shall have no other gods before me.”\n\nTrivia Question: What is the second commandment out of the Ten Commandments?\nAnswer: “You shall not make for yourself a carved image”; Thou shall not make idols.\n\nTrivia Question: What is the third commandment out of the Ten Commandments?\nAnswer: “You shall not take the name of the Lord your God in vain.”\n\nTrivia Question: What is the fourth commandment out of the Ten Commandments?\nAnswer: “Remember the Sabbath day, to keep it holy.”\n\nTrivia Question: What is the fifth commandment out of the Ten Commandments?\nAnswer: “Honor thy mother and father.”\n\nTrivia Question: What is the sixth commandment out of the Ten Commandments?\nAnswer: “Thou shalt not kill.”\n\nTrivia Question: What is the seventh commandment out of the Ten Commandments?\nAnswer: “Thou shalt not commit adultery.”\n\nTrivia Question: What is the eighth commandment out of the Ten Commandments?\nAnswer: “Thou shalt not steal.”\n\nTrivia Question: What is the ninth commandment out of the Ten Commandments?\nAnswer: “Thou shalt not bear false witness against thy neighbor.”\n\nTrivia Question: What is the tenth commandment out of the Ten Commandments?\nAnswer: “Thou shalt not covet.”\n\nTrivia Question: What did God create on the first day?\nAnswer: Light\n\nTrivia Question: What did God create on the second day?\nAnswer: Atmosphere/Firmament\n\nTrivia Question: What did God create on the third day?\nAnswer: Dry ground/Plants\n\nTrivia Question: What did God create on the fourth day?\nAnswer: The sun, moon, and stars\n\nTrivia Question: What did God create on the fifth day?\nAnswer: Birds/Sea animals\n\nTrivia Question: What did God create on the sixth day?\nAnswer: Land animals/Humans\n\nTrivia Question: What did God create on the seventh day?\nAnswer: Nothing, He rested\n\nTrivia Question: Who wore clothing made of camel hair?\nAnswer: John the Baptist\n\nTrivia Question: What is the river where John the Baptist did most of his baptizing?\nAnswer: Jordan River\n\nTrivia Question: What is the longest chapter of the Bible?\nAnswer: Psalm 119\n\nTrivia Question: How many Bible books did both Moses and the apostle John write?\nAnswer: Five\n\nTrivia Question: Who cried after hearing a rooster crow?\nAnswer: Peter\n\nTrivia Question: What is the last book of the Old Testament?\nAnswer: Malachi\n\nTrivia Question: Who is the first murderer in the Bible?\nAnswer: Cain\n\nTrivia Question: What was the final wound to the dead body of Jesus on the cross?\nAnswer: His side was pierced\n\nTrivia Question: What was Jesus’ crown made of?\nAnswer: Thorns\n\nTrivia Question: Which place is called “Zion” and “the city of David”?\nAnswer: Jerusalem\n\nTrivia Question: What is the town in Galilee that Jesus grew up in?\nAnswer: Nazareth\n\nTrivia Question: Who took Judas Iscariot’s place as an apostle?\nAnswer: Matthias\n\nTrivia Question: All who look to the Son and believe in him will have what?\nAnswer: Eternal life\n\nTrivia Question: Which book is the Gospel of the second chance?\nAnswer: Jonah\n\nTrivia Question: What is the area of Palestine where the tribe of Judah lived after the exile?\nAnswer: Judea\n\nTrivia Question: Who is the Savior?\nAnswer: Jesus Christ\n\nTrivia Question: What is the last book in the New Testament?\nAnswer: Revelation\n\nTrivia Question: On which day did Jesus rise from the dead?\nAnswer: The third day\n\nTrivia Question: Which men came from the East to worship Jesus after he was born?\nAnswer: The Magi\n\nTrivia Question: Which group was the ruling council of the Jews who plotted to kill Jesus?\nAnswer: The Sanhedrin\n\nTrivia Question: The Bible has how many divisions and sections?\nAnswer: Eight\n\nTrivia Question: Which prophet was called by the Lord as a boy and anointed Saul as Israel’s first king?\nAnswer: Samuel\n\nTrivia Question: What is a violation of God’s law called?\nAnswer: Sin\n\nTrivia Question: Which two rivers border Eden in modern-day Iraq?\nAnswer: Tigress and Euphrates\n\nTrivia Question: Which apostle walked on water?\nAnswer: Peter\n\nTrivia Question: When was the Trinity revealed?\nAnswer: At Jesus’ baptism\n\nTrivia Question: At which mountain did Moses receive the Ten Commandments?\nAnswer: Mount Sinai\n\nTrivia Question: Who is the mother of all living?\nAnswer: Eve\n\nTrivia Question: What did Pilate ask Jesus when he was arrested?\nAnswer: Are you the King of the Jews?\n\nTrivia Question: Where is the birthplace of Paul, also known as Saul? This is now located in modern-day Turkey.\nAnswer: Tarsus\n\nTrivia Question: What is the name of a person called by God to speak for Him?\nAnswer: A prophet\n\nTrivia Question: How do we give thanks in memory of Jesus?\nAnswer: The Lord’s Supper\n\nTrivia Question: God’s forgiveness provides what to all people?\nAnswer: Salvation\n\nTrivia Question: In which town did Jesus drive an evil spirit out of a man who called him the Holy One of God?\nAnswer: Capernaum\n\nTrivia Question: In which town did Jesus meet the woman at Jacob’s well?\nAnswer: Sychar\n\nTrivia Question: What do you drink from to have eternal life?\nAnswer: Living Water\n\nTrivia Question: Crafted by Aaron, the Israelites worshipped what idol while Moses was away?\nAnswer: The Golden Calf\n\nTrivia Question: What was the first town where Jesus began his ministry and was rejected?\nAnswer: Nazareth\n\nTrivia Question: Who cut off the ear of the high priest?\nAnswer: Peter\n\nTrivia Question: What is the shortest verse in the Bible?\nAnswer: “Jesus wept.”\n\nTrivia Question: At what age did Jesus start his ministry?\nAnswer: 30\n\nTrivia Question: What miracle did Jesus perform on the Sabbath?\nAnswer: Healing the man who was born blind\n\nTrivia Question: How many books did Paul write?\nAnswer: 13\n\nTrivia Question: King Herod promised what to his daughter on his birthday?\nAnswer: John the Baptist’s head\n\nTrivia Question: What Roman Governor presided over Judea during the trial of Jesus?\nAnswer: Pontius Pilate\n\nTrivia Question: In 2 Kings 7, who sacked the Syrian camp?\nAnswer: Lepers\n\nTrivia Question: In 2 Kings 8, how long is the famine that Elisha prophesizes?\nAnswer: 7 Years\n\nTrivia Question: How is Jezebel killed?\nAnswer: She is thrown from a window.\n\nTrivia Question: How many sons did Ahab have in Samaria?\nAnswer: 70\n\nTrivia Question: How many blemishes was a sacrificial beast allowed to have?\nAnswer: Zero\n\nTrivia Question: If a person sinned ignorantly at the time of Moses, what happened to them?\nAnswer: They had to sacrifice something\n\nTrivia Question: How many years did Sarah live?\nAnswer: 127\n\nTrivia Question: Who does God tell Abraham to sacrifice to prove his loyalty to Him?\nAnswer: Isaac\n\nTrivia Question: What is the name of the well that Abraham and Abimelach quarrel over?\nAnswer: Beersheba\n\nTrivia Question: In the Song of Songs, how much is the bride’s dowry?\nAnswer: 1,000 silver pieces\n\nTrivia Question: In 2 Sam 14, how did the wise woman disguise herself?\nAnswer: As a mourner\n\nTrivia Question: Who is David’s chief counselor?\nAnswer: Ahithophel\n\nTrivia Question: Who warned Paul of the plot against him?\nAnswer: His nephew\n\nTrivia Question: Who was the governor that heard the council’s case against Paul?\nAnswer: Felix\n\nTrivia Question: What did Felix feel when Paul told him of Christ?\nAnswer: Fear\n\nTrivia Question: How many days after birth is circumcision performed according to the Laws of Moses?\nAnswer: Eight\n\nTrivia Question: Who must we become like to enter the Kingdom of Heaven?\nAnswer: Children\n\nTrivia Question: According to Paul, who is the Head of the church?\nAnswer: Christ\n\nTrivia Question: Who was the King that crowned Esther the queen?\nAnswer: Ahasuerus\n\nTrivia Question: To create the plague of frogs, who stretched his rod over the waters of Egypt?\nAnswer: Aaron\n\nTrivia Question: What is the second book of the Bible?\nAnswer: Exodus\n\nTrivia Question: Which city mentioned in Revelation is also an American city?\nAnswer: Philadelphia\n\nTrivia Question: Who did God say would worship at the feet of the angel of the Church of Philadelphia?\nAnswer: The false Jews of the synagogue of Satan\n\nTrivia Question: What happened when the crew threw Jonah overboard?\nAnswer: The storm calmed\n\nTrivia Question: Where was the book of 2 Timothy written?\nAnswer: Rome\n\nTrivia Question: Who said, “The time of my departure is at hand”?\nAnswer: Paul\n\nTrivia Question: What animal is slain for the feast of Passover?\nAnswer: The lamb\n\nTrivia Question: Which plague of Egypt fell from the sky?\nAnswer: Hail\n\nTrivia Question: What was Moses’ sister’s name?\nAnswer: Miriam\n\nTrivia Question: How many children did King Rehoboam have?\nAnswer: 88\n\nTrivia Question: Who was King Solomon’s mother?\nAnswer: Bathsheba\n\nTrivia Question: Who was Samuel’s father?\nAnswer: Elkanah\n\nTrivia Question: Who was the disciple that Jesus loved?\nAnswer: John\n\nTrivia Question: Was John the Baptist a disciple?\nAnswer: No\n\nTrivia Question: How many Gospels are in the New Testament?\nAnswer: Four\n\nTrivia Question: What are the four Gospels in the New Testament?\nAnswer: Matthew, Mark, Luke, & John\n\nTrivia Question: Who is the book of Acts addressing?\nAnswer: The churches\n\nTrivia Question: How many horses appear in the book of Revelation?\nAnswer: Four\n\nTrivia Question: What color are the four horses in the book of Revelation?\nAnswer: White, Red, Dark, & Pale\n\nTrivia Question: Who did Peter raise from the dead in the city of Joppa?\nAnswer: Dorcas\n\nTrivia Question: Which disciple was crucified upside-down?\nAnswer: Peter\n\nTrivia Question: What two men in the Bible never died?\nAnswer: Elijah & Enoch\n\nTrivia Question: Who is the oldest man in the Bible?\nAnswer: Methuselah\n\nTrivia Question: Who is Methuselah’s father?\nAnswer: Enoch\n\nTrivia Question: How long did the Israelites wander through the wilderness?\nAnswer: 40 years\n\nTrivia Question: How many times did Noah send out a dove from the Ark?\nAnswer: Three times\n\nTrivia Question: What did the dove bring back that let Noah know that the water was receding?\nAnswer: A freshly plucked olive leaf\n\nTrivia Question: Who was pregnant at the same time as Mary?\nAnswer: Elizabeth\n\nTrivia Question: Who said, “Am I my brother’s keeper?”\nAnswer: Cain\n\nTrivia Question: What was the name of the forbidden tree Adam and Eve ate from?\nAnswer: The Tree of Life\n\nTrivia Question: What is the longest book in the Bible?\nAnswer: Psalms\n\nTrivia Question: How many Wise Men came to see Jesus when he was born?\nAnswer: Three\n\nTrivia Question: What were the gifts the Wise Men brought when they went to visit Jesus?\nAnswer: Gold, Frankincense, & Myrrh\n\nTrivia Question: What did God use to create Adam in the book of Genesis?\nAnswer: Dust\n\nTrivia Question: In the Old Testament, which prophet foretold of Jesus’ birth?\nAnswer: Micah\n\nTrivia Question: Who were the three men that were thrown into the fiery furnace?\nAnswer: Shadrach, Meshach, & Abednego\n\nTrivia Question: Which of the 12 apostles did not have his feet washed by Jesus?\nAnswer: Trick question, they all had their feet washed\n\nTrivia Question: What book of the Bible contains the Ten Commandments?\nAnswer: Exodus\n\nTrivia Question: Why did King Solomon threaten to cut a baby in half?\nAnswer: Two women were fighting over a child, each one claiming it was theirs; he offered to cut the baby in half and give each woman a half.\n\nTrivia Question: How did King Solomon know which woman was the birth mother?\nAnswer: She told him to give the other woman the baby\n\nTrivia Question: Who was the first hunter mentioned in the Bible?\nAnswer: Nimrod\n\nTrivia Question: Who was the only female judge mentioned in the Bible?\nAnswer: Deborah\n\nTrivia Question: Which woman washed Jesus’ feet?\nAnswer: Mary Magdalene\n\nTrivia Question: What language is the New Testament originally written in?\nAnswer: Greek\n\nTrivia Question: What does “Christ” mean?\nAnswer: Anointed\n\nTrivia Question: What religion did Jesus Christ practice?\nAnswer: Judaism\n\nTrivia Question: In the book of Genesis, why did the Lord decide to destroy mankind in a flood?\nAnswer: They had become wicked and had evil in their hearts\n\nTrivia Question: How many pairs of each “clean” animal did Noah take on the ark?\nAnswer: Seven pairs\n\nTrivia Question: How old was Noah when the flood began?\nAnswer: 600 years old\n\nTrivia Question: Where did the ark come to rest after the flood?\nAnswer: The mountains of Ararat\n\nTrivia Question: What was the covenant God made with Noah and his sons?\nAnswer: To never again send a flood to destroy the Earth\n\nTrivia Question: What was the sign of God’s covenant with Noah and his sons?\nAnswer: A rainbow\n\nTrivia Question: How old was Noah when he died?\nAnswer: 950\n\nTrivia Question: Jesus continues to be with us through what?\nAnswer: The Holy Spirit\n\nTrivia Question: How does Christ communicate his Holy Spirit to us today?\nAnswer: Through the sacraments\n\nTrivia Question: How many sacraments are there?\nAnswer: Seven\n\nTrivia Question: How many Beatitudes are there?\nAnswer: Eleven\n\nTrivia Question: Where did Jesus Christ preach the Beatitudes?\nAnswer: The Mount of Beatitudes\n\nTrivia Question: How many loaves and fishes did Jesus Christ feed the 5,000 with?\nAnswer: Five loaves and two fishes\n\nTrivia Question: “The Lord is my shepherd; I shall not want.” What Psalm does this Bible verse come from?\nAnswer: Psalm 23\n\nTrivia Question: What is the first verse of the Bible?\nAnswer: “In the beginning, God created the Heaven and the Earth.”\n\nTrivia Question: Complete this Bible verse: “I am the Lord thy God, which have brought thee out of the land of…”\nAnswer: Egypt\n\nTrivia Question: This Bible verse is from which Psalm? “Blessed is the man that walketh not in the counsel of the ungodly, nor standeth in the way of sinners, nor sitteth in the seat of the scornful,”\nAnswer: Psalm 1\n\nTrivia Question: What does K.J.V. stand for?\nAnswer: King James Version\n\nTrivia Question: What is the name of the river baby Moses floated down to escape?\nAnswer: The Nile\n\nTrivia Question: What is the devil’s angel name?\nAnswer: Lucifer\n\nTrivia Question: Who did King David have an affair with and then kill her husband?\nAnswer: Bathsheba\n\nTrivia Question: Who did the Jews set free that led to Jesus’ Crucifixion?\nAnswer: Barabas\n\nTrivia Question: What did Jesus mean when he said to his disciples, “Do this in remembrance of me”?\nAnswer: Communion\n\nTrivia Question: What were the crimes of the two men who were crucified with Jesus?\nAnswer: They were thieves\n\nTrivia Question: What is another term for the Via Dolorosa?\nAnswer: The way of suffering\n\nTrivia Question: How many days did it take for Jesus Christ to arrive after Lazarus’ death?\nAnswer: Four\n\nTrivia Question: What were Lazarus’ sister’s names?\nAnswer: Mary & Martha\n\nTrivia Question: Who was Jesus weeping over in the verse “Jesus wept”?\nAnswer: Lazarus\n\nTrivia Question: Finish the phrase, “Yea though I walk through the valley of the shadow of death…”\nAnswer: “I will fear no evil for Thou art with me.”\n\nTrivia Question: What did the devil offer Jesus if he bowed down and worshipped him?\nAnswer: All the kingdoms of the world and their splendor\n\nTrivia Question: What was Jesus’ profession?\nAnswer: Carpenter\n\nTrivia Question: What did Jesus turn into wine?\nAnswer: Water\n\nTrivia Question: Who demanded John the Baptist’s head on a platter?\nAnswer: Herodias\n\nTrivia Question: Finish the Beatitude: “Blessed be the meek…”\nAnswer: “…for they shall inherit the earth.”\n\nTrivia Question: With what did Samson kill 1,000 Philistines?\nAnswer: The jaw of a donkey\n\nTrivia Question: Where did David spare Saul’s life the first time?\nAnswer: In a cave\n\nTrivia Question: Where did David spare Saul’s life the second time?\nAnswer: In the camp where Saul was sleeping\n\nTrivia Question: How did Saul die?\nAnswer: He fell on his own sword\n\nTrivia Question: How many kings of Judah were there?\nAnswer: 20\n\nTrivia Question: How many kings of Israel were there?\nAnswer: 19\n\nTrivia Question: Finish the Beatitude: “Blessed be the poor in spirit…”\nAnswer: “…for they will inherit the kingdom of heaven.”\n\nTrivia Question: Finish the Beatitude: “Blessed are they that mourn…”\nAnswer: “…for they shall be comforted.”\n\nTrivia Question: Finish the Beatitude: “Blessed are they who hunger and thirst after righteousness…”\nAnswer: “…for they shall be filled.”\n\nTrivia Question: Finish the Beatitude: “Blessed are the merciful…”\nAnswer: “…for they shall obtain mercy.”\n\nTrivia Question: Finish the Beatitude: “Blessed are the pure in heart…”\nAnswer: “…for they shall see God.”\n\nTrivia Question: Finish the Beatitude: “Blessed are the peacemakers…”\nAnswer: “…for they shall be called the children of God.”\n\nTrivia Question: Finish the Beatitude: “Blessed are those who are persecuted because they are good…”\nAnswer: “…for the kingdom of heaven is theirs.”\n\nTrivia Question: Who is the comforter?\nAnswer: The Holy Spirit\n\nTrivia Question: How many works of the flesh are there?\nAnswer: 17\n\nTrivia Question: How many fruits of the Spirit are there?\nAnswer: 9\n\nTrivia Question: What are the fruits of the Spirit?\nAnswer: Love, Joy, Peace, Longsuffering, Gentleness, Goodness, Faith, Meekness, and Temperance\n\nTrivia Question: Who was thrown into the lion’s den by Darius\nAnswer: Daniel\n\nTrivia Question: What does the Lord anoint my head with?\nAnswer: Oil\n\nTrivia Question: After Jesus’ crucifixion, who took his body down from the cross?\nAnswer: Joseph of Arimathea\n\nTrivia Question: What did Judas receive for betraying Jesus?\nAnswer: 50 pieces of silver\n\nTrivia Question: After his resurrection, to whom did Jesus appear first?\nAnswer: Mary Magdalene\n\nTrivia Question: Who was the doubting disciple?\nAnswer: Thomas\n\nTrivia Question: How many people were at the Last Supper?\nAnswer: 13\n\nTrivia Question: What are we saved by?\nAnswer: God’s grace\n\nTrivia Question: In Ephesians, what does Paul say we should not let the sun go down upon?\nAnswer: Anger\n\nTrivia Question: In Philippians, what does Paul say we should think upon?\nAnswer: Things that are true, honest, just, pure, lovely, good, virtue, and praise.\n\nTrivia Question: Finish this phrase: “I can do all things through Christ…”\nAnswer: “…who strengthens me.”\n\nTrivia Question: Finish this phrase: “The effectual fervent prayer of a righteous man…”\nAnswer: “…avails much.”\n\nTrivia Question: Finish the phrase: “It is appointed to man once to die, after that…”\nAnswer: “…the judgment.”\n\nTrivia Question: Finish the phrase: “Faith is the substance of things hoped for…”\nAnswer: “…the evidence of things not seen.”\n\nTrivia Question: When Samuel picked David as king, God reminded us that while people look at the outward appearance, what does God look at?\nAnswer: The heart (Samuel 16:7)\n\nTrivia Question: Finish the phrase: After Jesus was baptized, God said, “This is my son whom I…”\nAnswer: “…love.”\n\nTrivia Question: Who was the first person to come upon the injured man in the parable of the Good Samaritan?\nAnswer: The priest\n\nTrivia Question: Which New Testament book has Jesus’ sermon on the Mount?\nAnswer: Matthew\n\nTrivia Question: How many times does the Bible mention the word “snow”?\nAnswer: 24\n\nTrivia Question: What did King Solomon ask God to give him?\nAnswer: Wisdom\n\nTrivia Question: What location does Jesus say to light a lamp for all to see?\nAnswer: On a stand\n\nTrivia Question: What piece of clothing made Joseph’s brothers jealous?\nAnswer: A coat\n\nTrivia Question: How many days was Jonah in the belly of the big fish?\nAnswer: three days & three nights\n\nTrivia Question: How much of his wealth did Zacchaeus give to the poor?\nAnswer: Half of it\n\nTrivia Question: What will be the outcome of honoring your father and your mother?\nAnswer: You will live long in the land\n\nTrivia Question: In Luke, the woman cleans Jesus’ feet with what two things?\nAnswer: Her tears and her hair\n\nTrivia Question: In which book of the Bible is this verse found: “Train up a child in the way he should go, and when he is old he will not turn from it.”\nAnswer: Proverbs\n\nTrivia Question: In Revelation, Jesus says: “Do not be afraid, I am the _____ and the ______ .”\nAnswer: First & Last\n\nTrivia Question: Complete the verse: “The _____ ______ of the wise are more to be heeded than the shouts of a ruler of fools.”\nAnswer: Quiet words\n\nTrivia Question: Where in the New Testament does it talk about the perseverance of Job?\nAnswer: James\n\nTrivia Question: What is the name commonly given to the first five books of the Old Testament?\nAnswer: The Pentateuch\n\nTrivia Question: What does the word Pentateuch mean?\nAnswer: “five books” or “five scrolls”\n\nTrivia Question: What are the names of the twins that wrestled in their mother’s womb?\nAnswer: Jacob & Esau\n\nTrivia Question: When Jesus died, what three things happened?\nAnswer: Earthquake, the veil in the temple torn, tombs broke open\n\nTrivia Question: Noah sent two birds from the ark; what were they?\nAnswer: A dove & a raven\n\nTrivia Question: Out of the two birds Noah sent from the ark, which did he send first?\nAnswer: The raven\n\nTrivia Question: How was Ruth related to Naomi?\nAnswer: Ruth was Naomi’s daughter-in-law\n\nTrivia Question: At what age did Moses die?\nAnswer: 120\n\nTrivia Question: What is “the sting of death”?\nAnswer: Sin\n\nTrivia Question: Who was Caesar when Jesus was born?\nAnswer: Augustus\n\nTrivia Question: Who was asked to name all animals?\nAnswer: Adam\n\nTrivia Question: Whose father tied him up and put him on the altar as a sacrifice until Jehovah provided a sheep?\nAnswer: Isaac\n\nTrivia Question: Who is the wife of Jacob?\nAnswer: Rachel\n\nTrivia Question: Which Midianite woman married Moses?\nAnswer: Zipporah\n\nTrivia Question: What girl was offered as a sacrifice by her father?\nAnswer: Jephthah’s daughter\n\nTrivia Question: Which Egyptian wife caused Joseph to be thrown into prison?\nAnswer: The wife of Potiphar\n\nTrivia Question: In the book of Daniel, the beast is described as being as swift as what animal?\nAnswer: Leopard\n\nTrivia Question: Jesus is often referred to as being what animal?\nAnswer: Lamb\n\nTrivia Question: What kind of animals were the Israelites commanded to bring to God as a sacrifice?\nAnswer: Firstborn animals\n\nTrivia Question: How many years were the Israelites in captivity when Ezekiel received his Vision of Jerusalem?\nAnswer: Six years\n\nTrivia Question: What was the one thing Elijah left behind when God took him to heaven?\nAnswer: His cloak\n\nTrivia Question: What is described as an “unruly evil full of deadly poison”?\nAnswer: The tongue\n\nTrivia Question: “We are made as the filth of the world, and are the offscouring of all things unto this day,” wrote Paul, referring to what?\nAnswer: The apostles\n\nTrivia Question: How does faith come?\nAnswer: By hearing the word of God\n\nTrivia Question: What wife of Nabal later became David’s wife?\nAnswer: Abigail\n\nTrivia Question: Noah was tenth in line from which man?\nAnswer: Adam\n\nTrivia Question: Which mischievous woman tricked Samson into revealing the secret of his strength?\nAnswer: Delilah\n\nTrivia Question: After the start of his trials, Job calls down evil upon which day?\nAnswer: His birthday\n\nTrivia Question: When Jesus cast out demons, they entered into which animals, causing them to go off a cliff?\nAnswer: Swine\n\nTrivia Question: Which commandment is honor thy father and mother?\nAnswer: Fifth\n\nTrivia Question: Who said: “Why are you hitting your fellow Hebrew?”\nAnswer: Moses\n\nTrivia Question: What prophet fled to Tarshish when he got caught up in a storm?\nAnswer: Jonah\n\nTrivia Question: Who was Jesse’s grandson and was the richest and most powerful kind in Israel’s history?\nAnswer: Solomon\n\nTrivia Question: Which prophet was fed by ravens?\nAnswer: Elijah\n\nTrivia Question: Who was the king to which the Lord said, “Let my people go”?\nAnswer: Pharaoh\n\nTrivia Question: Who goes to Sunday School?\nAnswer:  Children\n\nTrivia Question: What do children learn at Sunday School?\nAnswer: They learn about the Word of God\n\nTrivia Question: How do first become children of God?\nAnswer: Through Salvation\n\nTrivia Question: What is a Bible Bowl?\nAnswer: A national competition where children grades 3-12 are quizzed on their knowledge of scripture\n\nTrivia Question: Who started Sunday School?\nAnswer: Robert Raikes & Thomas Stock\n\nTrivia Question: What will we receive when the Holy Spirit comes upon us?\nAnswer: Power\n\nTrivia Question: What is the gift that is given to all of us (Acts)?\nAnswer: The Holy Spirit\n\nTrivia Question: What is the last word in the Bible?\nAnswer: Amen\n\nTrivia Question: Who wrote the book of Hebrews?\nAnswer: It is believed to be Paul\n\nTrivia Question: What does “Mara” mean?\nAnswer: “Bitter”\n\nTrivia Question: Who inspired the people to write the Bible?\nAnswer: The Holy Spirit\n\nTrivia Question: Who is called our Father of Faith?\nAnswer: Abraham\n\nTrivia Question: Where do we read the nine Gifts of the Holy Spirit?\nAnswer: 1 Corinthians 12:8-11\n\nTrivia Question: Why did the man who had to be lowered through the roof want to be healed?\nAnswer: He was paralyzed\n\nTrivia Question: Who is the patron saint for lost items?\nAnswer: St. Anthony\n\nTrivia Question: What is another name for reconciliation?\nAnswer: Confession\n\nTrivia Question: How many disciples are there?\nAnswer: 12\n\nTrivia Question: What happened to Lots wife when she looked back at the city of Sodom?\nAnswer: She turned into a pillar of salt\n\nTrivia Question: Out of the mouth of which animal did a coin appear in the book of Matthew?\nAnswer: Fish\n\nTrivia Question: As the Israelites were marching, which animal approached them and had a discussion?\nAnswer: A donkey\n\nTrivia Question: How did Ehud lose his knife?\nAnswer: He stuck it into the King’s fat, and the fat consumed it\n\nTrivia Question: Which animal were men mauled by when they insulted Elisha?\nAnswer: Bears\n\nTrivia Question: Men were mauled by bears when they insulted Elisha for what?\nAnswer: Being bald\n\nTrivia Question: How did the Holy Spirit descend onto the apostles during Pentecost?\nAnswer: In a flaming fire\n\nTrivia Question: What is Pentecost?\nAnswer: When the Holy Spirit descended onto the apostles in flaming fire to give them the gifts, thus proclaiming the good news of Jesus.\n\nTrivia Question: What is the sacrament in which we first become children of God?\nAnswer: Baptism\n\nTrivia Question: Who was the boy who killed a giant?\nAnswer: David\n\nTrivia Question: What does “Eve” mean?\nAnswer: Mother of all living\n\nTrivia Question: Why is Easter celebrated?\nAnswer: It is the day of Jesus Christ’s Resurrection\n\nTrivia Question: Which Queen visited King Solomon because she had heard of his fame?\nAnswer: The Queen of Sheba\n\nTrivia Question: True or False, the word “Easter” appears in the Old Testament?\nAnswer: False\n\nTrivia Question: The Easter sunrise service, a distinctive Protestant observance in North America, comes from what Biblical event?\nAnswer: A reenactment of Mary Magdalene’s visit to Jesus’ tomb on the morning of his Resurrection\n\nTrivia Question: Who is the man that wanted to kill baby Jesus?\nAnswer: King Herod\n\nTrivia Question: How many books of poetry are in the Old Testament?\nAnswer: Five\n\nTrivia Question: Ten men with what condition were healed by Jesus?\nAnswer: Leprosy\n\nTrivia Question: In the book of Genesis, God did what to Adam and Eve when he found that they had sinned?\nAnswer: He expelled them\n\nTrivia Question: What was the animal Satan appeared as to Eve in the book of Genesis?\nAnswer: Serpent\n\nTrivia Question: Which book tells of seven seals and seven trumpets?\nAnswer: Revelation\n\nTrivia Question: What does “Epistle” mean?\nAnswer: Letter\n\nTrivia Question: Jesus said, what is the greatest display of love?\nAnswer: That a man would lay down his life for a friend\n\nTrivia Question: Which prophet had to lay on his left side for six months?\nAnswer: Ezekiel\n\nTrivia Question: What was the name of the demon who possessed the man in the tomb?\nAnswer: Legion\n\nTrivia Question: What happened to Joseph when he refused to sin with his master’s wife?\nAnswer: He was put in jail\n\nTrivia Question: What is it called to have an unusual happening that goes against the laws of nature?\nAnswer: Miracles\n\nTrivia Question: In the book of Job, dinosaurs are called what?\nAnswer: Behemoths\n\nTrivia Question: Which Pharisee had a private meeting with Jesus at night?\nAnswer: Nicodemus\n\nTrivia Question: Which chapter of Hebrews tells of great heroes of faith?\nAnswer: Hebrews 11\n\nTrivia Question: Which book tells of Paul’s conversion?\nAnswer: Acts\n\nTrivia Question: Isaiah lived in which city?\nAnswer: Jerusalem\n\nTrivia Question: Which country was Ahab the king of?\nAnswer: Israel\n\nTrivia Question: Finish this phrase: We are not saved by our own works; we are saved by ____ ?\nAnswer: Grace\n\nTrivia Question: David used what to kill Goliath?\nAnswer: A sling and a stone\n\nTrivia Question: What are the bread and wine Jesus served the disciples at the Last Supper?\nAnswer: Body & Blood, Soul & Divinity of Jesus Christ\n\nTrivia Question: Why is Easter considered the most important Christian celebration?\nAnswer: The Resurrection means that God’s promise to save His people (Salvation) is fulfilled.\n\nTrivia Question: Even though he promised Jesus he would die for him, what did Peter do when Jesus was arrested?\nAnswer: He denied that he knew Jesus three times.\n\nTrivia Question: Who was the first murder victim?\nAnswer: Abel\n\nTrivia Question: Where did the term “the kiss of death” come from?\nAnswer: The signal that Judas used to betray Jesus (he kissed Jesus on the cheek).","questions":[{"id":0,"question":"In cubits, what were the dimensions the temple that Solomon built? [length x breadth x height]","choices":["10 x 10 x 10","50 x 100 x 50","60 x 20 x 30"],"tags":"kings ot","scripture":"1 Kings 6:2"},{"id":1,"question":"Where on the Modern World Map does the Story of Esther take place?","choices":["America","Morocco","Iran"],"tags":"esther place"},{"id":2,"question":"How many books of the Bible are named after women?","choices":[1,2],"tags":"esther number"},{"id":3,"question":"How many times can we find the name 'Ahaserus' in the book of Esther?","choices":[14,21,28],"tags":"esther number"},{"id":4,"question":"How many times can we find the name 'Esther' in the book of Esther?","choices":[92,20,11,46],"tags":"esther number"},{"id":5,"question":"How many chapters in the book of Esther?","choices":[6,8,10],"tags":"esther number"},{"id":6,"question":"[GUESS] How many verses are in the book of Esther?","choices":[1,67,567,167],"tags":"esther number guess"},{"id":7,"question":"[GUESS] Which chapter in Esther has the most verses?","choices":[1,5,10,4,9],"tags":"esther number"},{"id":8,"question":"What did Hiram call the 20 cites from Solomon?","choices":["Blessings","Treasure Cities","Deserted","Cabul"],"tags":"kings ot","image":{"src":"","coords":{"top":"","left":""}},"scripture":"1 Kings 9:13"},{"id":9,"question":"What is the name of the first Jewish Ecclesiastical  month?","choices":["Adar","Tishri","Nisan"],"tags":"esther calendar"},{"id":10,"question":"Why was Joab killed?","choices":["He built an altar"," He killed Absalom","He rebuked the king","He followed Adonijah in his rebellion"],"tags":"kings ot","image":{"src":"","coords":{"top":"","left":""}},"scripture":"1 Kings 1:6"},{"id":11,"question":"Over how many provinces did Ahasuerus reign?","scripture":"Esther 1:1","choices":["12","75","101","115","127"],"tags":"esther number","image":{"src":"","coords":{"top":"","left":""}}},{"question":"What colors were the curtains in King Ahasuerus' garden?","scripture":"Esther 1:6","choices":["white, green, and blue"],"tags":"esther colors","image":{"src":"","coords":{"top":"","left":""}},"audio":"","id":12},{"question":"Where was King Ahasuerus' palace located?","scripture":"Esther 1:2","choices":["Shushan"],"tags":"esther place","image":{"src":"","coords":{"top":"","left":""}},"audio":"","id":13},{"id":14,"question":"What were the names of the king’s seven chamberlains?","scripture":"Esther 1:10","choices":["Mehuman, Biztha, Harbona, Bigtha, and Abagtha, Zethar, and Carcas"],"tags":"esther"},{"id":15,"question":"In which year of Ahasuerus’ reign does the book begin?","scripture":"Esther 1:3","choices":["The third year"],"tags":"esther"},{"id":16,"question":"Name the seven princes of Persia","scripture":"Esther 1:14","choices":["Carshena, Shethar, Admatha, Tarshish, Meres, Marsena, and Memucan"],"tags":"esther"},{"id":17,"question":"For how many days did Ahasuerus show off the wonders of the kingdom to the princes?","scripture":"Esther 1:4","choices":[180],"tags":"esther"},{"id":18,"question":"Who was Mordecai’s father?","scripture":"Esther 2:5","choices":["Jair"],"tags":"esther"},{"id":19,"question":"Which prince of Persia gave the king the plan to replace Vashti?","scripture":"Esther 1:16","choices":["Memucan"],"tags":"esther"},{"id":20,"question":"Q: Who did Esther send to the gate to speak to Mordecai? (4:5)","scripture":"Esther","choices":["Hatach"],"tags":"esther"},{"id":21,"question":"What tribe was Mordecai from? (2:5)","scripture":"Esther","choices":["Benjamin"],"tags":"esther"},{"id":22,"question":"In which year of Ahasuerus’ reign did Esther become queen? (2:16)","scripture":"Esther","choices":["The seventh"],"tags":"esther"},{"id":23,"question":"Who was the king that had brought the Jews to Babylon? (2:6)","scripture":"Esther","choices":["Nebuchadnezzer"],"tags":"esther"},{"id":24,"question":"What day was planned for the destruction of the Jews? (3:13)","scripture":"Esther","choices":["The 13th day of the 12th month (Adar)"],"tags":"esther"},{"id":25,"question":"Who was the keeper of the women? (2:8)","scripture":"Esther","choices":["Hegai"],"tags":"esther"},{"id":26,"question":"What people is Haman from? (3:1)","scripture":"Esther","choices":["Agagite"],"tags":"esther"},{"id":27,"question":"Who was Esther’s father? (2:15)","scripture":"Esther","choices":["Abihail"],"tags":"esther"},{"id":28,"question":"Who was Haman’s father? (3:10)","scripture":"Esther","choices":["Hemedatha"],"tags":"esther"},{"id":29,"question":"Who was Haman’s wife? (5:10)","scripture":"Esther","choices":["Zeresh"],"tags":"esther"},{"id":30,"question":"How much money was Haman willing to give the king to get rid of the Jews? (3:9)","scripture":"Esther","choices":["Ten thousand talents"],"tags":"esther"},{"id":31,"question":"How tall was the gallows that Haman built? (5:14)","scripture":"Esther","choices":["50 cubits"],"tags":"esther"},{"question":"The king's letter was carried by riders travelling in what 4 ways? (Esther 8:10)","scripture":"Esther","choices":["horseback + mules + camels + young dromedaries"],"tags":"esther","image":{"src":"","coords":{"top":"","left":""}},"audio":"","id":32},{"id":33,"question":"How many sons did Haman have? (9:10)","scripture":"Esther","choices":[10],"tags":"esther"},{"id":34,"question":"What colors did Mordecai wear when the king promoted him? (8:15)","scripture":"Esther","choices":["blue, white, gold, purple"],"tags":"esther"},{"id":35,"question":"Who is traditionally recognized as the author of the book of Esther?","scripture":"Esther","choices":["Mordecai"],"tags":"esther"},{"id":36,"question":"Describe Mordecai's and Esther's relationship? (Esther 2:7)","scripture":"Esther","choices":["Esther is the daughter of Mordecai's uncle."],"tags":"esther"},{"id":37,"question":"[TRUE OR FALSE] Esther was an orphan.","scripture":"Esther 2:7","choices":["FALSE","TRUE"],"tags":"esther"},{"id":38,"question":"Where is the longest verse in the Bible? (Esther 8:9)","scripture":"Esther","choices":["Esther 8:9"],"tags":"esther"},{"id":39,"question":"What did the king do with Haman's ring? (Esther 8:2)","scripture":"Esther","choices":["He gave it to Mordecai"],"tags":"esther"},{"id":40,"question":"Name the ten sons of Haman:","scripture":"Esther","choices":["Parshandatha, Dalphon, Aspatha, Poratha, and Adalia, Aridatha, Parmashta, Arisai, Aridai, Vajezatha"],"tags":"esther"},{"id":41,"question":"What kind of words did Mordecai speak to all his seed?","scripture":"Esther","choices":["peace"],"tags":"esther"},{"id":42,"question":"Why did many of the people of the land become Jews? (Esther 8:17)","scripture":"Esther","choices":["for the fear of the Jews fell upon them"],"tags":"esther"},{"id":43,"question":"What is a tribute?","scripture":"Esther","choices":["a tax"],"tags":"esther vocabulary"},{"id":44,"question":"Complete the following: The Jews had light, and gladness, and joy and _________.","scripture":"Esther 8:7","choices":["faith","truth","love","honour"],"tags":"esther fill-in-the-blank","image":{"src":"","coords":{"top":"","left":""}}},{"id":45,"question":"What kind of words did the letters sent unto all the Jews contain?","scripture":"Esther","choices":["peace and truth"],"tags":"esther"},{"id":46,"question":"What was Esther's request (2 parts) for the second day of Purim?","scripture":"Esther","choices":["For Jews in Shushan to do again tomorrow what they did today and Hang Haman's 10 so"],"tags":"esther"},{"id":47,"question":"Who was both great among the Jews and second unto King Ahaserus?","scripture":"Esther","choices":["Mordecai"],"tags":"esther"},{"id":48,"question":"On what day were the Jews to be killed? (Esther 3:13)","scripture":"Esther","choices":["the thirteenth day of the twelfth month, which is the month Adar"],"tags":"esther"},{"id":49,"question":"How many men did the Jews slay in both the Palace and the city of Shushan?","scripture":"Esther","choices":[800],"tags":"esther"},{"id":50,"question":"How many days had it been since Esther had been called into the king's courtroom in Esther 4? (Esther 4:11)","scripture":"Esther","choices":["10","15","20","25","30"],"tags":"esther","image":{"src":"","coords":{"top":"","left":""}}},{"id":51,"question":"On what number day of the feast did the King call Vashti to his palace? (Esther 1:10)","scripture":"Esther","choices":[7],"tags":"esther"},{"id":52,"question":"How many cubits tall was the gallows that Zeresh suggested to be built? (Esther 5:14)","scripture":"Esther","choices":[50],"tags":"esther"},{"id":53,"question":"How long did it take Solomon to build the temple?","scripture":"1 Kings 7:1","choices":["3","11","21","7"],"tags":"kings ot","image":{"src":"","coords":{"top":"","left":""}}},{"id":54,"question":"How many talents of silver did Haman give to the people who would destroy the Jews? (Esther 3:9 $3.4 billion)","scripture":"Esther","choices":[10000],"tags":"esther"},{"id":55,"question":"In what year of the king's reign did he have the feast? (Esther 1:3)","scripture":"Esther","choices":[3],"tags":"esther"},{"id":56,"question":"In what number month, and in what number year of Ahaserus' reign was Esther taken unto the king? (Esther 2:16)","scripture":"Esther","choices":["10th month (Tebeth), 7th year of king Ahasuerus' reign"],"tags":"esther"},{"id":57,"question":"What did the king give Haman so he could accomplish his plot? (Esther 3:11)","scripture":"Esther","choices":["silver"],"tags":"esther"},{"id":58,"question":"What kind of scepter did the king have? (Esther 4:11)","scripture":"Esther","choices":["gold"],"tags":"esther"},{"id":59,"question":"At the king's feast in chapter 1, what colors where the beds?","scripture":"Esther","choices":["gold and silver"],"tags":"esther"},{"id":60,"question":"What colors were the hangings in the garden of the king's palace? (Esther 1:6)","scripture":"Esther","choices":["green, white, blue"],"tags":"esther"},{"id":61,"question":"What is a Hebrew word for 'lots'? (There's a Hebrew Holy Day Named after this root word.)","scripture":"Esther 3:7","choices":["Yahweh","Toda","Sababa","Pur"],"tags":"esther","image":{"src":"","coords":{"top":"","left":""}}},{"id":62,"question":"What was Haman's father's name? (Esther 3:1)","scripture":"Esther","choices":["Hammedatha the Agagite"],"tags":"esther"},{"id":63,"question":"Which of the king's chamberlains acted as messenger between Mordecai and Esther? (Esther 4:5)","scripture":"Esther","choices":["Hatach"],"tags":"esther"},{"id":64,"question":"What kind of banquet did Esther invite the king and Haman? (Esther 5:6)","scripture":"Esther","choices":["Banquet of Wine"],"tags":"esther"},{"id":65,"question":"What was Haman's wife's name? (Esther 5:10)","scripture":"Esther","choices":["Zeresh"],"tags":"esther"},{"id":66,"question":"What is the name of the book the king commanded to be read as he was going to sleep? (Esther 6:1)","scripture":"Esther","choices":["the book of records of the chronicles"],"tags":"esther"},{"id":67,"question":"Who was trying to kill Esther and all the jews? (Esther 7:6)","scripture":"Esther","choices":["Haman"],"tags":"esther"},{"id":68,"question":"Who did the king specifically tell to hang Haman? (Esther 7:9,10)","scripture":"Esther","choices":["Harbonah"],"tags":"esther"},{"id":69,"question":"What is Esther's Hebrew name? (Esther 2:7)","scripture":"Esther","choices":["Hadassah"],"tags":"esther"},{"id":70,"question":"Which wiseman  gave the king the idea to banish queen Vashti? (Esther 1:16)","scripture":"Esther","choices":["Memucan"],"tags":"esther"},{"id":71,"question":"What did they call the feast celebrating Esther's coronation? (Esther 2:18)","scripture":"Esther","choices":["Esther's Feast"],"tags":"esther"},{"id":72,"question":"Who was the keeper of the women? (Esther 2:8)","scripture":"Esther","choices":["Hegai"],"tags":"esther"},{"id":73,"question":"Name the chamberlains who planned to kill the king (Esther 2:21)","scripture":"Esther","choices":["Bigthan and Teresh"],"tags":"esther"},{"id":74,"question":"[TRUE or FALSE] Haman intended to kill all the Jewish children. (Esther 3:13)","scripture":"Esther","choices":["FALSE","TRUE"],"tags":"esther"},{"id":75,"question":"[TRUE or FALSE] The Jews finally pray to God according to Esther 4:16 when Esther was to go before the king. (Esther 4:16)","scripture":"Esther","choices":["TRUE","FALSE"],"tags":"esther"},{"id":76,"question":"[TRUE or FALSE] When Esther drew near to the king, she kissed his ring.","scripture":"Esther","choices":["true","false"],"tags":"esther true-or-false","image":{"src":"","coords":{"top":"","left":""}}},{"id":77,"question":"What other king did Solomon ask to help with building the temple?","scripture":"1 Kings 5:6","choices":["Melchizedek","Aram","Jehoram","Hiram"],"tags":"kings ot","image":{"src":"","coords":{"top":"","left":""}}},{"id":78,"question":"What is one of the ways that Mordecai mourned the danger Haman posed to all Jews?","scripture":"Esther 4:1","choices":["gathered an army","begged Haman for mercy","built a gallows","rent his clothes"],"tags":"esther","image":{"src":"","coords":{"top":"","left":""}}},{"id":79,"question":"How long did it take Solomon to build His own house?","scripture":"1 Kings 6:38","choices":["3","5","8","11","13"],"tags":"kings ot","image":{"src":"","coords":{"top":"","left":""}}},{"id":80,"question":"Where did king Ahasuerus go when considering Esther's declaration?","scripture":"Esther 7:7","choices":["bedroom","throne room","hallway","palace garden"],"tags":"esther place","image":{"src":"","coords":{"top":"","left":""}}},{"id":81,"question":"Where was the days of purification kept for Esther and all the women?","scripture":"Esther 2:3","choices":["Jerusalem","Egypt","Babylon","Shushan"],"tags":"esther ot","image":{"src":"","coords":{"top":"","left":""}}},{"id":82,"question":"[Esther] Where did the women of King Ahaseurus' harem have to leave in order to come to the king's house?","scripture":"Esther 2:13","choices":["the kitchen house"," the gaurded house"," the house of worship","the house of the women"],"tags":"esther ot","image":{"src":"","coords":{"top":"","left":""}}},{"id":83,"question":"What did Haman have to say while parading Mordecai through the streets? (Esther 6:9)","scripture":"Esther","choices":["Jews are Our Friends"," Trust only in the God of Israel"," Follow us to the temple of God","Thus shall it be done to the man whom the king delights to honour"],"tags":"esther","image":{"src":"","coords":{"top":"","left":""}}},{"id":84,"question":"What did they immediately do to Haman when the king  said, 'Will he force the queen also before me...?'","scripture":"Esther 7:8","choices":["hanged Haman","shot Haman","caned Haman","covered Haman's face"],"tags":"esther","image":{"src":"","coords":{"top":"","left":""}}},{"id":85,"question":"Why did King Ahaserus have such a big feast? (Esther 1:3)","scripture":"Esther","choices":["to have a good time","to deceive his guests","to get rid of his wife","to show off his riches"],"tags":"esther","image":{"src":"","coords":{"top":"","left":""}}},{"question":"What was Vashti's punishment for refusing King Ahasuerus?","scripture":"Esther","choices":["She was demoted","She was whipped 7 times","She had to fast 7 days","She was banished from the kingdom"],"tags":"esther","image":{"src":"","coords":{"top":"","left":""}},"audio":"","id":86},{"id":87,"question":"How did Mordecai check up on Esther every day of her time of purification? (Esther 2:11)","scripture":"Esther","choices":["He would ask Memucan","He wrote secret letters","He couldn't","He walked every day before the court of the women's house"],"tags":"esther","image":{"src":"","coords":{"top":"","left":""}}},{"id":88,"question":"In 1 kings Chapter 1, we read about Adonijah exalting himself as king. Who was Adonijah's Mother?","scripture":"1 Kings 1:5","choices":["Obadiah"," Jonah"," Mark"," Haggith"],"tags":"kings","image":{"src":"","coords":{"top":"","left":""}}},{"id":89,"question":"Who built the ark?","choices":["jason","adam","jonah","noah"],"image":{"src":"","coords":{"top":"","left":""}},"tags":"ark flood ot","scripture":"Genesis 6:14"},{"id":90,"question":"What is the first book of the Bible?","choices":["Revelation","Matthew","Esther","Amos","Genesis"],"image":{"src":"","coords":{"top":"","left":""}},"tags":"general","scripture":"Genesis 1:1"},{"id":91,"question":"What is the last book of the Bible?","choices":["Matthew","Esther","Ezekiel","Genesis","Revelation"],"image":{"src":"","coords":{"top":"","left":""}},"tags":"general","scripture":"Revelation 1:1"},{"id":92,"audio":"/audio/matthew7.mp3","question":"[What chapter in Matthew?] Judge not, that ye be not judged. For with what judgment ye judge, ye shall be judged: and with what measure ye mete, it shall be measured to you again.","choices":["Matthew 2","Matthew 21","Matthew 22","Matthew 7"],"image":{"src":"","coords":{"top":"","left":""}},"scripture":"Matthew 7:1","tags":"critic mercy"},{"id":93,"audio":"/audio/matthew1.mp3","question":"[What chapter in Matthew?] Abraham begat Isaac; and Isaac begat Jacob; and Jacob begat Judas and his brethren; And Judas begat Phares and Zara of Thamar; and Phares begat Esrom; and Esrom begat Aram;","choices":["Matthew 5","Matthew 4","Matthew 3","Matthew 2","Matthew 1"],"image":{"src":"","coords":{"top":"","left":""}},"scripture":"Matthew 1:2,3","tags":"geneology jesus"},{"id":94,"audio":"/audio/matthew16.mp3","question":"[What chapter in Matthew?] When it is evening, ye say, It will be fair weather: for the sky is red. And in the morning, It will be foul weather to day: for the sky is red and lowring. O ye hypocrites, ye can discern the face of the sky; but can ye not discern the signs of the times?","choices":["Matthew 2","Matthew 25","Matthew 10","Matthew 7","Matthew 16"],"image":{"src":"","coords":{"top":"","left":""}},"scripture":"Matthew 16:3","tags":"time discern tempt"},{"id":95,"audio":"/audio/matthew6.mp3","question":"[What chapter in Matthew?] After this manner therefore pray ye: Our Father which art in heaven, Hallowed be thy name. Thy kingdom come. Thy will be done in earth, as it is in heaven.","choices":["Matthew 11","Matthew 12","Matthew 15","Matthew 6"],"image":{"src":"","coords":{"top":"","left":""}},"scripture":"Matthew 6:9","tags":"prayer"},{"id":96,"audio":"/audio/matthew28.mp3","question":"[What chapter in Matthew?] Go ye therefore, and teach all nations, baptizing them in the name of the Father, and of the Son, and of the Holy Ghost:","choices":["Matthew 14","Matthew 22","Matthew 11","Matthew 28"],"image":{"src":"","coords":{"top":"","left":""}},"scripture":"Matthew 28","tags":"witness preach testify commission"},{"id":97,"audio":"/audio/matthew17.mp3","question":"[What chapter in Matthew?] And after six days Jesus taketh Peter, James, and John his brother, and bringeth them up into an high mountain apart, And was transfigured before them: and his face did shine as the sun, and his raiment was white as the light.","choices":["Matthew 4","Matthew 7","Mathew 1","Matthew 17"],"image":{"src":"","coords":{"top":"","left":""}},"scripture":"Matthew 171","tags":"transfiguration disciples moses"},{"id":98,"question":"[Matthew 1] Judas begat who?","choices":["Naasson","Boaz","Salmon","Phares"],"image":{"src":"","coords":{"top":"","left":""}},"tags":"geneology jesus","scripture":"Matthew 1:3"},{"id":99,"question":"[closest answer] Joseph 'putting Mary away privately' meant what for Mary?","choices":["euthanasia","jail","nunnery","divorce(in a sense)"],"image":{"src":"","coords":{"top":"","left":""}},"tags":"putting away nativity baby jesus","scripture":"Matthew 1:19"},{"id":100,"question":"Wise men from where came searching for Jesus?","choices":["China","Russia","North","West","East"],"image":{"src":"","coords":{"top":"","left":""}},"scripture":"Matthew 2:1","tags":"birth baby nativity"},{"id":101,"question":"Which OT prophet prophesied Herod's slaughter of the young children?","choices":["Obadiah","Isaiah","John","Jeremiah"],"image":{"src":"","coords":{"top":"","left":""}},"scripture":"Jeremiah 31:15","tags":"messiah prophecy"},{"id":102,"question":"Matthew 3, where was John the Baptist preaching?","choices":["Jerusalem","Wilderness of Zin","Wilderness of Galilee","Wilderness of Judaea"],"image":{"src":"","coords":{"top":"","left":""}},"scripture":"Matthew 3:1","tags":"sermon teach baptist"},{"id":103,"question":"What animal hair did John dress in?","choices":["badger","bear","dog","camel"],"image":{"src":"","coords":{"top":"","left":""}},"scripture":"Matthew 3:4","tags":"baptist animal camel"},{"id":104,"question":"The Holy Ghost came on Jesus in the form of what animal?","choices":["lion","lamb","eagle","dove"],"image":{"src":"","coords":{"top":"","left":""}},"scripture":"Matthew 3:16","tags":"animal spirit baptism"},{"id":105,"question":"What did the voice from Heaven say after His Baptism?","choices":["Seek the Kingdom","Repent for the kingdom is at hand.","Be ye baptized likewise","This is is my beloved Son in whom I am well pleased."],"image":{"src":"","coords":{"top":"","left":""}},"scripture":"Matthew 3:17","tags":"baptism approval"},{"id":106,"question":"How many days did Jesus fast before his temptation in the wilderness","choices":["0-7","8-14","15-20","40"],"image":{"src":"","coords":{"top":"","left":""}},"scripture":"Matthew 4:2","tags":"fast temptation discipline"},{"id":107,"question":"In Matthew 4, Jesus promised to make his disciples what?","choices":["Honest Tax Collectors","Delivered Deliverers","Makers of Salt","Fishers of Men"],"image":{"src":"","coords":{"top":"","left":""}},"scripture":"Matthew 4:19","tags":"witness soulwinning disciple fish animal"},{"id":108,"question":"What was James and John's Dad's name?","choices":["Isaiah","Iscariot","Zebulon","Zebedee"],"image":{"src":"","coords":{"top":"","left":""}},"scripture":"Matthew 4:21","tags":"disciple"},{"id":109,"question":"What is a beattitude?","choices":["good idea","good temper","character flaw","a state of bliss or blessing"],"image":{"src":"","coords":{"top":"","left":""}},"tags":"beattitude sermon blessing","scripture":"Matthew 5:3"},{"id":110,"question":"[Beattitudes] What is promised to the poor in spirit?","choices":["comfort","the earth","called the children of God","the kingdom of heaven"],"image":{"src":"","coords":{"top":"","left":""}},"scripture":"Matthew 5:3","tags":"poor humble beattitude sermon blessing"},{"id":111,"question":"[Beattitudes] What is promised to the meek?","choices":["great wealth","called the children of God","the kingdom of heaven","the earth"],"image":{"src":"https://images.pexels.com/photos/891607/pexels-photo-891607.jpeg?auto=compress&cs=tinysrgb&dpr=1&w=500","coords":{"top":"","left":""}},"scripture":"Matthew 5:5","tags":"meek beattitude sermon"},{"id":112,"question":"[Beattitudes] What is promised to the pure in heart?","choices":["comfort","the earth","called the children of God","shall see God"],"image":{"src":"","coords":{"top":"","left":""}},"scripture":"Matthew 5:8","tags":"beatitude heart pure"},{"id":113,"question":"[Beattitudes] What is promised to the peace makers?","choices":["love","comfort","the earth","called the children of God"],"image":{"src":"","coords":{"top":"","left":""}},"scripture":"Matthew 5:9","tags":"beatitudes teaching sermon peace"},{"id":114,"question":"How many Beattitudes does Jesus give Matthew 5?","choices":["10","5","6","8"],"image":{"src":"https://i.swncdn.com/media/1200w/cms/BST/46375-sermon-on-mount.800w.tn.webp","coords":{"top":"","left":""}},"scripture":"Matthew 5","tags":"virtue blessing sermon"},{"id":115,"question":"What is the name of this BODY OF WATER?","image":{"src":"/img/israel-blank.jpg","coords":{"top":33,"left":185}},"choices":["Red Sea","Jordan","Dead Sea","Sea of Galilee"],"tags":"map sea place"},{"id":116,"question":"What is the name of this BODY OF WATER?","image":{"src":"/img/israel-blank.jpg","coords":{"top":50,"left":25}},"choices":["Jordan","Dead Sea","Sea of Galilee","Mediterranean Sea"],"tags":"map place sea"},{"id":117,"question":"What is the name of this BODY OF WATER?","image":{"src":"/img/israel-blank.jpg","coords":{"top":300,"left":165}},"choices":["Mediterranean Sea","Jordan","Salt Sea","Dead Sea"],"tags":"map place"},{"question":"Who tried to usurp Solomons throne?","scripture":"1 Kings 1:1","choices":["David","Rehoboam","Absalom","Adonijah"],"tags":"king solomon","image":{"src":"","coords":{"top":"","left":""}},"audio":"","id":118},{"question":"What did Samson eat out of a lion?","scripture":"Judges 14:8,9","choices":["meat","kidney","heart","honey"],"tags":"food","image":{"src":"https://www.w3.org/TR/2000/NOTE-SVG-access-20000807/tiger.png","coords":{"top":"","left":""}},"audio":"","id":119},{"id":120,"question":"Solomon asked Hiram for trees from where?","choices":["Tyre","Sidon","Ethiopia","Lebanon"],"tags":"esther place","image":{"src":"","coords":{"top":"","left":""}},"scripture":"1 Kings 5:6"},{"id":121,"question":"Solomon built 3 Houses: 1) Solomon's House, 2) God's House and a third house for whom?","choices":["Solomon's Mother","the High Priest","Pharaoh's Daughter"],"tags":"kings ot place","image":{"src":"","coords":{"top":"","left":""}},"scripture":"1 Kings 7:1,8,51"}]}